{
  "lastUpdated": "2026-01-19T06:22:43.448Z",
  "totalItems": 204,
  "sources": {
    "whatsNew": 95,
    "mlBlog": 20,
    "newsBlog": 20,
    "bigDataBlog": 16,
    "architectureBlog": 17,
    "computeBlog": 19,
    "developersAndDevOps": 17
  },
  "items": [
    {
      "id": "aws-news-480e3eb14bac",
      "title": "Simplify network segmentation for AWS Outposts racks with multiple local gateway routing domains",
      "description": "AWS now supports multiple local gateway (LGW) routing domains on AWS Outposts racks to simplify network segmentation. Network segmentation is the practice of splitting a computer network into isolated subnetworks, or network segments. This reduces the attack surface so that if a host on one network segment is compromised, the hosts on the other network segments are not affected. Many customers in regulated industries such as manufacturing, health care and life sciences, banking, and others implement network segmentation as part of their on-premises network security standards to reduce the impact of a breach and help address compliance requirements.",
      "link": "https://aws.amazon.com/blogs/compute/simplify-network-segmentation-for-aws-outposts-racks-with-multiple-local-gateway-routing-domains/",
      "pubDate": "2026-01-16T18:49:35.000Z",
      "source": "computeBlog",
      "services": [
        "rds",
        "outposts"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "rds",
        "outposts",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-c3967861f923",
      "title": "Amazon MWAA now available in additional Region",
      "description": "Amazon Managed Workflows for Apache Airflow (MWAA) is now available in AWS Region Asia Pacific (Thailand).\n  Amazon MWAA is a managed service for Apache Airflow that lets you use the same familiar Apache Airflow platform as you do today to orchestrate your workflows and enjoy improved scalability, availability, and security without the operational burden of having to manage the underlying infrastructure. Learn more about using Amazon MWAA on the product page.\n Please visit the AWS region table for more information on AWS regions and services. To learn more about Amazon MWAA visit the Amazon MWAA documentation.\n  Apache, Apache Airflow, and Airflow are either registered trademarks or trademarks of the Apache Software Foundation in the United States and/or other countries.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-mwaa-additional-region",
      "pubDate": "2026-01-16T18:01:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "now-available"
      ]
    },
    {
      "id": "aws-news-5a88f7fdee58",
      "title": "AWS Outposts racks support multiple LGW routing domains",
      "description": "AWS Outposts racks now support multiple local gateway (LGW) routing domains, enabling you to create up to 10 isolated routing domains per Outpost, each with independent route tables and BGP sessions to your on-premises network. This feature provides traffic separation between routing domains and enables both customer-owned IP (CoIP) and direct VPC routing (DVR) modes on the same Outpost.\n  With multiple LGW routing domains, you can segment on-premises network connectivity for different departments or business units sharing an Outpost. Each routing domain maintains its own LGW VIF Group, LGW Route Table, and VPC associations, preventing traffic from crossing between domains. You can configure multiple LGW routing domains through the AWS Management Console or AWS CLI.\n  Multiple LGW routing domains is available on second-generation Outposts racks at no additional charge. See the FAQs for Outposts racks for the latest list of supported AWS Regions.\n  To learn more about implementation details and best practices, check out this blog post or visit our technical documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/aws-outposts-multiple-lgw-routing-domain",
      "pubDate": "2026-01-16T17:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "outposts"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "outposts",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-3bf74b37e9fd",
      "title": "Advanced fine-tuning techniques for multi-agent orchestration: Patterns from Amazon at scale",
      "description": "In this post, we show you how fine-tuning enabled a 33% reduction in dangerous medication errors (Amazon Pharmacy), engineering 80% human effort reduction (Amazon Global Engineering Services), and content quality assessments improving 77% to 96% accuracy (Amazon A+). This post details the techniques behind these outcomes: from foundational methods like Supervised Fine-Tuning (SFT) (instruction tuning), and Proximal Policy Optimization (PPO), to Direct Preference Optimization (DPO) for human alignment, to cutting-edge reasoning optimizations such as Grouped-based Reinforcement Learning from Policy Optimization (GRPO), Direct Advantage Policy Optimization (DAPO), and Group Sequence Policy Optimization (GSPO) purpose-built for agentic systems.",
      "link": "https://aws.amazon.com/blogs/machine-learning/advanced-fine-tuning-techniques-for-multi-agent-orchestration-patterns-from-amazon-at-scale/",
      "pubDate": "2026-01-16T15:51:21.000Z",
      "source": "mlBlog",
      "services": [],
      "categories": [
        "generative-ai"
      ],
      "tags": []
    },
    {
      "id": "aws-news-4d20717331d3",
      "title": "How Palo Alto Networks enhanced device security infra log analysis with Amazon Bedrock",
      "description": "Palo Alto Networks’ Device Security team wanted to detect early warning signs of potential production issues to provide more time to SMEs to react to these emerging problems. They partnered with the AWS Generative AI Innovation Center (GenAIIC) to develop an automated log classification pipeline powered by Amazon Bedrock. In this post, we discuss how Amazon Bedrock, through Anthropic’ s Claude Haiku model, and Amazon Titan Text Embeddings work together to automatically classify and analyze log data. We explore how this automated pipeline detects critical issues, examine the solution architecture, and share implementation insights that have delivered measurable operational improvements.",
      "link": "https://aws.amazon.com/blogs/machine-learning/how-palo-alto-networks-enhanced-device-security-infra-log-analysis-with-amazon-bedrock/",
      "pubDate": "2026-01-16T15:46:36.000Z",
      "source": "mlBlog",
      "services": [
        "bedrock",
        "nova"
      ],
      "categories": [
        "foundation-models"
      ],
      "tags": [
        "bedrock",
        "nova",
        "improvement"
      ]
    },
    {
      "id": "aws-news-da78d9353891",
      "title": "From beginner to champion: A student’s journey through the AWS AI League ASEAN finals",
      "description": "The AWS AI League, launched by Amazon Web Services (AWS), expanded its reach to the Association of Southeast Asian Nations (ASEAN) last year, welcoming student participants from Singapore, Indonesia, Malaysia, Thailand, Vietnam, and the Philippines. In this blog post, you’ll hear directly from the AWS AI League champion, Blix D. Foryasen, as he shares his reflection on the challenges, breakthroughs, and key lessons discovered throughout the competition.",
      "link": "https://aws.amazon.com/blogs/machine-learning/from-beginner-to-champion-a-students-journey-through-the-aws-ai-league-asean-finals/",
      "pubDate": "2026-01-16T15:41:55.000Z",
      "source": "mlBlog",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "launch",
        "ga"
      ]
    },
    {
      "id": "aws-news-dafc81891e3c",
      "title": "Deploy AI agents on Amazon Bedrock AgentCore using GitHub Actions",
      "description": "In this post, we demonstrate how to use a GitHub Actions workflow to automate the deployment of AI agents on AgentCore Runtime. This approach delivers a scalable solution with enterprise-level security controls, providing complete continuous integration and delivery (CI/CD) automation.",
      "link": "https://aws.amazon.com/blogs/machine-learning/deploy-ai-agents-on-amazon-bedrock-agentcore-using-github-actions/",
      "pubDate": "2026-01-16T15:37:37.000Z",
      "source": "mlBlog",
      "services": [
        "bedrock",
        "agentcore"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "bedrock",
        "agentcore",
        "integration"
      ]
    },
    {
      "id": "aws-news-7db19ac88c01",
      "title": "Second-generation AWS Outposts racks are now supported in additional AWS Regions",
      "description": "Second-generation AWS Outposts racks are now supported in the South America (Sao Paulo) and Europe (Stockholm) Regions. Outposts racks extend AWS infrastructure, AWS services, APIs, and tools to virtually any on-premises data center or colocation space for a truly consistent hybrid experience.\n  Organizations from startups to enterprises and the public sector in and outside of Europe and South America can now order their Outposts racks connected to these new supported regions, optimizing for their latency and data residency needs. Outposts allows customers to run workloads that need low latency access to on-premises systems locally while connecting back to their home Region for application management. Customers can also use Outposts and AWS services to manage and process data that needs to remain on-premises to meet data residency requirements. This regional expansion provides additional flexibility in the AWS Regions that customers’ Outposts can connect to.\n  To learn more about second-generation Outposts racks, read this blog post and user guide. For the most updated list of countries and territories and the AWS Regions where second-generation Outposts racks are supported, check out the Outposts rack FAQs page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/second-generation-aws-outposts-racks-additional-aws-regions",
      "pubDate": "2026-01-16T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "organizations",
        "outposts"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "lex",
        "organizations",
        "outposts",
        "ga",
        "update",
        "support",
        "expansion"
      ]
    },
    {
      "id": "aws-news-ea45111d9de9",
      "title": "Amazon S3 Storage Lens is now available in AWS GovCloud (US) Regions",
      "description": "Amazon S3 Storage Lens provides organization-wide visibility into your storage usage and activity. S3 Storage Lens is now available in AWS GovCloud (US) Regions, bringing metrics to help you optimize storage costs, identify data protection opportunities, and improve application performance.\n  S3 Storage Lens provides a single view of object storage usage and activity across thousands of accounts in an organization, with drill-downs to generate insights at multiple aggregation levels. You can optimize storage costs by identifying prefixes with incomplete multipart uploads or buckets accumulating non-current object versions. You can identify buckets that don’t follow your data protection best practices, such as using S3 Cross-Region Replication to replicate data across AWS Regions or S3 Versioning to keep multiple versions of an object. With the newly added performance metrics, you can identify application performance constraints—for example, using request and object size distribution metrics to detect inefficient access patterns or tracking cross-Region data transfer to reduce latency and costs.\n  Amazon S3 Storage Lens is available in all AWS Regions. S3 Storage Lens is pre-configured to receive free metrics by default for all customers and 14 days of historical data. For more detailed visibility with up to 15 months data retention, you can upgrade to S3 Storage Lens advanced metrics. To learn more about S3 Storage Lens metrics, including free and advanced metrics, refer to the documentation. For S3 Storage Lens Advanced pricing details, visit the Amazon S3 pricing page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/s3-storage-lens-aws-govcloud-us-regions/",
      "pubDate": "2026-01-16T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "s3"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "s3",
        "ga",
        "now-available"
      ]
    },
    {
      "id": "aws-news-de9d2d19ffe3",
      "title": "Amazon EC2 X8i instances powered by custom Intel Xeon 6 processors are generally available for memory-intensive workloads",
      "description": "AWS is announcing the general availability of Amazon EC2 X8i instances, next-generation memory optimized instances powered by custom Intel Xeon 6 processors available only on AWS. X8i instances are SAP-certified and deliver the highest performance and fastest memory bandwidth among comparable Intel processors in the cloud.",
      "link": "https://aws.amazon.com/blogs/aws/amazon-ec2-x8i-instances-powered-by-custom-intel-xeon-6-processors-are-generally-available-for-memory-intensive-workloads/",
      "pubDate": "2026-01-15T22:52:17.000Z",
      "source": "newsBlog",
      "services": [
        "ec2"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "ec2",
        "generally-available"
      ]
    },
    {
      "id": "aws-news-e46072da544d",
      "title": "Using Amazon EMR DeltaStreamer to stream data to multiple Apache Hudi tables",
      "description": "In this post, we show you how to implement real-time data ingestion from multiple Kafka topics to Apache Hudi tables using Amazon EMR. This solution streamlines data ingestion by processing multiple Amazon Managed Streaming for Apache Kafka (Amazon MSK) topics in parallel while providing data quality and scalability through change data capture (CDC) and Apache Hudi.",
      "link": "https://aws.amazon.com/blogs/big-data/using-amazon-emr-deltastreamer-to-stream-data-to-multiple-apache-hudi-tables/",
      "pubDate": "2026-01-15T21:48:25.000Z",
      "source": "bigDataBlog",
      "services": [
        "emr",
        "kafka",
        "msk"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "emr",
        "kafka",
        "msk"
      ]
    },
    {
      "id": "aws-news-19244e48adfe",
      "title": "Amazon S3 on Outposts is now available on second-generation AWS Outposts racks",
      "description": "Amazon S3 on Outposts is now available on second-generation AWS Outposts racks for your data residency, low latency, and local data processing use cases on-premises. S3 on Outposts on second-generation Outposts racks offers three storage tiers: 196 TB, 490 TB, and 786 TB. Choose the storage tier that matches your workload, whether for production workloads, backups, or archival workloads.\n  With S3 on Outposts, you can store, secure, retrieve, and control access to your data using familiar S3 APIs and features. AWS Outposts is a fully managed service that extends AWS infrastructure, services, and tools to virtually any data center, co-location space, or on-premises facility for a consistent hybrid experience.\n  S3 on Outposts on second-generation Outposts racks is available in all AWS Regions and countries/territories where these racks are available. To learn more, visit the S3 on Outposts page or read our documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-s3-second-generation-aws-outposts-racks",
      "pubDate": "2026-01-15T20:23:00.000Z",
      "source": "whatsNew",
      "services": [
        "s3",
        "outposts"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "s3",
        "outposts",
        "now-available"
      ]
    },
    {
      "id": "aws-news-e91498b12d6e",
      "title": "AWS Clean Rooms now supports parameters in PySpark analysis templates",
      "description": "AWS Clean Rooms announces support for parameters in PySpark analysis templates, offering increased flexibility for organizations and their partners to scale their privacy-enhanced data collaboration use cases. With this launch, you can create a single PySpark analysis template that allows different values to be provided by the Clean Rooms collaborator running a job at submission time without modifying the template code. With parameters in PySpark analysis templates, the code author creates a PySpark template with parameters support, and if approved to run, the job runner submits parameter values directly to the PySpark job. For example, a measurement company running attribution analysis for advertising campaigns can input time windows and geographic regions dynamically to surface insights that drive campaign optimizations and media planning accelerating time-to-insights.\n \n\n With AWS Clean Rooms, customers can create a secure data clean room in minutes and collaborate with any company on AWS or Snowflake to generate unique insights about advertising campaigns, investment decisions, and research and development. For more information about the AWS Regions where AWS Clean Rooms is available, see the AWS Regions table. To learn more about collaborating with AWS Clean Rooms, visit AWS Clean Rooms.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/aws-clean-rooms-parameters-pyspark-analysis-templates/",
      "pubDate": "2026-01-15T18:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "lex",
        "organizations",
        "launch",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-6d8e3008fa1a",
      "title": "AWS Databases are now available on v0 by Vercel",
      "description": "Amazon Aurora PostgreSQL, Amazon Aurora DSQL, and Amazon DynamoDB serverless databases are now available on v0 by Vercel, an AI-powered tool that transforms your ideas into production-ready, full-stack web applications in minutes. With this launch, you can build your ideas as well as create and connect to AWS databases from v0 using natural language prompts.\n  To get started, simply describe what you want to build in v0. The tool takes care of developing the frontend user interface and backend logic, storing your application data in the AWS database that best meets your application needs. v0 provides an end-to-end setup experience where you can choose and configure database resources under a new AWS account or link to an existing account, all without leaving v0 interface. New AWS accounts from Vercel include access to all three databases and $100 USD in credits that can be used with any of the database options for up to six months. You can also manage your plan, add payment information, and view usage details anytime by visiting the AWS settings portal from the Vercel dashboard. To learn more, visit v0 or the AWS landing page on the Vercel Marketplace.\n  The serverless options for Amazon Aurora PostgreSQL, Amazon Aurora DSQL, and Amazon DynamoDB do not require infrastructure management and reduce costs by scaling down to zero automatically when not in use. You can create a database in the following AWS Regions: US East (N. Virginia), US East (Ohio), US West (Oregon), Europe (Ireland), Europe (Frankfurt), Asia Pacific (Tokyo), and Asia Pacific (Mumbai).\n  AWS Databases deliver security, reliability, and price performance without the operational overhead, whether you're prototyping your next big idea or running production AI and data driven applications. For more information, visit the AWS Databases webpage.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/aws-databases-available-vercel-v0/",
      "pubDate": "2026-01-15T18:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "dynamodb"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "dynamodb",
        "launch",
        "now-available"
      ]
    },
    {
      "id": "aws-news-441e607bd84f",
      "title": "Unlock granular resource control with queue-based QMR in Amazon Redshift Serverless",
      "description": "With Amazon Redshift Serverless queue-based Query Monitoring Rules (QMR), administrators can define workload-aware thresholds and automated actions at the queue level—a significant improvement over previous workgroup-level monitoring. You can create dedicated queues for distinct workloads such as BI reporting, ad hoc analysis, or data engineering, then apply queue-specific rules to automatically abort, log, or restrict queries that exceed execution-time or resource-consumption limits. By isolating workloads and enforcing targeted controls, this approach protects mission-critical queries, improves performance predictability, and prevents resource monopolization—all while maintaining the flexibility of a serverless experience. In this post, we discuss how you can implement your workloads with query queues in Redshift Serverless.",
      "link": "https://aws.amazon.com/blogs/big-data/unlock-granular-resource-control-with-queue-based-qmr-in-amazon-redshift-serverless/",
      "pubDate": "2026-01-15T16:29:47.000Z",
      "source": "bigDataBlog",
      "services": [
        "lex",
        "redshift"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "redshift",
        "improvement"
      ]
    },
    {
      "id": "aws-news-2874895cbd5f",
      "title": "Announcing Amazon EC2 Memory optimized X8i instances",
      "description": "Amazon Web Services (AWS) is announcing the general availability of Amazon EC2 X8i instances, next-generation memory optimized instances powered by custom Intel Xeon 6 processors available only on AWS. X8i instances are SAP-certified and deliver the highest performance and fastest memory bandwidth among comparable Intel processors in the cloud. They deliver up to 43% higher performance, 1.5x more memory capacity (up to 6TB), and 3.4x more memory bandwidth compared to previous generation X2i instances.\n  X8i instances are designed for memory-intensive workloads like SAP HANA, large databases, data analytics, and Electronic Design Automation (EDA). Compared to X2i instances, X8i instances offer up to 50% higher SAPS performance, up to 47% faster PostgreSQL performance, 88% faster Memcached performance, and 46% faster AI inference performance. X8i instances come in 14 sizes, from large to 96xlarge, including two bare metal options.\n  X8i instances are available in the following AWS Regions: US East (N. Virginia), US East (Ohio), US West (Oregon), and Europe (Frankfurt).\n  To get started, visit the AWS Management Console. X8i instances can be purchased via Savings Plans, On-Demand instances, and Spot instances. For more information visit X8i instances page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/aws-amazon-ec2-x8i-generally-available",
      "pubDate": "2026-01-15T16:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2"
      ]
    },
    {
      "id": "aws-news-1d1cf97c35ee",
      "title": "Amazon Connect now provides agent scheduling metrics in data lake",
      "description": "Amazon Connect now provides agent scheduling metrics in data lake, making it easier for you to generate reports and insights from this data. For example, after publishing schedules for next month, you can access interval level (15 minutes or 30 minutes) metrics such as forecasted headcount, scheduled headcount, and projected service level in Connect analytics data lake. You can view aggregated metrics for an entire business unit (forecast group) or broken down by specific demand segments (demand groups). You can then visualize this data in Amazon Quick Sight or another BI tool of your choice for further analysis, such as identifying periods of over or under-staffing. This eliminates the need for manual reviews of agent schedules thus improving productivity for schedulers and supervisors.\n  This feature is available in all AWS Regions where Amazon Connect agent scheduling is available. To learn more about Amazon Connect agent scheduling, click here.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-connect-scheduling-metrics/",
      "pubDate": "2026-01-15T16:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "amazon q",
        "forecast"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "amazon q",
        "forecast",
        "ga"
      ]
    },
    {
      "id": "aws-news-8a1ede3e0418",
      "title": "How the Amazon AMET Payments team accelerates test case generation with Strands Agents",
      "description": "In this post, we explain how we overcame the limitations of single-agent AI systems through a human-centric approach, implemented structured outputs to significantly reduce hallucinations and built a scalable solution now positioned for expansion across the AMET QA team and later across other QA teams in International Emerging Stores and Payments (IESP) Org.",
      "link": "https://aws.amazon.com/blogs/machine-learning/how-the-amazon-amet-payments-team-accelerates-test-case-generation-with-strands-agents/",
      "pubDate": "2026-01-15T15:55:35.000Z",
      "source": "mlBlog",
      "services": [],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "expansion"
      ]
    },
    {
      "id": "aws-news-067620c2a122",
      "title": "Build a generative AI-powered business reporting solution with Amazon Bedrock",
      "description": "This post introduces generative AI guided business reporting—with a focus on writing achievements & challenges about your business—providing a smart, practical solution that helps simplify and accelerate internal communication and reporting.",
      "link": "https://aws.amazon.com/blogs/machine-learning/build-a-generative-ai-powered-business-reporting-solution-with-amazon-bedrock/",
      "pubDate": "2026-01-15T15:53:15.000Z",
      "source": "mlBlog",
      "services": [
        "bedrock"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "bedrock"
      ]
    },
    {
      "id": "aws-news-0277e0cc75dc",
      "title": "Safeguard generative AI applications with Amazon Bedrock Guardrails",
      "description": "In this post, we demonstrate how you can address these challenges by adding centralized safeguards to a custom multi-provider generative AI gateway using Amazon Bedrock Guardrails.",
      "link": "https://aws.amazon.com/blogs/machine-learning/safeguard-generative-ai-applications-with-amazon-bedrock-guardrails/",
      "pubDate": "2026-01-15T15:50:54.000Z",
      "source": "mlBlog",
      "services": [
        "bedrock",
        "rds"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "bedrock",
        "rds",
        "ga"
      ]
    },
    {
      "id": "aws-news-ada5748d03cb",
      "title": "Scale creative asset discovery with Amazon Nova Multimodal Embeddings unified vector search",
      "description": "In this post, we describe how you can use Amazon Nova Multimodal Embeddings to retrieve specific video segments. We also review a real-world use case in which Nova Multimodal Embeddings achieved a recall success rate of 96.7% and a high-precision recall of 73.3% (returning the target content in the top two results) when tested against a library of 170 gaming creative assets. The model also demonstrates strong cross-language capabilities with minimal performance degradation across multiple languages.",
      "link": "https://aws.amazon.com/blogs/machine-learning/scale-creative-asset-discovery-with-amazon-nova-multimodal-embeddings-unified-vector-search/",
      "pubDate": "2026-01-15T15:45:02.000Z",
      "source": "mlBlog",
      "services": [
        "nova"
      ],
      "categories": [
        "foundation-models"
      ],
      "tags": [
        "nova",
        "ga"
      ]
    },
    {
      "id": "aws-news-30ae03a6eb5a",
      "title": "AWS Lambda announces cross-account access for DynamoDB Streams",
      "description": "AWS Lambda now supports cross-account access for AWS DynamoDB Streams event-source mappings (ESMs),\n enabling you to trigger Lambda functions in one account from DynamoDB Streams in another account.\n  Customers build event-driven applications using Lambda's fully-managed DynamoDB Streams ESMs, which poll change events from DynamoDB tables and trigger your Lambda functions. Organizations implementing multi-account architectures—whether to centralize event processing or share events with partner teams—previously needed to build complex data replication solutions to share data across accounts, which added operational overhead . With this launch, you can now provide cross-account access to your DynamoDB Streams to trigger Lambda functions in another account. By setting a resource-based policy on your DynomoDB stream, you can enable a Lambda function in one account to access DynomoDB stream in another account. This capability allows you to simplify your streaming applications across accounts without the overhead of replication solutions in each account.\n  This feature is generally available in all AWS Commercial and AWS GovCloud (US) Regions. You can enable cross-account Lambda triggers by creating resource-based policies for your DynamoDB Streams using the AWS Management Console, AWS CLI, AWS SDKs, AWS CloudFormation, or AWS APIs. To learn more, read Lambda ESM documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/aws-lambda-cross-account-access-dynamodb-streams",
      "pubDate": "2026-01-15T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "lambda",
        "dynamodb",
        "cloudformation",
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "lex",
        "lambda",
        "dynamodb",
        "cloudformation",
        "organizations",
        "launch",
        "generally-available",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-724193a8bec3",
      "title": "Amazon Redshift Serverless adds queue-based query resource management",
      "description": "Amazon Redshift Serverless introduces queue-based query resource management. You can create dedicated query queues with customized monitoring rules for different workloads. This feature provides granular control over resource usage. Queues let you set metrics-based predicates and automated responses. For example, you can configure rules to automatically abort queries that exceed time limits or consume too many resources.\n  Previously, Query Monitoring Rules (QMR) were applied only at the Redshift Serverless workgroup level, affecting all queries run in this workgroup uniformly. The new queue-based approach lets you create queues with distinct monitoring rules. You can assign these queues to specific user roles and query groups. Each queue operates independently, with rules affecting only the queries within that queue. The available monitoring metrics can be found in Query monitoring metrics for Amazon Redshift Serverless.\n  This feature is available in all AWS regions that support Amazon Redshift Serverless. You can manage QMR with queues through the AWS Console and Redshift APIs.\n  For implementation details, see the documentation in the Amazon Redshift management guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-redshift-serverless-queue-based-query-resource-management",
      "pubDate": "2026-01-15T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "redshift"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "redshift",
        "support"
      ]
    },
    {
      "id": "aws-news-7f78364514e2",
      "title": "Amazon EBS now supports up to four Elastic Volumes modifications in 24 hours",
      "description": "Amazon Elastic Block Store (EBS) now supports up to four Elastic Volumes modifications per volume within a rolling 24-hour window. Elastic Volumes modifications allow you to increase the size, change the type, and adjust the performance of your EBS volumes. With this update, you can start a new modification immediately after the previous one completes, as long as you have initiated fewer than four modifications in the past 24 hours.\n \nThis enhancement improves your operational agility to immediately scale storage capacity or adjust performance in response to sudden data growth or unanticipated workload spikes. With Elastic Volumes modifications, you can modify your volumes without detaching them or restarting your instances, allowing your application to continue running with minimal performance impact.\n \nThis feature is available in all commercial AWS Regions, the AWS GovCloud (US) Regions, and the China Regions. This capability is automatically enabled without requiring changes to your existing workflows. To learn more, see Modify an Amazon EBS volume using Elastic Volumes operations in the Amazon EBS User Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-ebs-up-to-four-volume-modifications/",
      "pubDate": "2026-01-15T14:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "update",
        "enhancement",
        "support"
      ]
    },
    {
      "id": "aws-news-36d8b357cc69",
      "title": "AWS Data Exports  adds granular operation visibility for Amazon Bedrock model usage",
      "description": "AWS Data Exports now enables customers to distinguish between Amazon Bedrock operation types in their cost reports for enhanced cost analysis and optimization. This granular operation information is available in Cost and Usage Reports (CUR), CUR 2.0, and Data Exports for FOCUS, and is particularly valuable for FinOps teams, cost optimization professionals, and organizations using Amazon Bedrock that require detailed billing analysis.\n  Customers will now see specific operation types such as \"InvokeModelInference\" and \"InvokeModelStreamingInference\" in their cost reports, replacing generic \"Usage\" labels. These granular operation types appear in the \"line_item_operation\" column in Legacy CUR and CUR 2.0 reports, the \"x_Operation\" column in FOCUS reports, and AWS Cost Explorer API Operation dimension values. This visibility now extends to all foundation models on Amazon Bedrock, enabling precise tracking of usage patterns and cost optimization opportunities across all model providers.\n  To learn more about AWS Billing and Cost Management, visit the AWS Billing and Cost Management documentation, and for AWS Data Exports, visit the AWS Data Exports documentation. To get started with Amazon Bedrock, visit the Amazon Bedrock page and see the Amazon Bedrock documentation for more details.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/granular-amazon-bedrock/",
      "pubDate": "2026-01-15T08:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "bedrock",
        "organizations"
      ],
      "categories": [
        "foundation-models"
      ],
      "tags": [
        "bedrock",
        "organizations",
        "ga"
      ]
    },
    {
      "id": "aws-news-298dd0715dfd",
      "title": "Opening the AWS European Sovereign Cloud",
      "description": "Deutsch | English | Español | Français | Italiano As a European citizen, I understand first-hand the importance of digital sovereignty, especially for our public sector organisations and highly regulated industries. Today, I’m delighted to share that the AWS European Sovereign Cloud is now generally available to all customers. We first announced our plans to […]",
      "link": "https://aws.amazon.com/blogs/aws/opening-the-aws-european-sovereign-cloud/",
      "pubDate": "2026-01-15T07:12:54.000Z",
      "source": "newsBlog",
      "services": [],
      "categories": [
        "news"
      ],
      "tags": [
        "generally-available",
        "ga"
      ]
    },
    {
      "id": "aws-news-872d932bfe7a",
      "title": "How AutoScout24 built a Bot Factory to standardize AI agent development with Amazon Bedrock",
      "description": "In this post, we explore the architecture that AutoScout24 used to build their standardized AI development framework, enabling rapid deployment of secure and scalable AI agents.",
      "link": "https://aws.amazon.com/blogs/machine-learning/how-autoscout24-built-a-bot-factory-to-standardize-ai-agent-development-with-amazon-bedrock/",
      "pubDate": "2026-01-14T21:24:09.000Z",
      "source": "mlBlog",
      "services": [
        "bedrock"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "bedrock"
      ]
    },
    {
      "id": "aws-news-2ee469a433b5",
      "title": "Transform AI development with new Amazon SageMaker AI model customization and large-scale training capabilities",
      "description": "This post explores how new serverless model customization capabilities, elastic training, checkpointless training, and serverless MLflow work together to accelerate your AI development from months to days.",
      "link": "https://aws.amazon.com/blogs/machine-learning/transform-ai-development-with-new-amazon-sagemaker-ai-model-customization-and-large-scale-training-capabilities/",
      "pubDate": "2026-01-14T21:13:42.000Z",
      "source": "mlBlog",
      "services": [
        "sagemaker"
      ],
      "categories": [
        "foundation-models"
      ],
      "tags": [
        "sagemaker"
      ]
    },
    {
      "id": "aws-news-c6a7173ddda9",
      "title": "How Slack achieved operational excellence for Spark on Amazon EMR using generative AI",
      "description": "In this post, we show how Slack built a monitoring framework for Apache Spark on Amazon EMR that captures over 40 metrics, processes them through Kafka and Apache Iceberg, and uses Amazon Bedrock to deliver AI-powered tuning recommendations—achieving 30–50% cost reductions and 40–60% faster job completion times.",
      "link": "https://aws.amazon.com/blogs/big-data/how-slack-achieved-operational-excellence-for-spark-on-amazon-emr-using-generative-ai/",
      "pubDate": "2026-01-14T21:02:21.000Z",
      "source": "bigDataBlog",
      "services": [
        "bedrock",
        "emr",
        "kafka"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "bedrock",
        "emr",
        "kafka"
      ]
    },
    {
      "id": "aws-news-19a7d72452ce",
      "title": "Access Snowflake Horizon Catalog data using catalog federation in the AWS Glue Data Catalog",
      "description": "AWS has introduced a new catalog federation feature that enables direct access to Snowflake Horizon Catalog data through AWS Glue Data Catalog. This integration allows organizations to discover and query data in Iceberg format while maintaining security through AWS Lake Formation. This post provides a step-by-step guide to establishing this integration, including configuring Snowflake Horizon Catalog, setting up authentication, creating necessary IAM roles, and implementing AWS Lake Formation permissions. Learn how to enable cross-platform analytics while maintaining robust security and governance across your data environment.",
      "link": "https://aws.amazon.com/blogs/big-data/access-snowflake-horizon-catalog-data-using-catalog-federation-in-the-aws-glue-data-catalog/",
      "pubDate": "2026-01-14T21:00:26.000Z",
      "source": "bigDataBlog",
      "services": [
        "iam",
        "glue",
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "iam",
        "glue",
        "organizations",
        "ga",
        "integration"
      ]
    },
    {
      "id": "aws-news-7c57dcba88c0",
      "title": "Amazon VPC Route Server now available in new regions",
      "description": "Amazon VPC Route Server is now available in 16 new regions in addition to the 14 existing ones.\n  VPC Route Server simplifies dynamic routing between virtual appliances in your Amazon VPC. It allows you to advertise routing information through Border Gateway Protocol (BGP) from virtual appliances and dynamically update the VPC route tables associated with subnets and internet gateway.\n  With this launch, Amazon VPC Route Server is available in 30 AWS Regions: US East (Virginia), US East (Ohio), US West (Oregon), Europe (Ireland), Europe (Frankfurt), Asia Pacific (Tokyo), US West (N. California), Canada West (Calgary), Asia Pacific (Malaysia), Europe (Milan), Europe (Paris), Asia Pacific (Sydney), Europe (London), Canada (Central), Mexico (Central), South America (Sao Paulo),Asia Pacific (Seoul), Europe (Zurich), Europe (Stockholm), Middle East (UAE), Israel (Tel Aviv), Asia Pacific (Taipei), Asia Pacific (New Zealand), Asia Pacific (Melbourne), Middle East (Bahrain), Asia Pacific (Jakarta), Africa (Cape Town), Asia Pacific (Hong Kong), Asia Pacific (Osaka) and Asia Pacific (Thailand). To learn more about Amazon VPC Route Server, visit this page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-vpc-route-server-available-new-regions",
      "pubDate": "2026-01-14T18:41:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "launch",
        "ga",
        "now-available",
        "update",
        "new-region"
      ]
    },
    {
      "id": "aws-news-6e0e5a6ae899",
      "title": "Amazon VPC IPAM policies now support RDS and Application Load Balancers",
      "description": "Amazon Virtual Private Cloud (VPC) IP Address Manager (IPAM) now supports policies for Amazon Relational Database Service (RDS) instances and Application Load Balancers (ALB). This feature enables IP administrators to centrally configure and enforce IP allocation strategies for these resources, improving operational posture and simplifying network and security management.\n  Using IPAM policies, IP administrators can centrally define public IP allocation rules for AWS resources, such as RDS instances, Application Load Balancers and Network Address Translation (NAT) Gateways when used in regional availability mode, and Elastic IP addresses. The IP allocation policy configured centrally cannot be superseded by individual application teams, ensuring compliance at all times. Before this feature, IP administrators had to educate database administrators and application developers about IP allocation requirements for RDS instances and Application Load Balancers, and rely on them to always comply with best practices. Now, you can add IP-based filters for RDS and ALB traffic in your networking and security constructs like access control lists, route tables, security groups, and firewalls, with confidence that public IPv4 address assignments to these resources always come from specific IPAM pools.\n  The feature is available in all AWS commercial regions and the AWS GovCloud (US) Regions, in both Free Tier and Advanced Tier of VPC IPAM. When used with the Advanced Tier of VPC IPAM, customers can set policies across AWS accounts and AWS regions. To get started please see the IPAM policies documentation page.\n  To learn more about IPAM, view the IPAM documentation. For details on pricing, refer to the IPAM tab on the Amazon VPC Pricing Page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-vpc-ipam-policies-rds-alb/",
      "pubDate": "2026-01-14T17:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "rds"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "rds",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-4124e81eda7a",
      "title": "Amazon Bedrock introduces API keys to streamline development in GovCloud regions",
      "description": "API keys for Amazon Bedrock are now available in AWS GovCloud (US) regions, expanding a feature that simplifies authentication and accelerates generative AI development. Originally launched in commercial AWS regions in July 2025, API keys for Amazon Bedrock enable developers to quickly generate access credentials directly within the Amazon Bedrock console or AWS SDK without needing to manually configure IAM principals and policies.\n  With the introduction of API keys for Amazon Bedrock, developers can generate short-term and long-term API keys directly from the Amazon Bedrock console or API to authenticate API calls to Amazon Bedrock models. Short-term API keys are valid for the duration of your console session, or up to 12 hours, whichever is shorter. Long-term API keys give you the flexibility to define key validity duration and manage the keys from the AWS IAM console.\n  Bedrock API key authentication is now available in the AWS GovCloud (US) and commercial AWS Regions where Amazon Bedrock is available.\n  To learn more about API keys in Amazon Bedrock, visit the API Keys documentation in the Amazon Bedrock user guide, or check out our blog for code snippets and implementation examples.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-bedrock-api-keys-streamline-development-govcloud/",
      "pubDate": "2026-01-14T17:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "bedrock",
        "lex",
        "iam"
      ],
      "categories": [
        "foundation-models"
      ],
      "tags": [
        "bedrock",
        "lex",
        "iam",
        "launch",
        "now-available"
      ]
    },
    {
      "id": "aws-news-b520484d2035",
      "title": "AWS Transform custom adds AWS PrivateLink support and expands to Europe (Frankfurt) Region",
      "description": "AWS Transform custom now supports AWS PrivateLink and is available in a new AWS Region, Europe (Frankfurt), in addition to the US East (N. Virginia) Region. AWS Transform custom helps organizations reduce technical debt by automating repetitive transformation tasks such as language version upgrades, API migrations, and framework updates. The agent is designed for enterprise development teams and consulting partners who need to execute consistent, repeatable code transformations across large codebases.\n  With AWS Transform custom, teams can create custom transformation definitions using natural language, documentation, and code samples, or use AWS-managed transformations for common scenarios including Java, Python, and Node.js version upgrades. Through continual learning, the service improves transformation quality with every execution over time. With AWS PrivateLink support, customers can now access AWS Transform custom from their Amazon VPC without routing traffic over the public internet, helping meet security and compliance requirements.\n  To learn more about AWS Transform custom, visit the product page and user guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/aws-transform-custom-privatelink-europe-frankfurt-region/",
      "pubDate": "2026-01-14T17:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "organizations",
        "ga",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-867981671901",
      "title": "Amazon Connect makes it easier to manage recurring overrides for hours of operation",
      "description": "Amazon Connect now makes it easier to manage contact center operating hours for recurring events like holidays, maintenance windows, and promotional periods, with a visual calendar that provides at-a-glance visibility by day, month, or year. You can set up recurring overrides that automatically take effect weekly, monthly, or every other Friday, and use them to provide customers with personalized experiences, all without having to manually revisit configurations. For example, every January 1st you can automatically greet customers with \"Happy New Year!\" and route them to a special holiday message before checking if agents are available, then on January 2nd your contact center automatically returns to normal operations.\n  These additional hours of operation override capabilities are available in all AWS regions where Amazon Connect is available and offer public API and AWS CloudFormation support. To learn more, see the Amazon Connect Administrator Guide. To learn more about Amazon Connect, please visit the Amazon Connect website.",
      "link": "https://aws.amazon.comabout-aws/whats-new/2026/01/amazon-connect-recurring-hour-operation-overrides",
      "pubDate": "2026-01-14T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "personalize",
        "cloudformation"
      ],
      "categories": [
        "ai-services"
      ],
      "tags": [
        "personalize",
        "cloudformation",
        "support"
      ]
    },
    {
      "id": "aws-news-62a858ea1c26",
      "title": "Enhanced Transactions view now available in AWS Billing Console",
      "description": "AWS announces significant improvements to the Transactions view in the AWS Billing and Cost Management Console’s Payments page, delivering faster performance, simplified payment reconciliation, and improved data accuracy. The enhanced view provides customers with a unified interface to manage all their financial transactions, improving visibility and reducing the time spent on payment tracking.\n  The enhanced view delivers improved performance, with pages loading in mili seconds instead of minutes. Even customers with tens of thousands of transactions can now access their complete transaction history without timeouts. The enhanced view introduces new capabilities including comprehensive balance tracking, clear transaction status indicators, and advanced filtering options. Key improvements include consolidated visibility into invoice statuses, clear +/- indicators for amounts owed versus funds available, and the ability to view records in a single view without performance impact. For organizations using Billing Transfer, the new \"Usage Consolidation Account\" column makes it easier to track transactions across multiple accounts.\n  This feature was made available to all customers on January 12, 2026, in all AWS commercial regions.\n  To learn more about managing your transactions, visit the AWS Billing and Cost Management documentation. For additional information about managing your AWS payments and billing, see the AWS Billing Console User Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/enhanced-transactions-view-aws-billing-console",
      "pubDate": "2026-01-14T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "rds",
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "rds",
        "organizations",
        "ga",
        "now-available",
        "improvement"
      ]
    },
    {
      "id": "aws-news-7925c18a56a8",
      "title": "Securing Amazon Bedrock cross-Region inference: Geographic and global",
      "description": "In this post, we explore the security considerations and best practices for implementing Amazon Bedrock cross-Region inference profiles. Whether you're building a generative AI application or need to meet specific regional compliance requirements, this guide will help you understand the secure architecture of Amazon Bedrock CRIS and how to properly configure your implementation.",
      "link": "https://aws.amazon.com/blogs/machine-learning/securing-amazon-bedrock-cross-region-inference-geographic-and-global/",
      "pubDate": "2026-01-13T23:13:18.000Z",
      "source": "mlBlog",
      "services": [
        "bedrock"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "bedrock"
      ]
    },
    {
      "id": "aws-news-526ae11dbac8",
      "title": "Amazon Neptune Database now supports R7g and R8g instances in 5 additional regions",
      "description": "Amazon Neptune Database now supports Graviton3-based R7g and Graviton4-based R8g instances for Amazon Neptune engine versions 1.4.5 or above, in Asia Pacific (Hong Kong), Asia Pacific (Osaka), Asia Pacific (Singapore), Canada (Central) and US West (N. California). R7g and R8g instances are priced -16% vs R6g.\n  Graviton3-based R7g are the first AWS database instances to feature the latest DDR5 memory, enabling high-speed access to data in memory. R7g database instances offer up to 30Gbps enhanced networking bandwidth and up to 20 Gbps of bandwidth to the Amazon Elastic Block Store (Amazon EBS). Graviton4-based R8g instances offer larger instance sizes, up to 48xlarge and features an 8:1 ratio of memory to vCPU, and the latest DDR5 memory. AWS Graviton4 processors are up to 40% faster for databases than AWS Graviton3 processors.\n  You can launch R7g and R8g instances for Neptune using the AWS Management Console or using the AWS CLI. Upgrading a Neptune cluster to R7g or R8g instances requires a simple instance type modification for Neptune engine versions 1.4.5 or higher. For more information on pricing and regional availability, refer to the Amazon Neptune pricing page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-neptune-database-r7g-r8g-additional-regions",
      "pubDate": "2026-01-13T19:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "graviton"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "graviton",
        "launch",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-6ae9097450e3",
      "title": "Optimizing storage performance for Amazon EKS on AWS Outposts",
      "description": "Amazon Elastic Kubernetes Service (Amazon EKS) on \nAWS Outposts brings the power of managed \nKubernetes to your on-premises infrastructure. Use Amazon EKS on Outposts rack to create hybrid cloud deployments that maintain consistent AWS experiences across environments. As organizations increasingly adopt edge computing and hybrid architectures, storage optimization and performance tuning become critical for successful workload deployment.",
      "link": "https://aws.amazon.com/blogs/compute/optimizing-storage-performance-for-amazon-eks-on-aws-outposts/",
      "pubDate": "2026-01-13T18:57:12.000Z",
      "source": "computeBlog",
      "services": [
        "eks",
        "organizations",
        "outposts"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "eks",
        "organizations",
        "outposts",
        "ga"
      ]
    },
    {
      "id": "aws-news-4cd689db778a",
      "title": "Amazon EC2 X8aedz instances are now available in Asia Pacific (Mumbai, Seoul) regions",
      "description": "Starting today, Amazon Elastic Compute Cloud (Amazon EC2) X8aedz instances are available in Asia Pacific (Mumbai) and Asia Pacific (Seoul) regions. These instances are powered by 5th Gen AMD EPYC processors (formerly code named Turin). These instances offer the highest maximum CPU frequency, 5GHz in the cloud.\n  X8aedz instances are built using the latest sixth generation AWS Nitro Cards and are ideal for electronic design automation (EDA) workloads such as physical layout and physical verification jobs, and relational databases that benefit from high single-threaded processor performance and a large memory footprint. The combination of 5 GHz processors and local NVMe storage enables faster processing of memory-intensive backend EDA workloads such as floor planning, logic placement, clock tree synthesis (CTS), routing, and power/signal integrity analysis.\n  X8aedz instances feature a 32:1 ratio of memory to vCPU and are available in 8 sizes ranging from 2 to 96 vCPUs with 64 to 3,072 GiB of memory, including two bare metal variants, and up to 8 TB of local NVMe SSD storage.\n  Customers can purchase X8aedz instances via Savings Plans, On-Demand instances, and Spot instances. To get started, sign in to the AWS Management Console. For more information visit the Amazon EC2 X8aedz instance page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-ec2-x8aedz-instances-asia-pacific-mumbai-seoul-regions",
      "pubDate": "2026-01-13T17:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2",
        "rds"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "ec2",
        "rds",
        "now-available"
      ]
    },
    {
      "id": "aws-news-45a82abb6922",
      "title": "Amazon RDS for PostgreSQL announces Extended Support minor  12.22-rds.20251114 and 11.22-rds.20251114",
      "description": "Amazon Relational Database Service (RDS) for PostgreSQL announces Amazon RDS Extended Support minor version  12.22-rds.20251114 and 11.22-rds.20251114. We recommend that you upgrade to this version to fix known security vulnerabilities and bugs in prior versions of PostgreSQL.\n  Amazon RDS Extended Support provides you more time, up to three years, to upgrade to a new major version to help you meet your business requirements. During Extended Support, Amazon RDS will provide critical security and bug fixes for your PostgreSQL databases after the community ends support for a major version. You can run your PostgreSQL databases on Amazon RDS with Extended Support for up to three years beyond a major version’s end of standard support date. Learn more about Extended Support in the Amazon RDS User Guide.\n  You can leverage automatic minor version upgrades to automatically upgrade your databases to more recent minor versions during scheduled maintenance windows. Learn more about upgrading your database instances, including automatic minor version upgrades, in the Amazon RDS User Guide.\n  Amazon RDS for PostgreSQL makes it easy to set up, operate, and scale PostgreSQL deployments in the cloud. Amazon RDS for PostgreSQL is available in all commercial and gov cloud region. See Amazon RDS for PostgreSQL for pricing details. Create or update a fully managed Amazon RDS database in the Amazon RDS Management Console.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/1/amazon-rds-for-postgresql-announces-extended-support-minor-12-22-rds-20251114-and-11-22-rds-20251114",
      "pubDate": "2026-01-13T17:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "rds"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "rds",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-c307564321e4",
      "title": "Amazon Connect Cases now supports AWS CloudFormation",
      "description": "Amazon Connect Cases now supports AWS CloudFormation, enabling you to model, provision, and manage case resources as infrastructure as code. With this launch, administrators can create CloudFormation templates to programmatically deploy and update their Cases configuration—such as templates, fields, and layouts—across Amazon Connect instances, reducing manual setup time and minimizing configuration errors.\n  Amazon Connect Cases is available in the following AWS Regions: US East (N. Virginia), US West (Oregon), Canada (Central), Europe (Frankfurt), Europe (London), Asia Pacific (Seoul), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), and Africa (Cape Town). To learn more and get started, visit the Amazon Connect Cases webpage and documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-connect-cases-aws-cloudformation/",
      "pubDate": "2026-01-13T16:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "cloudformation"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "cloudformation",
        "launch",
        "ga",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-72b2396676ac",
      "title": "Amazon MSK Connect is now available in three additional AWS Regions",
      "description": "Amazon MSK Connect is now available in three additional AWS Regions: Asia Pacific (New Zealand), AWS GovCloud (US-East), and AWS GovCloud (US-West).\n  MSK Connect enables you to run fully managed Kafka Connect clusters with Amazon Managed Streaming for Apache Kafka (Amazon MSK). With a few clicks, MSK Connect allows you to easily deploy, monitor, and scale connectors that move data in and out of Apache Kafka and Amazon MSK clusters from external systems such as databases, file systems, and search indices. MSK Connect eliminates the need to provision and maintain cluster infrastructure. Connectors scale automatically in response to increases in usage and you pay only for the resources you use. With full compatibility with Kafka Connect, it is easy to migrate workloads without code changes. MSK Connect will support both Amazon MSK-managed and self-managed Apache Kafka clusters.\n  You can get started with MSK Connect from the Amazon MSK console or the Amazon CLI. With this launch, MSK Connect is now available in thirty eight AWS Regions. To get started visit, the MSK Connect product page, pricing page, and the Amazon MSK Developer Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-msk-connect-additional-aws-regions",
      "pubDate": "2026-01-13T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "kafka",
        "msk"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "kafka",
        "msk",
        "launch",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-576b2199ce20",
      "title": "Amazon Lex launches improved speech recognition models for English",
      "description": "Amazon Lex now offers a neural automatic speech recognition (ASR) model for English that delivers improved recognition accuracy for your voice bots. Trained on data from multiple English locales, the model excels at recognizing conversational speech patterns across diverse speaking styles, including non-native English speakers and regional accents. This reduces the need for end-customers to repeat themselves and improves self-service success rates. To enable this feature, select \"Neural\" as the speech recognition option in your bot's locale settings.\n  This feature is available in all AWS commercial regions where Amazon Connect and Lex operate. To learn more, visit the Amazon Lex documentation or explore the Amazon Connect website to learn how Amazon Connect and Amazon Lex deliver seamless end-customer self-service experiences.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-lex-improved-speech-recognition-models-english",
      "pubDate": "2026-01-13T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "launch"
      ]
    },
    {
      "id": "aws-news-a5b575144ec4",
      "title": "Navigating architectural choices for a lakehouse using Amazon SageMaker",
      "description": "Over time, several distinct lakehouse approaches have emerged. In this post, we show you how to evaluate and choose the right lakehouse pattern for your needs. A lakehouse architecture isn’t about choosing between a data lake and a data warehouse. Instead, it’s an approach to interoperability where both frameworks coexist and serve different purposes within a unified data architecture. By understanding fundamental storage patterns, implementing effective catalog strategies, and using native storage capabilities, you can build scalable, high-performance data architectures that support both your current analytics needs and future innovation.",
      "link": "https://aws.amazon.com/blogs/big-data/navigating-architectural-choices-for-a-lakehouse-using-amazon-sagemaker/",
      "pubDate": "2026-01-12T20:46:27.000Z",
      "source": "bigDataBlog",
      "services": [
        "nova",
        "sagemaker"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "nova",
        "sagemaker",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-7f7a2f14f097",
      "title": "Access Databricks Unity Catalog data using catalog federation in the AWS Glue Data Catalog",
      "description": "AWS has launched the catalog federation capability, enabling direct access to Apache Iceberg tables managed in Databricks Unity Catalog through the AWS Glue Data Catalog. With this integration, you can discover and query Unity Catalog data in Iceberg format using an Iceberg REST API endpoint, while maintaining granular access controls through AWS Lake Formation. In this post, we demonstrate how to set up catalog federation between the Glue Data Catalog and Databricks Unity Catalog, enabling data querying using AWS analytics services.",
      "link": "https://aws.amazon.com/blogs/big-data/access-databricks-unity-catalog-data-using-catalog-federation-in-the-aws-glue-data-catalog/",
      "pubDate": "2026-01-12T20:37:44.000Z",
      "source": "bigDataBlog",
      "services": [
        "glue"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "glue",
        "launch",
        "integration"
      ]
    },
    {
      "id": "aws-news-b534fc68b2dc",
      "title": "How Salesforce migrated from Cluster Autoscaler to Karpenter across their fleet of 1,000 EKS clusters",
      "description": "This blog post examines how Salesforce, operating one of the world's largest Kubernetes deployments, successfully migrated from Cluster Autoscaler to Karpenter across their fleet of 1,000 plus Amazon Elastic Kubernetes Service (Amazon EKS) clusters.",
      "link": "https://aws.amazon.com/blogs/architecture/how-salesforce-migrated-from-cluster-autoscaler-to-karpenter-across-their-fleet-of-1000-eks-clusters/",
      "pubDate": "2026-01-12T20:03:32.000Z",
      "source": "architectureBlog",
      "services": [
        "eks"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "eks"
      ]
    },
    {
      "id": "aws-news-7a070b83b1b0",
      "title": "Amazon SageMaker HyperPod now validates service quotas before creating clusters on console",
      "description": "Amazon SageMaker HyperPod console now validates service quotas for your AWS account before initiating cluster creation, enabling you to confirm sufficient quota availability before provisioning begins. SageMaker HyperPod helps you provision resilient clusters for running AI/ML workloads and developing state-of-the-art models such as large language models (LLMs), diffusion models, and foundation models (FMs).\n  When creating large-scale AI/ML clusters, you need to ensure your account has sufficient quotas for instances, storage, and networking resources, but quota validation previously required manual checks across multiple AWS services, often resulting in failed cluster creation attempts and wasted time if you miss requesting quota limit increases. The new quota validation capability in the SageMaker HyperPod console automatically checks your account-level quotas against your cluster configuration, including instance type limits, EBS volume sizes, and VPC-related quotas when creating new resources. The validation displays a clear table showing expected utilization, applied quota values, and compliance status for each quota. When quotas may be exceeded, you receive a warning alert with direct links to the Service Quotas console to request increases.\n  This feature is available in all AWS Regions where Amazon SageMaker HyperPod is supported. For a complete list of service quota validation checks performed, refer to the Amazon SageMaker HyperPod User Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-sagemaker-hyperpod-validates-service-quotas/",
      "pubDate": "2026-01-12T18:10:00.000Z",
      "source": "whatsNew",
      "services": [
        "sagemaker",
        "hyperpod"
      ],
      "categories": [
        "foundation-models"
      ],
      "tags": [
        "sagemaker",
        "hyperpod",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-dfe386ee3ced",
      "title": "Amazon Lex launches configurable voice activity detection sensitivity",
      "description": "Amazon Lex now provides three VAD sensitivity levels that can be configured for each bot locale: Default, High, and Maximum. The Default setting is suitable for most environments with typical background noise levels. High is designed for environments with consistent but moderate noise levels, such as busy offices or retail spaces. Maximum provides the highest tolerance for very noisy environments such as manufacturing floors, construction sites, or outdoor locations with significant ambient noise. You can configure VAD sensitivity when creating or updating a bot locale in the Amazon Connect's Conversational AI designer.\n \nThis feature is available in all AWS commercial regions where Amazon Connect and Lex operate. To learn more, visit the Amazon Lex documentation or explore the Amazon Connect website to learn how Amazon Connect and Amazon Lex deliver seamless end-customer self-service experiences.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-lex-configurable-voice-activity-detection-sensitivity/",
      "pubDate": "2026-01-12T18:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "launch"
      ]
    },
    {
      "id": "aws-news-a998df60ab8a",
      "title": "AWS Weekly Roundup: AWS Lambda for .NET 10, AWS Client VPN quickstart, Best of AWS re:Invent, and more (January 12, 2026)",
      "description": "At the beginning of January, I tend to set my top resolutions for the year, a way to focus on what I want to achieve. If AI and cloud computing are on your resolution list, consider creating an AWS Free Tier account to receive up to $200 in credits and have 6 months of risk-free […]",
      "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-aws-lambda-for-net-10-aws-client-vpn-quickstart-best-of-aws-reinvent-and-more-january-12-2026/",
      "pubDate": "2026-01-12T17:39:47.000Z",
      "source": "newsBlog",
      "services": [
        "lambda"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "lambda"
      ]
    },
    {
      "id": "aws-news-12eadb812c54",
      "title": "How Omada Health scaled patient care by fine-tuning Llama models on Amazon SageMaker AI",
      "description": "This post is co-written with Sunaina Kavi, AI/ML Product Manager at Omada Health. Omada Health, a longtime innovator in virtual healthcare delivery, launched a new nutrition experience in 2025, featuring OmadaSpark, an AI agent trained with robust clinical input that delivers real-time motivational interviewing and nutrition education. It was built on AWS. OmadaSpark was designed […]",
      "link": "https://aws.amazon.com/blogs/machine-learning/how-omada-health-scaled-patient-care-by-fine-tuning-llama-models-on-amazon-sagemaker-ai/",
      "pubDate": "2026-01-12T16:56:12.000Z",
      "source": "mlBlog",
      "services": [
        "nova",
        "sagemaker"
      ],
      "categories": [
        "foundation-models"
      ],
      "tags": [
        "nova",
        "sagemaker",
        "launch"
      ]
    },
    {
      "id": "aws-news-1c50b7748deb",
      "title": "Amazon Connect now provides agent screen recording status tracking",
      "description": "Amazon Connect now offers customers the ability to view status of agent screen recordings in near real time in CloudWatch using Amazon EventBridge. With screen recording, supervisors can identify areas for agent coaching (e.g., non-compliance with business processes) by not only listening to customer calls or reviewing chat transcripts, but also watching agents’ actions while handling a contact (i.e., a voice call, chat and task). Using Amazon EventBridge, customers can see status of each agent screen recording including success/failure, failure codes with description, installed client version, agent web browser version, agent operating system, screen recording start and end times from CloudWatch.\n  Customers can start using Amazon Connect screen recording status tracking by subscribing to Screen Recording Status Changed event type in Amazon EventBridge event bus.\n  Screen recording status tracking is available in all the AWS Regions where Amazon Connect is already available. To learn more about screen recording, please visit the documentation and webpage. For information about screen recording pricing, visit the Amazon Connect pricing page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-connect-agent-screen-recording-status-tracking",
      "pubDate": "2026-01-12T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "eventbridge",
        "cloudwatch"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "eventbridge",
        "cloudwatch"
      ]
    },
    {
      "id": "aws-news-9896a7386d6b",
      "title": "Amazon Redshift Serverless is now available in the AWS Asia Pacific (New Zealand) region",
      "description": "Amazon Redshift Serverless, which allows you to run and scale analytics without having to provision and manage data warehouse clusters, is now generally available in the AWS Asia Pacific (New Zealand) region. With Amazon Redshift Serverless, all users, including data analysts, developers, and data scientists, can use Amazon Redshift to get insights from data in seconds. Amazon Redshift Serverless automatically provisions and intelligently scales data warehouse capacity to deliver high performance for all your analytics. You only pay for the compute used for the duration of the workloads on a per-second basis. You can benefit from this simplicity without making any changes to your existing analytics and business intelligence applications.\n  With a few clicks in the AWS Management Console, you can get started with querying data using the Query Editor V2 or your tool of choice with Amazon Redshift Serverless. There is no need to choose node types, node count, workload management, scaling, and other manual configurations. You can create databases, schemas, and tables, and load your own data from Amazon S3, access data using Amazon Redshift data shares, or restore an existing Amazon Redshift provisioned cluster snapshot. With Amazon Redshift Serverless, you can directly query data in open formats, such as Apache Parquet, Apache Iceberg in Amazon S3 data lakes. Amazon Redshift Serverless provides unified billing for queries on any of these data sources, helping you efficiently monitor and manage costs.\n  To get started, see the Amazon Redshift Serverless feature page, user documentation, and API Reference.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-redshift-serverless-aws-asia-pacific-new-zealand-region",
      "pubDate": "2026-01-12T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "s3",
        "redshift"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "s3",
        "redshift",
        "generally-available",
        "now-available"
      ]
    },
    {
      "id": "aws-news-5f58f81f0cbf",
      "title": "Amazon Inspector adds Java Gradle support and expands ecosystem coverage",
      "description": "Amazon Inspector scanning for Lambda functions and Elastic Container Registry (ECR) images now supports Java Gradle inventory and vulnerability scanning. This release also adds coverage for MySQL, MariaDB, PHP, Jenkins-core, 7zip (on Windows), Elasticsearch, and Curl/LibCurl. This update enhances Amazon Inspector's ability to detect vulnerabilities and misconfigurations across a broader range of applications and environments. Amazon Inspector is an automated vulnerability management service that continually scans AWS workloads for software vulnerabilities and unintended network exposure, helping organizations improve their security posture and meet compliance requirements.\n  The new Java Gradle support allows Inspector to scan Java dependencies based on gradle.lockfile content, providing comprehensive vulnerability assessments for Java applications. When you use Inspector to scan Lambda functions and ECR images, you will now see findings for MySQL, MariaDB, PHP, Jenkins-core, 7zip (on Windows), Elasticsearch, and Curl/LibCurl installations. These enhancements enable more accurate detection of vulnerabilities in packages installed outside of package managers, improving overall security coverage for AWS customers using these technologies.\n  To learn more about Amazon Inspector and how it can help secure your AWS workloads, visit the Amazon Inspector page. For a full list of Amazon Inspector supported operating systems and programming languages, see the user guide. You can start using these new features today in all AWS Regions where Amazon Inspector is available.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-inspector-java-gradle-ecosystem/",
      "pubDate": "2026-01-12T13:51:00.000Z",
      "source": "whatsNew",
      "services": [
        "lambda",
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "lambda",
        "organizations",
        "ga",
        "new-feature",
        "update",
        "enhancement",
        "support"
      ]
    },
    {
      "id": "aws-news-9aa4ee62ff93",
      "title": "Crossmodal search with Amazon Nova Multimodal Embeddings",
      "description": "In this post, we explore how Amazon Nova Multimodal Embeddings addresses the challenges of crossmodal search through a practical ecommerce use case. We examine the technical limitations of traditional approaches and demonstrate how Amazon Nova Multimodal Embeddings enables retrieval across text, images, and other modalities. You learn how to implement a crossmodal search system by generating embeddings, handling queries, and measuring performance. We provide working code examples and share how to add these capabilities to your applications.",
      "link": "https://aws.amazon.com/blogs/machine-learning/crossmodal-search-with-amazon-nova-multimodal-embeddings/",
      "pubDate": "2026-01-10T00:06:16.000Z",
      "source": "mlBlog",
      "services": [
        "nova"
      ],
      "categories": [
        "foundation-models"
      ],
      "tags": [
        "nova"
      ]
    },
    {
      "id": "aws-news-52d1b1a6c0c6",
      "title": "Announcing larger managed database bundles for Amazon Lightsail",
      "description": "Amazon Lightsail now offers two larger database bundles with up to 8 vCPUs, 32GB memory, and 960GB SSD storage. The new database bundles are available in both standard and high-availability plans. You can create MySQL and PostgreSQL databases using the new Lightsail managed database bundles.\n  The new larger database bundles enable you to scale your database workloads and run more data-intensive applications in Lightsail. These higher-performance database bundles are ideal for production workloads that require increased storage capacity and processing power to handle growing datasets and concurrent connections. Using these new bundles, you can run e-commerce platforms, content management systems, business intelligence applications, SaaS products, and more.\n  These new bundles are now available in all AWS Regions where Amazon Lightsail is available. For more information on pricing, or to get started with your free trial, click here.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/larger-managed-database-bundles-lightsail/",
      "pubDate": "2026-01-09T22:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "now-available"
      ]
    },
    {
      "id": "aws-news-efb19cd8185a",
      "title": "Amazon EMR Serverless adds support for job run level cost allocation",
      "description": "Amazon EMR Serverless now supports job run-level cost allocation that provides better visibility into charges for individual job runs by allowing you to configure granular billing attribution at the individual job run level. You can get granular cost visibility by filtering and tracking costs in AWS Cost Explorer and Cost and Usage Reports by specific job run IDs and cost allocation tags associated with job runs.\n  Amazon EMR Serverless is a deployment option in Amazon EMR that makes it simple for data engineers and data scientists to run open-source big data analytics frameworks without configuring, managing, and scaling clusters or servers. Previously, you could assign cost allocation tags to EMR Serverless applications, with cost attribution limited to the application level. With job run-level cost allocation, now you can assign cost allocation tags to each job run, enabling fine-grained billing attribution at the individual job run level. Cost allocation tags at the job run level also allow you to track costs by domains within a single application. For example, a single application could support jobs for finance and marketing domains, allowing you to track costs separately for each domain. Tracking costs for individual job runs makes it easier to conduct benchmarks that assess the costs of each job run as well as focus cost optimization efforts more precisely, allowing deeper insights into resource utilization and spending patterns across different jobs and domains.\n  This feature is available in all AWS Regions where Amazon EMR Serverless is available including AWS GovCloud (US) and China regions. To learn more, see Enabling Job Level Cost Allocation in the Amazon EMR Serverless User Guide",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-emr-serverless-adds-job-run-level",
      "pubDate": "2026-01-09T20:29:00.000Z",
      "source": "whatsNew",
      "services": [
        "emr"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "emr",
        "support"
      ]
    },
    {
      "id": "aws-news-8abea41234e8",
      "title": "Accelerating LLM inference with post-training weight and activation using AWQ and GPTQ on Amazon SageMaker AI",
      "description": "Quantized models can be seamlessly deployed on Amazon SageMaker AI using a few lines of code. In this post, we explore why quantization matters—how it enables lower-cost inference, supports deployment on resource-constrained hardware, and reduces both the financial and environmental impact of modern LLMs, while preserving most of their original performance. We also take a deep dive into the principles behind PTQ and demonstrate how to quantize the model of your choice and deploy it on Amazon SageMaker.",
      "link": "https://aws.amazon.com/blogs/machine-learning/accelerating-llm-inference-with-post-training-weight-and-activation-using-awq-and-gptq-on-amazon-sagemaker-ai/",
      "pubDate": "2026-01-09T18:09:22.000Z",
      "source": "mlBlog",
      "services": [
        "sagemaker"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "support"
      ]
    },
    {
      "id": "aws-news-87d1d484c85d",
      "title": "How Beekeeper by LumApps optimized user personalization with Amazon Bedrock",
      "description": "Beekeeper’s automated leaderboard approach and human feedback loop system for dynamic LLM and prompt pair selection addresses the key challenges organizations face in navigating the rapidly evolving landscape of language models.",
      "link": "https://aws.amazon.com/blogs/machine-learning/how-beekeeper-optimized-user-personalization-with-amazon-bedrock/",
      "pubDate": "2026-01-09T16:10:52.000Z",
      "source": "mlBlog",
      "services": [
        "bedrock",
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "bedrock",
        "organizations",
        "ga"
      ]
    },
    {
      "id": "aws-news-e95947e659b8",
      "title": "Sentiment Analysis with Text and Audio Using AWS Generative AI Services: Approaches, Challenges, and Solutions",
      "description": "This post, developed through a strategic scientific partnership between AWS and the Instituto de Ciência e Tecnologia Itaú (ICTi), P&D hub maintained by Itaú Unibanco, the largest private bank in Latin America, explores the technical aspects of sentiment analysis for both text and audio. We present experiments comparing multiple machine learning (ML) models and services, discuss the trade-offs and pitfalls of each approach, and highlight how AWS services can be orchestrated to build robust, end-to-end solutions. We also offer insights into potential future directions, including more advanced prompt engineering for large language models (LLMs) and expanding the scope of audio-based analysis to capture emotional cues that text data alone might miss.",
      "link": "https://aws.amazon.com/blogs/machine-learning/sentiment-analysis-with-text-and-audio-using-aws-generative-ai-services-approaches-challenges-and-solutions/",
      "pubDate": "2026-01-09T16:06:50.000Z",
      "source": "mlBlog",
      "services": [],
      "categories": [
        "generative-ai"
      ],
      "tags": []
    },
    {
      "id": "aws-news-9b7ca5b45f54",
      "title": "Architecting TrueLook’s AI-powered construction safety system on Amazon SageMaker AI",
      "description": "This post provides a detailed architectural overview of how TrueLook built its AI-powered safety monitoring system using SageMaker AI, highlighting key technical decisions, pipeline design patterns, and MLOps best practices. You will gain valuable insights into designing scalable computer vision solutions on AWS, particularly around model training workflows, automated pipeline creation, and production deployment strategies for real-time inference.",
      "link": "https://aws.amazon.com/blogs/machine-learning/architecting-truelooks-ai-powered-construction-safety-system-on-amazon-sagemaker-ai/",
      "pubDate": "2026-01-09T16:03:36.000Z",
      "source": "mlBlog",
      "services": [
        "sagemaker"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "ga"
      ]
    },
    {
      "id": "aws-news-4228e7a259ab",
      "title": "Amazon RDS for SQL Server now supports cross-region read replica in additional AWS Regions",
      "description": "Amazon Relational Database Service (Amazon RDS) for SQL Server now supports setting up cross-region read replicas in 16 additional AWS Regions. Cross-region read replicas enable customers to provide a replica database for read-only applications closer to users in a different region, and scale out read-only workloads. Since a read replica can be \"promoted\" to a standalone production database, cross-region read replicas can also be used for disaster recovery in case of regional failures. Customers can setup up to fifteen read replicas in the same or different region as the primary database instance.\n  This launch adds support for cross-region read replicas in RDS for SQL Server in the following AWS Regions: Africa (Cape Town), Asia Pacific (Hong Kong), Asia Pacific (Hyderabad), Asia Pacific (Jakarta), Asia Pacific (Malaysia), Asia Pacific (Melbourne), Asia Pacific (Taipei), Asia Pacific (Thailand), Canada West (Calgary), Europe (Milan), Europe (Spain), Europe (Zurich), Israel (Tel Aviv), Mexico (Central), Middle East (Bahrain), and Middle East (UAE). To get started, visit the Amazon RDS SQL Server User Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-rds-sql-server-cross-region-read-replica-in-additional-aws-regions/",
      "pubDate": "2026-01-09T08:05:00.000Z",
      "source": "whatsNew",
      "services": [
        "rds"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "rds",
        "launch",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-df323f0294e6",
      "title": "Use Amazon SageMaker custom tags for project resource governance and cost tracking",
      "description": "Amazon SageMaker announced a new feature that you can use to add custom tags to resources created through an Amazon SageMaker Unified Studio project. This helps you enforce tagging standards that conform to your organization’s service control policies (SCPs) and helps enable cost tracking reporting practices on resources created across the organization. In this post, we look at use cases for custom tags and how to use the AWS Command Line Interface (AWS CLI) to add tags to project resources.",
      "link": "https://aws.amazon.com/blogs/big-data/use-amazon-sagemaker-custom-tags-for-project-resource-governance-and-cost-tracking/",
      "pubDate": "2026-01-09T01:04:11.000Z",
      "source": "bigDataBlog",
      "services": [
        "sagemaker",
        "unified studio",
        "rds"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "sagemaker",
        "unified studio",
        "rds",
        "ga",
        "new-feature"
      ]
    },
    {
      "id": "aws-news-b7f07701f5bb",
      "title": "Create AWS Glue Data Catalog views using cross-account definer roles",
      "description": "In this post, we demonstrate how to use cross-account IAM definer roles with AWS Glue Data Catalog views. We show how data owner accounts can create and manage views in a central governance account while maintaining security and control over their data assets.",
      "link": "https://aws.amazon.com/blogs/big-data/create-aws-glue-data-catalog-views-using-cross-account-definer-roles/",
      "pubDate": "2026-01-08T22:45:19.000Z",
      "source": "bigDataBlog",
      "services": [
        "iam",
        "glue"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "iam",
        "glue"
      ]
    },
    {
      "id": "aws-news-fb80ad15392c",
      "title": ".NET 10 runtime now available in AWS Lambda",
      "description": "Amazon Web Services (AWS) Lambda now supports .NET 10 as both a managed runtime and base container image. .NET is a popular language for building serverless applications. Developers can now use the new features and enhancements in .NET when creating serverless applications on Lambda. This includes support for file-based apps to streamline your projects by implementing functions using just a single file.",
      "link": "https://aws.amazon.com/blogs/compute/net-10-runtime-now-available-in-aws-lambda/",
      "pubDate": "2026-01-08T21:01:05.000Z",
      "source": "computeBlog",
      "services": [
        "lambda"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda",
        "now-available",
        "new-feature",
        "enhancement",
        "support"
      ]
    },
    {
      "id": "aws-news-f5848ed220cd",
      "title": "Amazon MQ now supports certificate based authentication with mutual TLS for RabbitMQ brokers",
      "description": "Amazon MQ now supports the ability for RabbitMQ brokers to perform authentication (determining who can log in) using X.509 client certificates with mutual TLS (mTLS). The RabbitMQ auth_mechanism_ssl plugin can be configured on brokers running RabbitMQ version 4.2 and above on Amazon MQ by making changes to the associated configuration file.\n  To start using certificate based authentication on Amazon MQ, simply select RabbitMQ 4.2 when creating a new broker using the M7g instance type through the AWS Management console, AWS CLI, or AWS SDKs, and then edit the associated configuration file with the required values. To learn more about the plugin, see the Amazon MQ release notes and the Amazon MQ developer guide. This plugin is available in all regions where Amazon MQ RabbitMQ 4 instances are available today.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-mq-certificate-based-authentication-mutual-tls-rabbitmq/",
      "pubDate": "2026-01-08T19:39:00.000Z",
      "source": "whatsNew",
      "services": [
        "q developer"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "q developer",
        "support"
      ]
    },
    {
      "id": "aws-news-939d9825afab",
      "title": "Scaling medical content review at Flo Health using Amazon Bedrock (Part 1)",
      "description": "This two-part series explores Flo Health's journey with generative AI for medical content verification. Part 1 examines our proof of concept (PoC), including the initial solution, capabilities, and early results. Part 2 covers focusing on scaling challenges and real-world implementation. Each article stands alone while collectively showing how AI transforms medical content management at scale.",
      "link": "https://aws.amazon.com/blogs/machine-learning/scaling-medical-content-review-at-flo-health-using-amazon-bedrock-part-1/",
      "pubDate": "2026-01-08T18:25:01.000Z",
      "source": "mlBlog",
      "services": [
        "bedrock"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "bedrock"
      ]
    },
    {
      "id": "aws-news-5d0429585426",
      "title": "Amazon DocumentDB (with MongoDB compatibility) is Now Available in the Asia Pacific (Jakarta) Region",
      "description": "Amazon DocumentDB (with MongoDB compatibility) is now available in the Asia Pacific (Jakarta) region adding to the list of available regions where you can use Amazon DocumentDB.\n  Amazon DocumentDB is a fully managed, native JSON database that makes it simple and cost-effective to operate critical document workloads at virtually any scale without managing infrastructure. Amazon DocumentDB is designed to give you the scalability and durability you need when operating mission-critical MongoDB workloads. Storage scales automatically up to 128TiB without any impact to your application. In addition, Amazon DocumentDB natively integrates with AWS Database Migration Service(DMS), Amazon CloudWatch, AWS CloudTrail, AWS Lambda, AWS Backup and more. Amazon DocumentDB supports millions of requests per second and can be scaled out to 15 low latency read replicas in minutes with no application downtime.\n  To learn more about Amazon DocumentDB, please visit the Amazon DocumentDB product page and pricing page.\n  You can create a Amazon DocumentDB cluster from the AWS Management console, AWS Command Line Interface (CLI), or SDK.",
      "link": "https://aws.amazon.comabout-aws/whats-new/2026/01/amazon-documentdb-mongodb-compatibility-asia-pacific-jakarta-region",
      "pubDate": "2026-01-08T18:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lambda",
        "cloudwatch"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "lambda",
        "cloudwatch",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-0b63de0733e4",
      "title": "Amazon EC2 R8i and R8i-flex instances are now available in additional AWS regions",
      "description": "Starting today, Amazon Elastic Compute Cloud (Amazon EC2) R8i and R8i-flex instances are available in the Asia Pacific (Mumbai, Hyderabad) and Europe (Paris) regions. These instances are powered by custom Intel Xeon 6 processors, available only on AWS, delivering the highest performance and fastest memory bandwidth among comparable Intel processors in the cloud. The R8i and R8i-flex instances offer up to 15% better price-performance, and 2.5x more memory bandwidth compared to previous generation Intel-based instances. They deliver 20% higher performance than R7i instances, with even higher gains for specific workloads. They are up to 30% faster for PostgreSQL databases, up to 60% faster for NGINX web applications, and up to 40% faster for AI deep learning recommendation models compared to R7i.\n  R8i-flex, our first memory-optimized Flex instances, are the easiest way to get price performance benefits for a majority of memory-intensive workloads. They offer the most common sizes, from large to 16xlarge, and are a great first choice for applications that don't fully utilize all compute resources.\n  R8i instances are a great choice for all memory-intensive workloads, especially for workloads that need the largest instance sizes or continuous high CPU usage. R8i instances offer 13 sizes including 2 bare metal sizes and the new 96xlarge size for the largest applications. R8i instances are SAP-certified and deliver 142,100 aSAPS, delivering exceptional performance for mission-critical SAP workloads.\n  To get started, sign in to the AWS Management Console. For more information about the R8i and R8i-flex instances visit the AWS News blog.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-ec2-r8i-r8i-flex-instances-additional-aws-regions",
      "pubDate": "2026-01-08T18:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "ec2"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "ec2",
        "ga",
        "now-available"
      ]
    },
    {
      "id": "aws-news-69b232eca8c5",
      "title": "Amazon Quick adds third-party AI agents and expands built-in actions library",
      "description": "Amazon Quick is expanding its third-party integrations by adding AI agents and growing its built-in actions library. Quick is Amazon's new AI-powered workspace and agentic teammate that helps organizations get answers from their business data and move quickly from insights to action. As organizations navigate newly adopted AI agents and work with existing enterprise tools for CRM, support, collaboration, and more, users face fragmented experiences. Users are forced to switch between different interfaces, repeat context, and manually stitch together outputs. Quick enables users to work with third-party agents and enterprise tools from a single interface, eliminating the wasted time and cognitive load of constantly switching between applications.\n  With Quick, business users can now invoke specialized agents from Box, Canva, and PagerDuty to accomplish chat and automation tasks. For example, you can pull incident insights from PagerDuty, generate a presentation in Canva, and query documents stored in Box - all directly from Quick. Additionally, Quick has expanded its built-in actions to include integrations with GitHub, Notion, Canva, Box, Linear, Hugging Face, Monday.com, HubSpot, Intercom, and more. This enables Quick users to accomplish tasks like creating GitHub issues, summarizing meeting notes in Notion, managing their CRM, and more. Beyond our new built-in integrations, customers can continue to leverage custom Model Context Protocol (MCP) and OpenAPI connectors to connect Quick to thousands of additional applications.\n  These features are now available in all AWS Regions where Amazon Quick is available. To learn more, visit the Amazon Quick Supported Integrations Guide and Integration Specific Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/3p-agent-in-quick/",
      "pubDate": "2026-01-08T17:56:00.000Z",
      "source": "whatsNew",
      "services": [
        "amazon q",
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "amazon q",
        "organizations",
        "ga",
        "now-available",
        "integration",
        "support"
      ]
    },
    {
      "id": "aws-news-de0711858c3c",
      "title": "Amazon EC2 M8i instances are now available in additional AWS Regions",
      "description": "Starting today, Amazon EC2 M8i instances are now available in Europe (Frankfurt) and Asia Pacific (Malaysia) Regions. These instances are powered by custom Intel Xeon 6 processors, available only on AWS, delivering the highest performance and fastest memory bandwidth among comparable Intel processors in the cloud. The M8i offer up to 15% better price-performance, and 2.5x more memory bandwidth compared to previous generation Intel-based instances. They deliver up to 20% better performance than M7i instances, with even higher gains for specific workloads. The M8i instances are up to 30% faster for PostgreSQL databases, up to 60% faster for NGINX web applications, and up to 40% faster for AI deep learning recommendation models compared to M7i instances.\n  M8i instances are a great choice for all general purpose workloads, especially for workloads that need the largest instance sizes or continuous high CPU usage. The SAP-certified M8i instances offer 13 sizes including 2 bare metal sizes and the new 96xlarge size for the largest applications.\n  To get started, sign in to the AWS Management Console. For more information about the new instances, visit the M8i instance page or visit the AWS News blog.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-ec2-m8i-instances-additional-regions/",
      "pubDate": "2026-01-08T17:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "ga",
        "now-available"
      ]
    },
    {
      "id": "aws-news-32ca39c0450f",
      "title": "Detect and redact personally identifiable information using Amazon Bedrock Data Automation and Guardrails",
      "description": "This post shows an automated PII detection and redaction solution using Amazon Bedrock Data Automation and Amazon Bedrock Guardrails through a use case of processing text and image content in high volumes of incoming emails and attachments. The solution features a complete email processing workflow with a React-based user interface for authorized personnel to more securely manage and review redacted email communications and attachments. We walk through the step-by-step solution implementation procedures used to deploy this solution. Finally, we discuss the solution benefits, including operational efficiency, scalability, security and compliance, and adaptability.",
      "link": "https://aws.amazon.com/blogs/machine-learning/detect-and-redact-personally-identifiable-information-using-amazon-bedrock-data-automation-and-guardrails/",
      "pubDate": "2026-01-08T16:14:27.000Z",
      "source": "mlBlog",
      "services": [
        "bedrock"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "bedrock"
      ]
    },
    {
      "id": "aws-news-7b44bc56293a",
      "title": "Speed meets scale: Load testing SageMakerAI endpoints with Observe.AI’s testing tool",
      "description": "Observe.ai developed the One Load Audit Framework (OLAF), which integrates with SageMaker to identify bottlenecks and performance issues in ML services, offering latency and throughput measurements under both static and dynamic data loads. In this blog post, you will learn how to use the OLAF utility to test and validate your SageMaker endpoint.",
      "link": "https://aws.amazon.com/blogs/machine-learning/speed-meets-scale-load-testing-sagemakerai-endpoints-with-observe-ais-testing-tool/",
      "pubDate": "2026-01-08T16:12:15.000Z",
      "source": "mlBlog",
      "services": [
        "sagemaker"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker"
      ]
    },
    {
      "id": "aws-news-aed286168341",
      "title": "AWS Lambda adds support for .NET 10",
      "description": "AWS Lambda now supports creating serverless applications using .NET 10. Developers can use .NET 10 as both a managed runtime and a container base image, and AWS will automatically apply updates to the managed runtime and base image as they become available.\n  .NET 10 is the latest long-term support release of .NET and is expected to be supported for security and bug fixes until November 2028. This release provides Lambda developers with access to the latest .NET features, including file-based apps. It also includes support for Lambda Managed Instances, enabling you to run Lambda functions on Amazon EC2 instances while maintaining serverless operational simplicity, providing cost efficiency and specialized compute options. Powertools for AWS Lambda (.NET), a developer toolkit to implement serverless best practices and increase developer velocity, also supports .NET 10. You can use the full range of AWS deployment tools, including the Lambda console, AWS CLI, AWS Serverless Application Model (AWS SAM), AWS CDK, and AWS CloudFormation to deploy and manage serverless applications written in .NET 10.\n  The .NET 10 runtime is available in all Regions, including the AWS GovCloud (US) Regions and China Regions.\n  For more information, including guidance on upgrading existing Lambda functions, see our blog post. For more information about AWS Lambda, visit our product page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/aws-lambda-dot-net-10/",
      "pubDate": "2026-01-08T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lambda",
        "ec2",
        "cloudformation"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda",
        "ec2",
        "cloudformation",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-81bf405c0a0c",
      "title": "AWS analytics at re:Invent 2025: Unifying Data, AI, and governance at scale",
      "description": "re:Invent 2025 showcased the bold Amazon Web Services (AWS) vision for the future of analytics, one where data warehouses, data lakes, and AI development converge into a seamless, open, intelligent platform, with Apache Iceberg compatibility at its core. Across over 18 major announcements spanning three weeks, AWS demonstrated how organizations can break down data silos, […]",
      "link": "https://aws.amazon.com/blogs/big-data/aws-analytics-at-reinvent-2025-unifying-data-ai-and-governance-at-scale/",
      "pubDate": "2026-01-07T22:44:25.000Z",
      "source": "bigDataBlog",
      "services": [
        "eks",
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "eks",
        "organizations",
        "ga",
        "announcement"
      ]
    },
    {
      "id": "aws-news-eb23608ac8ec",
      "title": "AWS simplifies Client VPN onboarding with Quickstart setup",
      "description": "Today, AWS announces a simplified onboarding experience for AWS Client VPN, introducing a new Quickstart setup method that streamlines the process of creating and configuring Client VPN endpoints.\n  AWS Client VPN allows you to securely connect remote users to AWS resources and on-premises networks. The new Quickstart setup, reduces the number of steps required to set up an Client VPN endpoint. You can now easily set up Client VPN endpoints with pre-defined default configurations, requiring only three key inputs: IPv4 CIDR, server certificate ARN, and subnet selection. For example, development teams in large organizations who use Client VPN for remote access to their VPC resources for quick testing can now create endpoints quickly with the new simplified setup process.\n  The Quickstart method is available alongside the existing Standard Setup option, giving you the flexibility to choose the approach that best fits your deployment needs. Additionally, when you create a VPC, the Client VPN Quickstart workflow is automatically suggested as a follow up step. Once endpoint creation is complete, you can immediately download the client configuration file to connect using your VPN client. You can later modify and enhance your endpoint configuration using the Client VPN standard console or API as your usage patterns evolve. This enhancement is available at no additional cost in all AWS Regions where AWS Client VPN is generally available.\n  To learn more about Client VPN:\n  \n \n \nVisit the AWS Client VPN product page\n \n \nRead the AWS Client VPN documentation",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/aws-client-vpn-onboarding-quickstart-setup",
      "pubDate": "2026-01-07T20:44:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "lex",
        "organizations",
        "generally-available",
        "ga",
        "enhancement"
      ]
    },
    {
      "id": "aws-news-31581dc075c4",
      "title": "Announcing Apache Airflow 2.11 Support in Amazon Managed Workflows for Apache Airflow",
      "description": "You can now create Apache Airflow version 2.11 environments on Amazon Managed Workflows for Apache Airflow (MWAA). Apache Airflow 2.11 introduces several changes to help you prepare for upgrading to Apache Airflow 3. \n  Amazon MWAA is a managed orchestration service for Apache Airflow that makes it easier to set up and operate end-to-end data pipelines in the cloud. Apache Airflow 2.11 introduces several notable enhancements, such as new trigger-based scheduling for delta intervals, consistent reporting of metrics in milliseconds and other changes that will make it easy to migrate to Apache Airflow 3. In addition, MWAA now provides support for Python 3.12 that you can leverage in your workflows.\n  You can launch a new Apache Airflow 2.11 environment on Amazon MWAA with just a few clicks in the AWS Management Console in all currently supported Amazon MWAA regions. To learn more about Apache Airflow 2.11 visit the Amazon MWAA documentation, and the Apache Airflow 2.11 change log in the Apache Airflow documentation.\n  Apache, Apache Airflow, and Airflow are either registered trademarks or trademarks of the Apache Software Foundation in the United States and/or other countries.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/apache-airflow-2-11-support-amazon-managed-workflows/",
      "pubDate": "2026-01-07T17:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "launch",
        "enhancement",
        "support"
      ]
    },
    {
      "id": "aws-news-d2b99bbcfdfb",
      "title": "Amazon EC2 I7ie instances now available in additional AWS regions",
      "description": "AWS is announcing starting today, Amazon EC2 I7ie instances are now available in AWS Asia Pacific (Mumbai), Canada West (Calgary) and Europe (Paris) regions. Designed for large storage I/O intensive workloads, I7ie instances are powered by 5th Gen Intel Xeon Processors with an all-core turbo frequency of 3.2 GHz, offering up to 40% better compute performance and 20% better price performance over existing I3en instances. I7ie instances offer up to 120TB local NVMe storage density for storage optimized instances and offer up to twice as many vCPUs and memory compared to prior generation instances. Powered by 3rd generation AWS Nitro SSDs, I7ie instances deliver up to 65% better real-time storage performance, up to 50% lower storage I/O latency, and 65% lower storage I/O latency variability compared to I3en instances.\n  I7ie are high density storage optimized instances, ideal for workloads requiring fast local storage with high random read/write performance at very low latency consistency to access large data sets. These instances are available in 9 different virtual sizes and deliver up to 100Gbps of network bandwidth and 60Gbps of bandwidth for Amazon Elastic Block Store (EBS).\n  To learn more, visit the I7ie instances page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-ec2-i7ie-instances-additional-aws-regions/",
      "pubDate": "2026-01-07T17:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "ec2",
        "ga",
        "now-available"
      ]
    },
    {
      "id": "aws-news-122931709b9f",
      "title": "Amazon EC2 C8i and C8i-flex instances are now available in additional AWS regions",
      "description": "Starting today, Amazon Elastic Compute Cloud (Amazon EC2) C8i and C8i-flex instances are available in the Asia Pacific (Mumbai), Asia Pacific (Seoul), and Asia Pacific (Tokyo) regions. These instances are powered by custom Intel Xeon 6 processors, available only on AWS, delivering the highest performance and fastest memory bandwidth among comparable Intel processors in the cloud. These C8i and C8i-flex instances offer up to 15% better price-performance, and 2.5x more memory bandwidth compared to previous generation Intel-based instances. They deliver up to 20% higher performance than C7i and C7i-flex instances, with even higher gains for specific workloads. The C8i and C8i-flex are up to 60% faster for NGINX web applications, up to 40% faster for AI deep learning recommendation models, and 35% faster for Memcached stores compared to C7i and C7i-flex.\n  C8i-flex are the easiest way to get price performance benefits for a majority of compute intensive workloads like web and application servers, databases, caches, Apache Kafka, Elasticsearch, and enterprise applications. They offer the most common sizes, from large to 16xlarge, and are a great first choice for applications that don't fully utilize all compute resources.\n  C8i instances are a great choice for all memory-intensive workloads, especially for workloads that need the largest instance sizes or continuous high CPU usage. C8i instances offer 13 sizes including 2 bare metal sizes and the new 96xlarge size for the largest applications.\n  To get started, sign in to the AWS Management Console. Customers can purchase these instances via Savings Plans, On-Demand instances, and Spot instances. For more information about the new C8i and C8i-flex instances visit the AWS News blog.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-ec2-c8i-c8i-flex-instances-additional-aws-regions",
      "pubDate": "2026-01-07T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "ec2",
        "kafka"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "ec2",
        "kafka",
        "ga",
        "now-available"
      ]
    },
    {
      "id": "aws-news-304f0b522c8b",
      "title": "Amazon EMR Serverless eliminates local storage provisioning, reducing data processing costs by up to 20%",
      "description": "In this post, you'll learn how Amazon EMR Serverless eliminates the need to configure local disk storage for Apache Spark workloads through a new serverless storage capability. We explain how this feature automatically handles shuffle operations, reduces data processing costs by up to 20%, prevents job failures from disk capacity constraints, and enables elastic scaling by decoupling storage from compute.",
      "link": "https://aws.amazon.com/blogs/big-data/amazon-emr-serverless-eliminates-local-storage-provisioning-reducing-data-processing-costs-by-up-to-20/",
      "pubDate": "2026-01-06T22:45:40.000Z",
      "source": "bigDataBlog",
      "services": [
        "emr"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "emr"
      ]
    },
    {
      "id": "aws-news-0441a64bbc32",
      "title": "Building scalable AWS Lake Formation governed data lakes with dbt and Amazon Managed Workflows for Apache Airflow",
      "description": "Organizations often struggle with building scalable and maintainable data lakes—especially when handling complex data transformations, enforcing data quality, and monitoring compliance with established governance. Traditional approaches typically involve custom scripts and disparate tools, which can increase operational overhead and complicate access control. A scalable, integrated approach is needed to simplify these processes, improve data reliability, […]",
      "link": "https://aws.amazon.com/blogs/big-data/building-scalable-aws-lake-formation-governed-data-lakes-with-dbt-and-amazon-managed-workflows-for-apache-airflow/",
      "pubDate": "2026-01-06T22:37:30.000Z",
      "source": "bigDataBlog",
      "services": [
        "lex",
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "lex",
        "organizations",
        "ga"
      ]
    },
    {
      "id": "aws-news-af43b6ce1b00",
      "title": "AWS Marketplace Seller Reporting now provides collections visibility",
      "description": "Today, AWS announces collection visibility in AWS Marketplace Seller Reporting, which adds up-to-date payment collection status to the Billed Revenue Dashboard and Billing Event Data Feed.\n  This enhancement enables sellers to distinguish between invoiced, collected, and disbursed amounts, eliminating the visibility gap between invoice creation and disbursement. With this feature, sellers can make informed business decisions and reduce unnecessary follow-ups with customers about payment status.\n  Collection visibility particularly benefits sellers using monthly disbursement who previously waited up to 30 days to understand payment collection status. All AWS Marketplace sellers can now improve payment forecasting accuracy and detect collection issues earlier. This enhanced visibility streamlines seller operations and improves customer relationships by providing clarity on payment status.\n  Collection visibility is available in all AWS Regions where AWS Seller Reporting is available. The feature launches on January 6th, 2026 for all AWS sellers.\n  To access collection visibility, log into the AWS Marketplace Management Portal and navigate to Insights → Finance Operations",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/aws-marketplace-seller-reporting-collections/",
      "pubDate": "2026-01-06T18:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "forecast"
      ],
      "categories": [
        "ai-services"
      ],
      "tags": [
        "forecast",
        "launch",
        "ga",
        "enhancement"
      ]
    },
    {
      "id": "aws-news-09ddec90de92",
      "title": "Amazon ECS now supports tmpfs mounts on AWS Fargate and ECS Managed Instances",
      "description": "Amazon Elastic Container Service (Amazon ECS) now supports tmpfs mounts for Linux tasks running on AWS Fargate and Amazon ECS Managed Instances, extending beyond the EC2 launch type. With tmpfs, you can now create memory‑backed file systems for your containerized workloads without writing this data to task storage.\n  tmpfs mounts provide a temporary file system that is backed by memory and exposed inside the container at a path you choose. This is ideal for performance‑sensitive workloads that need fast access to scratch files, caches, or temporary working sets, and for security‑sensitive data such as short‑lived secrets or credentials, because the data does not persist after the task stops. tmpfs also lets you keep the container root file system read‑only using the readonlyRootFilesystem setting while still allowing applications to write to specific in‑memory directories.\n  To get started, update your task definition so that the container definitions include a linuxParameters block with one or more tmpfs entries. For each tmpfs mount, specify the containerPath, size, and optional mountOptions. You can register or update task definitions using the Amazon ECS console, AWS CLI, AWS CloudFormation, or AWS CDK. This feature is available in all AWS Regions where Amazon ECS, AWS Fargate, and Amazon ECS Managed Instances are supported. To learn more, see the LinuxParameters and Tmpfs sections in the Amazon ECS API Reference and the Amazon ECS Developer Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-ecs-tmpfs-mounts-aws-fargate-managed-instances",
      "pubDate": "2026-01-06T18:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2",
        "ecs",
        "fargate",
        "cloudformation"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "ec2",
        "ecs",
        "fargate",
        "cloudformation",
        "launch",
        "ga",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-6ef7d538452f",
      "title": "Amazon MQ now supports HTTP based authentication for RabbitMQ brokers",
      "description": "Amazon MQ now supports the ability for RabbitMQ brokers to perform authentication (determining who can log in) and authorization (determining what permissions they have) by making requests to an HTTP server. This plugin can be configured on brokers running RabbitMQ 4.2 and above on Amazon MQ by making changes to the associated configuration file.\n  To start using HTTP based authentication and authorization on Amazon MQ, simply select RabbitMQ 4.2 when creating a new broker using the m7g instance type through the AWS Management console, AWS CLI, or AWS SDKs, and then edit the associated configuration file. To learn more about the plugin, see the Amazon MQ release notes and the Amazon MQ developer guide. This plugin is available in all regions where Amazon MQ RabbitMQ 4 instances are available today.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-mq-http-based-rabbitmq-brokers/",
      "pubDate": "2026-01-06T17:35:00.000Z",
      "source": "whatsNew",
      "services": [
        "q developer"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "q developer",
        "support"
      ]
    },
    {
      "id": "aws-news-8961df6dac08",
      "title": "AWS Config now supports 21 new resource types",
      "description": "AWS Config now supports 21 additional AWS resource types across key services including Amazon EC2, Amazon SageMaker, and Amazon S3 Tables. This expansion provides greater coverage over your AWS environment, enabling you to more effectively discover, assess, audit, and remediate an even broader range of resources.\n  With this launch, if you have enabled recording for all resource types, then AWS Config will automatically track these new additions. The newly supported resource types are also available in Config rules and Config aggregators.\n  You can now use AWS Config to monitor the following newly supported resource types in all AWS Regions where the supported resources are available:\n  Resource Types:\n  \n \n \n  \nAWS::AppStream::AppBlockBuilder \n   AWS::IoT::ThingGroup \n  \nAWS::B2BI::Capability \n   AWS::IoTSiteWise::Asset \n  \nAWS::CleanRoomsML::TrainingDataset \n   AWS::Location::APIKey \n  \nAWS::CloudFront::KeyValueStore \n   AWS::MediaPackageV2::OriginEndpoint \n  \nAWS::Connect::SecurityProfile \n   AWS::PCAConnectorAD::Connector \n  \nAWS::Deadline::Monitor \n   AWS::Route53::DNSSEC \n  \nAWS::EC2::SubnetCidrBlock \n   AWS::S3Tables::TableBucketPolicy \n  \nAWS::ECR::ReplicationConfiguration \n   AWS::SageMaker::UserProfile \n  \nAWS::GameLift::Build \n   AWS::SecretsManager::ResourcePolicy \n  \nAWS::GuardDuty::MalwareProtectionPlan       \n   AWS::SSMContacts::Contact \n  \nAWS::ImageBuilder::LifecyclePolicy",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/aws-config-new-resource-types",
      "pubDate": "2026-01-06T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "sagemaker",
        "s3",
        "ec2",
        "cloudfront"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "sagemaker",
        "s3",
        "ec2",
        "cloudfront",
        "launch",
        "ga",
        "support",
        "expansion"
      ]
    },
    {
      "id": "aws-news-ad7d6516e129",
      "title": "Amazon EC2 G5 instances are now available in Asia Pacific (Hong Kong) Region",
      "description": "Starting today, the Amazon Elastic Compute Cloud (Amazon EC2) G5 instances powered by NVIDIA A10G Tensor Core GPUs are now available in the Asia Pacific (Hong Kong) region. G5 instances can be used for a wide range of graphics intensive and machine learning use cases.\n \nCustomers can use G5 instances for graphics-intensive applications such as remote workstations, video rendering, and cloud gaming to produce high fidelity graphics in real time. Machine learning customers can use G5 instances for high performance and cost-efficient training and inference for natural language processing, computer vision, and recommender engine use cases. G5 instances feature up to 8 NVIDIA A10G Tensor Core GPUs and 2nd generation AMD EPYC processors. They also support up to 192 vCPUs, up to 100 Gbps of network bandwidth, and up to 7.6 TB of local NVMe SSD storage. With eight G5 instance sizes that offer access to single or multiple GPUs, customers have the flexibility to pick the right instance size for their applications.\n \nCustomers can easily optimize G5 instances for their workloads with NVIDIA drivers specific to compute, gaming or workstation workloads. Customers can purchase G5 instances as On-Demand Instances or Reserved Instances.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-ec2-g5-now-available-asia-pacific-hong-kong",
      "pubDate": "2026-01-05T18:55:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "ec2"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "lex",
        "ec2",
        "ga",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-582af0ab873e",
      "title": "Happy New Year! AWS Weekly Roundup: 10,000 AIdeas Competition, Amazon EC2, Amazon ECS Managed Instances and more (January 5, 2026)",
      "description": "Happy New Year! I hope the holidays gave you time to recharge and spend time with your loved ones. Like every year, I took a few weeks off after AWS re:Invent to rest and plan ahead. I used some of that downtime to plan the next cohort for Become a Solutions Architect (BeSA). BeSA is […]",
      "link": "https://aws.amazon.com/blogs/aws/happy-new-year-aws-weekly-roundup-10000-aideas-competition-amazon-ec2-amazon-ecs-managed-instances-and-more-january-5-2026/",
      "pubDate": "2026-01-05T17:10:37.000Z",
      "source": "newsBlog",
      "services": [
        "ec2",
        "ecs",
        "eks"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "ec2",
        "ecs",
        "eks",
        "ga"
      ]
    },
    {
      "id": "aws-news-f6807f23fa50",
      "title": "AWS Resource Explorer is now available in AWS Asia Pacific (New Zealand) Region.",
      "description": "Today, AWS Resource Explorer has expanded the availability of resource search and discovery to the Asia Pacific (New Zealand) Region.\n  With AWS Resource Explorer you can search for and discover your AWS resources across AWS Regions and accounts in your organization, either using the AWS Resource Explorer console, the AWS Command Line Interface (AWS CLI), the AWS SDKs, or the unified search bar from wherever you are in the AWS Management Console.\n  For more information about the Regions where AWS Resource Explorer is available, see the AWS Region table.\n  To turn on AWS Resource Explorer, visit the AWS Resource Explorer console. Read about getting started in our AWS Resource Explorer documentation, or explore the AWS Resource Explorer product page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/aws-resource-explorer-aws-asia-pacific-new-zealand/",
      "pubDate": "2026-01-05T15:15:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga",
        "now-available"
      ]
    },
    {
      "id": "aws-news-23eaa0da3d41",
      "title": "AWS Transfer Family is now available in AWS Asia Pacific (New Zealand) region",
      "description": "Customers in AWS Asia Pacific (New Zealand) Region can now use AWS Transfer Family for file transfers over Secure File Transfer Protocol (SFTP), File Transfer Protocol (FTP), FTP over SSL (FTPS) and Applicability Statement 2 (AS2).\n  AWS Transfer Family provides fully managed file transfers for Amazon Simple Storage Service (Amazon S3) and Amazon Elastic File System (Amazon EFS) over SFTP, FTP, FTPS and AS2 protocols. In addition to file transfers, Transfer Family enables common file processing and event-driven automation for managed file transfer (MFT) workflows, helping customers to modernize and migrate their business-to-business file transfers to AWS.\n  To learn more about AWS Transfer Family, visit our product page and user guide. See the AWS Region Table for complete regional availability information.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/aws-transfer-family-asia-pacific-new-zealand-region",
      "pubDate": "2026-01-05T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "s3"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "s3",
        "now-available"
      ]
    },
    {
      "id": "aws-news-b5223795e1c1",
      "title": "EC2 Capacity Manager now includes Spot interruption metrics",
      "description": "Today, AWS announces new Spot interruption metrics for Amazon EC2 Capacity Manager that allow you to better understand Spot capacity across your organization. EC2 Capacity Manager helps you monitor, analyze, and manage your EC2 capacity across On-Demand, Spot, and Capacity Reservations from a single location. With this new capability, you can now track how many Spot instances are running, monitor interruption counts, and calculate interruption rates across regions, availability zones, and accounts. This enables you to make data-driven decisions about your Spot instance strategy.\n  EC2 Capacity Manager now includes three new metrics: ‘Spot Total Count’, ‘Spot Total Interruptions’, and ‘Spot Interruption Rate. ‘Spot Total Count’ shows the total number of distinct Spot instances or vCPUs that ran during a selected period, ‘Spot Total Interruptions’ tracks how many were interrupted, and ‘Spot Interruption Rate’ calculates the percentage of running instances that experienced interruptions. This data helps you identify patterns, compare across different regions and availability zones, and optimize your Spot instance strategy by diversifying instance types, expanding across availability zones, or using Spot placement score to identify optimal capacity pools with higher availability.\n  EC2 Capacity Manager with Spot interruption metrics is available in all commercial AWS Regions enabled by default at no additional cost.\n  To get started, visit EC2 Capacity Manager in the AWS console.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/ec2-capacity-manager-spot-interruption-metrics/",
      "pubDate": "2026-01-05T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "ga",
        "new-capability"
      ]
    },
    {
      "id": "aws-news-47ad79e48c2b",
      "title": "AWS Clean Rooms now supports detailed monitoring for collaboration queries",
      "description": "Today, AWS Clean Rooms announces the launch of detailed monitoring for SQL queries in a collaboration. This new capability publishes detailed metrics to CloudWatch for operational monitoring of collaborations, including query performance and resource utilization.\n  You can choose to publish detailed monitoring metrics for SQL queries run in a Clean Rooms collaboration to CloudWatch, helping you improve the observability for your workloads at scale. The collaboration creator can enable detailed monitoring for a collaboration, and the analysis runner or configured payor can enable detailed monitoring when configuring their collaboration membership. For example, advertisers can monitor their campaign lift analysis queries in CloudWatch to identify performance issues and optimize costs.\n  With AWS Clean Rooms, customers can create a secure data clean room in minutes and collaborate with any company on AWS or Snowflake to generate unique insights about advertising campaigns, investment decisions, and research and development. For more information about the AWS Regions where AWS Clean Rooms is available, see the AWS Regions table. To learn more about collaborating with AWS Clean Rooms, visit AWS Clean Rooms.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/clean-rooms-detailed-monitoring-collaboration-queries",
      "pubDate": "2026-01-02T18:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "cloudwatch"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "cloudwatch",
        "launch",
        "support",
        "new-capability"
      ]
    },
    {
      "id": "aws-news-354d826c5819",
      "title": "Amazon Connect now provides the capability to store nested JSON object and looping arrays",
      "description": "Amazon Connect now enables you to store and work with complex data structures in your flows, making it easy to build dynamic automated experiences that use rich information returned from your internal business systems. You can save complete data records, including nested JSON objects and lists, and reference specific elements within them, such as a particular order from a list of orders returned in JSON format.\n  Additionally, you can automatically loop through lists of items in your customer service flows, moving through each entry in sequence while tracking the current position in the loop. This allows you to easily access item-level details and present relevant information to end-customers. For example, a travel agency can retrieve all of a customer’s itineraries in a single request and guide the caller through each booking to review or update their reservations. A bank can similarly walk customers through recent transactions one by one using data retrieved securely from its systems. These capabilities reduce the need for repeated calls to your business systems, simplify workflow design, and make it easier to deliver advanced automated experiences that adapt as your business requirements evolve.\n  To learn more about these features, see the Amazon Connect Administrator Guide. These features are available in all AWS regions where Amazon Connect is available. To learn more about Amazon Connect, AWS’s AI-native customer experience solution, please visit the Amazon Connect website.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-connect-nested-json-object-looping-arrays",
      "pubDate": "2026-01-02T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "rds"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "rds",
        "update"
      ]
    },
    {
      "id": "aws-news-fa52ece38a3b",
      "title": "AWS WAF is now available in the AWS Asia Pacific (New Zealand) Region",
      "description": "Starting today, AWS WAF is available in the AWS Asia Pacific (New Zealand) Region.\n  AWS WAF is a web application firewall that helps you protect your web application resources against common web exploits and bots that can affect availability, compromise security, or consume excessive resources. With AWS WAF, you can control access to your content. Based on conditions that you specify, such as the IP addresses that requests originate from or the values of query strings, your protected resource responds to requests either with the requested content, with an HTTP 403 status code (Forbidden), or with a custom response.\n  To see the full list of regions where AWS WAF is currently available, visit the AWS Region Table. For more information about the service, visit the AWS WAF page. For more information about pricing, visit the AWS WAF Pricing page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-waf-asia-pacific-new-zealand-region/",
      "pubDate": "2025-12-30T18:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "waf"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "waf",
        "ga",
        "now-available"
      ]
    },
    {
      "id": "aws-news-a0fe3428a81f",
      "title": "AWS launches simplified import of CloudTrail Lake data in Amazon CloudWatch",
      "description": "Today, AWS launches simplified import of CloudTrail Lake data in Amazon CloudWatch, a data management and analytics service that allows you to unify operational, security, and compliance data across your AWS environment and third-party sources. With this launch, you can now import your historical CloudTrail Lake data into CloudWatch with a few steps enabling you to easily consolidate operational, security, and compliance data in one place. In CloudWatch, you simply specify the CloudTrail Lake event data store (EDS), and the date range to initiate import of your CloudTrail data. Simplified import of CloudTrail Lake data is supported via the AWS console, CLI, and SDK.\n  While simplified import of CloudTrail Lake data is available at no additional cost, you incur CloudWatch fees based on custom logs pricing. To learn more about simplified import of CloudTrail Lake data and supported AWS regions, visit the Amazon CloudWatch documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-simplified-import-cloudtrail-lake-data-amazon-cloudwatch",
      "pubDate": "2025-12-30T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "cloudwatch"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "cloudwatch",
        "launch",
        "support"
      ]
    },
    {
      "id": "aws-news-654aee2954d9",
      "title": "Amazon OpenSearch UI supports CMK and increased metadata size",
      "description": "Amazon OpenSearch Service now supports AWS KMS customer managed keys (CMKs) and increased size for OpenSearch UI metadata. Amazon OpenSearch UI is a managed service for dashboarding and operational analytics that provides a unified view across multiple data sources, including OpenSearch domains and collections, Amazon S3, Amazon CloudWatch, and AWS Security Lake.\n  You can now create new OpenSearch UI applications with metadata encrypted with your own CMKs, helping organizations meet regulatory and compliance requirements. This launch also increases the metadata size limit for saved objects in OpenSearch UI, enabling you to create and store complex queries, extensive visualizations, and large-scale dashboards.\n  CMK support and increased metadata size are available in all regions that OpenSearch UI is available. Learn more at Amazon OpenSearch UI Developer Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-opensearch-ui-cmk-metadata/",
      "pubDate": "2025-12-29T08:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "s3",
        "opensearch",
        "opensearch service",
        "rds",
        "cloudwatch",
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "lex",
        "s3",
        "opensearch",
        "opensearch service",
        "rds",
        "cloudwatch",
        "organizations",
        "launch",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-703f728efd33",
      "title": "Amazon Connect expands automated agent performance evaluations to 5 additional languages",
      "description": "Amazon Connect now automates agent performance evaluations in Portuguese, French, Italian, German, and Spanish using generative AI. Managers define custom evaluation criteria in natural language and receive AI-generated evaluations with justifications in their preferred language. Performance evaluations also supports cross-language evaluation and can complete assessments in English, even when the conversation is in another language. This enables multilingual contact centers to use a standardized evaluation framework across languages.\n  This feature is supported in 8 AWS regions including US East (N. Virginia), US West (Oregon), Europe (Frankfurt), Europe (London), Canada (Central), Asia Pacific (Sydney), Asia Pacific (Tokyo), and Asia Pacific (Singapore). For information about Amazon Connect pricing, please visit our pricing page. To learn more, please visit our documentation and our webpage.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-connect-automated-performance-evaluations-additional-languages/",
      "pubDate": "2025-12-26T18:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-fb901172890e",
      "title": "Simplified management of Amazon MSK with natural language using Kiro CLI and Amazon MSK MCP Server",
      "description": "In this post, we demonstrate how Kiro CLI and the MSK MCP server can streamline your Kafka management. Through practical examples and demonstrations, we show you how to use these tools to perform common administrative tasks efficiently while maintaining robust security and reliability.",
      "link": "https://aws.amazon.com/blogs/big-data/simplified-management-of-amazon-msk-with-natural-language-using-kiro-cli-and-amazon-msk-mcp-server/",
      "pubDate": "2025-12-24T17:55:05.000Z",
      "source": "bigDataBlog",
      "services": [
        "kafka",
        "msk"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "kafka",
        "msk"
      ]
    },
    {
      "id": "aws-news-806f6f7b161f",
      "title": "Oracle Database@AWS is now available in three additional AWS Regions",
      "description": "Oracle Database@AWS is now generally available in three additional AWS Regions - US-East-2 (Ohio), EU-Central-1 (Frankfurt), and AP-Northeast-1 (Tokyo). Oracle Database@AWS enables customers to access database services on Oracle Cloud Infrastructure (OCI) managed Oracle Exadata systems within AWS data centers. With this launch, customers in the EU and Japan with in-region data residency requirements can easily migrate on-premises Oracle Exadata applications to AWS.\n  With this expansion, AWS customers can run OCI Exadata Database Service, OCI Autonomous Database on Dedicated Infrastructure, and OCI Autonomous Recovery Service in five Regions - US-East-1 (N.Virginia), US-West-2 (Oregon), US-East-2 (Ohio), EU-Central-1 (Frankfurt), and AP-Northeast-1 (Tokyo). To use these services, request a private offer from Oracle through the AWS Marketplace, and use AWS Management Console to setup database resources.\n  To learn more, visit Oracle Database@AWS overview and documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/oracle-database-aws-available-three-additional-regions/",
      "pubDate": "2025-12-23T18:50:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "launch",
        "generally-available",
        "now-available",
        "expansion"
      ]
    },
    {
      "id": "aws-news-6ca65b24753d",
      "title": "NVIDIA Nemotron 3 Nano now available on Amazon Bedrock",
      "description": "Amazon Bedrock now supports NVIDIA Nemotron 3 Nano 30B A3B model, NVIDIA's latest breakthrough in efficient language modeling that delivers high reasoning performance, native tool calling support, and extended context processing with 256k token context window. This model employs an efficient hybrid Mixture-of-Experts (MoE) architecture to ensure higher throughput than its predecessors for agentic and coding workloads, while maintaining the reasoning depth of a larger model. With explicit reasoning controls and higher accuracy enabled by advanced reinforcement learning techniques and multi-environment post-training at scale, this model is ideal for enterprises, startups, and individual developers building multi-agent workflows, developer productivity tools, processes automation, and for scientific and mathematical reasoning analysis, amongst others.\n  NVIDIA Nemotron 3 Nano on Amazon Bedrock is powered by Project Mantle, a new distributed inference engine for large-scale machine learning model serving on Amazon Bedrock. Project Mantle simplifies and expedites onboarding of new models onto Amazon Bedrock, provides highly performant and reliable serverless inference with sophisticated quality of service controls, unlocks higher default customer quotas with automated capacity management and unified pools, and provides out-of-the-box compatibility with OpenAI API specifications.\n \nNVIDIA Nemotron 3 Nano is available today on Amazon Bedrock in US East (N. Virginia), US East (Ohio), US West (Oregon), Asia Pacific (Tokyo), Asia Pacific (Mumbai), South America (Sao Paulo), Europe (London), and Europe (Milan) AWS Regions, and supports both unified and OpenAI API-compatible service endpoints on Amazon Bedrock. To learn more and get started, visit Amazon Bedrock console or the service documentation here. To get started with Amazon Bedrock OpenAI API-compatible service endpoints, visit documentation here.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/nvidia-nemotron-3-nano-amazon-bedrock",
      "pubDate": "2025-12-23T18:11:00.000Z",
      "source": "whatsNew",
      "services": [
        "bedrock"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "bedrock",
        "now-available",
        "support",
        "new-model"
      ]
    },
    {
      "id": "aws-news-4b2bdb387b66",
      "title": "Amazon MSK expands Standard Brokers and Express Brokers to Asia Pacific (New Zealand) Region",
      "description": "Amazon Managed Streaming for Apache Kafka (Amazon MSK) is now available in Asia Pacific (New Zealand) region. Customers can create Amazon MSK Provisioned clusters in this region starting today.\n  Amazon MSK is a fully managed service for Apache Kafka and Kafka Connect that makes it easier for you to build and run applications that use Apache Kafka as a data store. Amazon MSK is fully compatible with Apache Kafka, which enables you to more quickly migrate your existing Apache Kafka workloads to Amazon MSK with confidence or build new ones from scratch. With Amazon MSK, you spend more time building innovative streaming applications and less time managing Kafka clusters.\n  Amazon MSK offers two types of Apache Kafka provisioned broker - Standard brokers and Express brokers. Standard brokers offer the most flexibility to configure your cluster’s performance. You can configure availability, durability, throughput, and latency. You also control the storage configurations on your cluster and are responsible for managing storage provisioning and utilization. Express brokers are a new broker type for Amazon MSK Provisioned designed to deliver up to 3x more throughput per broker, scale up to 20x faster, up to 5x more partitions per broker, and reduce recovery time by 90% as compared to Standard brokers. Express brokers come pre-configured with Kafka best practices by default, support all Kafka APIs, and provide the same low-latency performance that Amazon MSK customers expect, so they can continue using existing client applications without any changes.\n  You can now create an MSK provisioned cluster with Standard or Express brokers in Asia Pacific (New Zealand) Region through the Amazon MSK console or the Amazon CLI. To get started, see the Amazon MSK Developer Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-msk-additional-aws-region/",
      "pubDate": "2025-12-23T18:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "nova",
        "lex",
        "kafka",
        "msk"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "nova",
        "lex",
        "kafka",
        "msk",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-13017d9b8a14",
      "title": "Amazon WorkSpaces Secure Browser now supports WebAuthn redirection for local Chromium browsers",
      "description": "Amazon WorkSpaces Secure Browser now supports Web Authentication (WebAuthn) redirection, allowing users to authenticate to websites using their local FIDO2 security keys, biometric authenticators, and platform authenticators while browsing in their WorkSpaces Secure Browser session. This feature is compatible with Chromium-based browser on users’ local devices, such as Google Chrome 136 (or later) or Microsoft Edge 137 (or later). It is not supported on non-Chromium-based browsers such as Safari or Firefox.\n  WebAuthn redirection helps users enjoy seamless and secure authentication on websites within their WorkSpaces Secure Browser sessions. This feature supports FIDO2 security keys, passkeys, and platform authenticators like Windows Hello or Touch ID. To enable the feature, administrators must activate WebAuthn redirection in Secure browser’s portal settings and configure the local browsers using the WebAuthenticationRemoteDesktopAllowedOrigins policy. This configuration allows WebAuthn tokens to be securely transmitted from a user’s local device to websites within a Secure Browser session, ensuring that users can authenticate securely without compromising the security benefits of the remote browsing environment.\n  This feature is available at no additional cost in all regions where Amazon WorkSpaces Secure Browser is available, including US East (N. Virginia), US West (Oregon), Canada (Central), Europe (Frankfurt, London, Ireland), and Asia Pacific (Tokyo, Mumbai, Sydney, Singapore)\n  To get started and enable WebAuthn redirection, visit the Amazon WorkSpaces Secure Browser console. For more information, see the WebAuthn redirection section in the Amazon WorkSpaces Secure Browser’s documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-workspaces-secure-browser-webauthn-redirection-chromium-browsers",
      "pubDate": "2025-12-23T18:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-c1dc0b98a8b4",
      "title": "Amazon RDS for MySQL announces Innovation Release 9.5 in Amazon RDS Database Preview Environment",
      "description": "Amazon RDS for MySQL now supports community MySQL Innovation Release 9.5 in the Amazon RDS Database Preview Environment, allowing you to evaluate the latest Innovation Release on Amazon RDS for MySQL. You can deploy MySQL 9.5 in the Amazon RDS Database Preview Environment which provides the benefits of a fully managed database, making it simpler to set up, operate, and monitor databases.\n  MySQL 9.5 is the latest Innovation Release from the MySQL community. MySQL Innovation releases include bug fixes, security patches, as well as new features. MySQL Innovation releases are supported by the community until the next innovation minor, whereas MySQL Long Term Support (LTS) Releases, such as MySQL 8.0 and MySQL 8.4, are supported by the community for up to eight years. Please refer to the MySQL 9.5 release notes and Amazon RDS MySQL release notes for more details.\n  Amazon RDS Database Preview Environment supports both Single-AZ and Multi-AZ deployments on the latest generation of instance classes. Amazon RDS Database Preview Environment database instances are retained for a maximum of 60 days and are automatically deleted after the retention period. Amazon RDS database snapshots created in the Preview Environment can only be used to create or restore database instances within the Preview Environment.\n  Amazon RDS Database Preview Environment database instances are priced the same as production RDS instances created in the US East (Ohio) Region. For further information, see Working with the Database Preview Environment. To get started with the Preview Environment from the RDS console, navigate here.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-rds-mysql-innovation-release/",
      "pubDate": "2025-12-23T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "nova",
        "rds"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "nova",
        "rds",
        "preview",
        "ga",
        "new-feature",
        "support"
      ]
    },
    {
      "id": "aws-news-047fc4a05d74",
      "title": "AWS Secrets Manager announces improved secret sorting capabilities",
      "description": "Today, AWS Secrets Manager announces enhanced secret sorting capabilities in the Secrets Manager console and for ListSecrets API. You can now sort secrets by name, last changed date, last accessed date, and creation date—expanding beyond the previous creation date-only option.\n  Secrets Manager is a fully managed service that helps you manage, retrieve, and rotate database credentials, application credentials, API keys, and other secrets throughout their lifecycles. This enhancement improves secret discovery by providing flexible sorting options across multiple dimensions through both Secrets Manager console and APIs.\n  The new sorting capabilities are available in Secrets Manager console and ListSecrets API in all AWS commercial and AWS GovCloud (US) Regions. For a list of regions where Secrets Manager is available, see the AWS Region table.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-secrets-manager-secret-sorting-capabilities",
      "pubDate": "2025-12-23T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "secrets manager"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "secrets manager",
        "enhancement"
      ]
    },
    {
      "id": "aws-news-d9db993d9387",
      "title": "MiniMax-M2 is now available on Amazon SageMaker JumpStart",
      "description": "MiniMax-M2 is now available on Amazon SageMaker JumpStart, providing customers with immediate access to deploy this efficient open-source model in minutes. With SageMaker JumpStart, you can quickly discover, evaluate, and deploy MiniMax-M2 using either SageMaker Studio's intuitive interface or the SageMaker Python SDK for programmatic deployment.\n \nMiniMax-M2 redefines efficiency for agents. It's a compact, fast, and cost-effective MoE model (230 billion total parameters with 10 billion active parameters) built for elite performance in coding and agentic tasks, all while maintaining powerful general intelligence.\n \nTo learn more about deploying foundation models with SageMaker JumpStart, deployment options with the SDK, and best practices for implementation, refer to our documentation.\n \nMiniMax-M2 is available in US East (N. Virginia), US East (Ohio), US West (Oregon), Asia Pacific (Tokyo), Asia Pacific (Seoul), Asia Pacific (Singapore), Asia Pacific (Mumbai), Asia Pacific (Sydney), Asia Pacific (Jakarta), Canada (Central), Europe (Frankfurt), Europe (Stockholm), Europe (Ireland), Europe (London), Europe (Paris), South America (São Paulo).",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/minimax-m2-on-sagemaker-jumpstart",
      "pubDate": "2025-12-23T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "sagemaker",
        "jumpstart"
      ],
      "categories": [
        "foundation-models"
      ],
      "tags": [
        "sagemaker",
        "jumpstart",
        "ga",
        "now-available"
      ]
    },
    {
      "id": "aws-news-876bfc20c2ec",
      "title": "AWS Transform enables network conversion for hybrid data center migrations",
      "description": "AWS Transform now supports automatic network conversion from hybrid data centers, eliminating manual network mapping for environments running both VMware and non-VMware workloads. The service now analyzes VLANs and IP ranges across all exported source networks and maps these to AWS constructs like Virtual Private Clouds (VPCs), subnets, and security groups.\n  AWS Transform for VMware is an agentic AI-powered service that automates the discovery, planning, and migration of VMware workloads, accelerating infrastructure modernization with increased confidence. The service extends support to hybrid data centers by analyzing exported data from application mapping tools such as modelizeIT to automatically generate Infrastructure as Code and provision AWS networking resources.\n  This feature is available in all AWS Transform target Regions.\n  To learn more, visit the AWS Transform product page, read the user guide, or get started in the AWS Transform web experience.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-transform-hybrid-network-migration/",
      "pubDate": "2025-12-23T12:47:00.000Z",
      "source": "whatsNew",
      "services": [
        "transform for vmware"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "transform for vmware",
        "support"
      ]
    },
    {
      "id": "aws-news-5c5be3bcfb27",
      "title": "Amazon WorkSpaces Secure Browser enables branding customization",
      "description": "Amazon WorkSpaces Secure Browser now supports branding customization, enabling you to create a consistent, branded experience that helps you align with your organization's visual identity. This feature allows you to customize the sign-in and session loading screens that appear to your end users by modifying visual elements and text content to maintain brand consistency across all user touch points.\n  You can personalize the sign-in and session loading experience by uploading your organization's favicon, logo, and wallpaper, selecting color themes, and customizing the welcome message , the browser tab title, and other text fields in all 11 languages supported by the service. You can also modify the \"Contact Us\" link to redirect to your organization's support page and add a Terms of Service page that users must acknowledge before starting a session. All customization settings are designed to meet WCAG AA accessibility and contrast requirements.\n  This feature is available at no additional cost in 10 AWS Regions, including US East (N. Virginia), US West (Oregon), Canada (Central), Europe (Frankfurt, London, Ireland), and Asia Pacific (Tokyo, Mumbai, Sydney, Singapore). WorkSpaces Secure Browser offers pay-as-you go pricing.\n  To get started, visit the Amazon WorkSpaces Secure Browser console to configure your branding settings. For more information, see the branding customization section in the Amazon WorkSpaces Secure Browser’s documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-workspaces-secure-browser-enables-branding/",
      "pubDate": "2025-12-23T08:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "personalize"
      ],
      "categories": [
        "ai-services"
      ],
      "tags": [
        "personalize",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-da30ce7f7705",
      "title": "AWS End User Messaging SMS launches a Generative AI Registration Reviewer (Preview)",
      "description": "Starting today, AWS End User Messaging customers can use AWS generative AI to review their phone number registrations, so you can submit to mobile carriers correctly the first time. With the registration reviewer (preview), AWS will provide you feedback on your registration form checking the message sample, opt-in description, use-case, help and stop messages, etc., helping you submit an accurate and complete registration.\n  AWS End User Messaging provides developers with a scalable and cost-effective messaging infrastructure without compromising the safety, security, or results of their communications. Developers can integrate messaging to support uses cases such as one-time passcodes (OTP) at sign-ups, account updates, appointment reminders, delivery notifications, promotions and more.\n  Support for generative AI registration reviewer is available in all AWS Regions where End User Messaging is available, see the AWS Region table.\n  To learn more, see AWS End User Messaging.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/end-user-messaging-sms-ai-registration-reviewer/",
      "pubDate": "2025-12-23T08:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "launch",
        "preview",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-b845ed90f5bf",
      "title": "Amazon Redshift supports four new materialized view (MV) features on data shares",
      "description": "Amazon Redshift now allows you to run create MV and refresh MV commands from multiple Amazon Redshift data warehouses. This update also allows you to create an MV on shared MVs. Finally, this release now supports concurrency scaling of the create materialized view (MV) data definition language (DDL) command.\n  With this update, you can now scale the create MV DDL command whenever your main Amazon Redshift data warehouse cluster or workgroup runs out of resources simply by enabling concurrency scaling in your Amazon Redshift account.\n  You can start using these new capabilities immediately in all AWS regions where Amazon Redshift is available to scale your workload and build resilient analytics applications with predictable Service Level Agreements. To get started, refer to the Concurrency Scaling, Materialized Views and Data Sharing sections of the Amazon Redshift documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-redshift-mv-datasharing-features",
      "pubDate": "2025-12-23T08:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "redshift"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "redshift",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-d9d98940f199",
      "title": "AWS Deadline Cloud now supports direct job submission from the Deadline Cloud Monitor",
      "description": "AWS Deadline Cloud now lets you submit rendering jobs directly from the Deadline Cloud Monitor desktop application. This new feature makes it easier to submit renders for applications that don’t have built-in Deadline Cloud plugins or submission scripts, expanding compatibility with content creation tools and streamlining your rendering workflows.\n  Previously, you needed the command line interface (CLI) to submit job bundles. With this update, you can submit job bundles directly from Deadline Cloud Monitor desktop interface, managing jobs from start to finish in one place. It is particularly useful for legacy applications, specialized rendering tools, or custom workflows that lack built-in Deadline Cloud integration.\n  To access direct job submission, download the latest Deadline Cloud Monitor desktop application (version 1.1.7) in the AWS Console. To learn more about AWS Deadline Cloud job submission capabilities, see the AWS Deadline Cloud documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-deadline-cloud-direct-job-submission-from/",
      "pubDate": "2025-12-22T22:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga",
        "new-feature",
        "update",
        "integration",
        "support"
      ]
    },
    {
      "id": "aws-news-4ed9fe1d2855",
      "title": "Unifying governance and metadata across Amazon SageMaker Unified Studio and Atlan",
      "description": "In this post, we show you how to unify governance and metadata across Amazon SageMaker Unified Studio and Atlan through a comprehensive bidirectional integration. You’ll learn how to deploy the necessary AWS infrastructure, configure secure connections, and set up automated synchronization to maintain consistent metadata across both platforms.",
      "link": "https://aws.amazon.com/blogs/big-data/unifying-governance-and-metadata-across-amazon-sagemaker-unified-studio-and-atlan/",
      "pubDate": "2025-12-22T18:17:06.000Z",
      "source": "bigDataBlog",
      "services": [
        "sagemaker",
        "unified studio"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "unified studio",
        "integration"
      ]
    },
    {
      "id": "aws-news-3d60794aac8b",
      "title": "Oracle Database@AWS now supports sharing of AWS Marketplace entitlements across accounts",
      "description": "Today, Oracle Database@AWS announced ability to share AWS Marketplace entitlements across accounts within an AWS Organization. With this feature, customers can now accept an Oracle Database@AWS AWS Marketplace offer in one AWS account, and share that entitlement with additional accounts in their AWS Organization. This allows customers to consume Oracle Database@AWS services from multiple AWS accounts using a single AWS Marketplace entitlement purchased for their organization.\n  Many Oracle Database@AWS customers use separate AWS accounts for their development and production environments, and for different business units within their organization. Customers want a single buyer agreement to use Oracle Database@AWS within their organization, and use the purchased AWS Marketplace entitlement across multiple business units, and across their development and production environments. With AWS Marketplace Managed Entitlements, customers can now share their Oracle Database@AWS entitlement with other accounts in their AWS Organization using AWS License Manager console or APIs. These accounts can accept and activate their shared AWS Marketplace entitlement from AWS License Manager, and then start consuming Oracle Database@AWS services using the shared entitlement.\n  This feature is available in all AWS Regions where Oracle Database@AWS is offered. For information about managing entitlements on Oracle Database@AWS, see documentation. To learn more about Oracle Database@AWS, visit the Oracle Database@AWS product page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/oracle-database-aws-marketplace-entitlements-across-accounts/",
      "pubDate": "2025-12-22T18:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-4c08c19e99c0",
      "title": "Amazon Kinesis Video Streams now supports IPv6 for WebRTC",
      "description": "Amazon Kinesis Video Streams (Amazon KVS) now supports Internet Protocol version 6 (IPv6) addressing for WebRTC. This release introduces dual-stack endpoint support, enabling developers to use both IPv4 and IPv6 addresses to stream video from millions of devices. The dual-stack support is designed to ensure that existing IPv4 implementations continue to work reliably while gaining IPv6 connectivity benefits. Moreover, the update simplifies transition to IPv6 addresses while eliminating the need for address translation equipment.\n \nThis feature is available in all commercial AWS Regions where Amazon KVS is offered, except Asia Pacific (Singapore) and China (Beijing, operated by Sinnet). For implementation details, refer to the Amazon KVS Developer Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-kinesis-video-streams-webrtc-ipv6/",
      "pubDate": "2025-12-22T18:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "kinesis"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "kinesis",
        "ga",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-5809a9bf86f8",
      "title": "Amazon ECS Service Connect enhances observability with Envoy access logs in AWS GovCloud (US) Regions",
      "description": "Amazon Elastic Container Service (Amazon ECS) Service Connect now supports Envoy access logs, providing deeper observability into request-level traffic patterns and service interactions. This new capability captures detailed per-request telemetry for end-to-end tracing, debugging, and compliance monitoring.\n  Amazon ECS Service Connect makes it simple to build secure, resilient service-to-service communication across clusters, VPCs, and AWS accounts. It integrates service discovery and service mesh capabilities by automatically injecting AWS-managed Envoy proxies as sidecars that handle traffic routing, load balancing, and inter-service connectivity. Envoy Access logs capture detailed traffic metadata enabling request-level visibility into service communication patterns. This enables you to perform network diagnostics, troubleshoot issues efficiently, and maintain audit trails for compliance requirements.\n  You can now configure access logs within ECS Service Connect by updating the ServiceConnectConfiguration to enable access logging. Query strings are redacted by default to protect sensitive data. Envoy access logs will output to the standard output (STDOUT) stream alongside application logs and flow through the existing ECS log pipeline without requiring additional infrastructure. This configuration supports all existing application protocols (HTTP, HTTP2, GRPC and TCP). This feature is available with both Fargate and EC2 launch modes in AWS GovCloud (US-West) and AWS GovCloud (US-East) regions via the AWS Management Console, API, SDK, CLI, and CloudFormation. To learn more, visit the Amazon ECS Developer Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-ecs-service-connect-observability-envoy-access-logs-govcloud-regions",
      "pubDate": "2025-12-22T18:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2",
        "ecs",
        "fargate",
        "cloudformation"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "ec2",
        "ecs",
        "fargate",
        "cloudformation",
        "launch",
        "ga",
        "support",
        "new-capability"
      ]
    },
    {
      "id": "aws-news-f63764749e0a",
      "title": "Amazon GameLift Streams launches Gen6-based stream classes and enhanced autoscaling for better performance and pricing",
      "description": "Today, Amazon GameLift Streams launched two new capabilities to optimize performance and cost: Gen6 stream classes and enhanced autoscaling with warm buffer. The new Gen6 stream classes provide a wider range of price performance options, while autoscaling enables customers to dynamically manage capacity scaling. \n  The seven new Gen6 stream classes available today are based on EC2 G6 instances powered by NVIDIA L4 Tensor Core GPUs, which provide up to 2x higher performance over Gen4 stream classes. The pro and ultra stream class deliver improved performance for graphics-intensive AAA games, while the medium and small stream class offer cost-efficient options for casual games. The gen6n_small stream class is available at $0.16/hour in us-east-2. \n  The enhanced autoscaling capabilities provide automatic capacity management that scales provisioned capacity dynamically with demand, helping customers optimize utilization and stream start time for new players. Developers can use the new capacity controls (minimum, maximum, and target-idle capacity) to precisely manage their scaling needs. \n  New Gen6 stream classes are available in five AWS Regions: US West (Oregon), US East (Ohio), US East (N. Virginia), Europe (Frankfurt), and Asia Pacific (Tokyo). Improved autoscaling is available in all AWS Regions where Amazon GameLift Streams is offered. To learn more and get started, visit:\n AWS Docs: Gen6n based stream classes; Enhanced Autoscaling - Capacity configuration options;\n API Reference Guide: Create Stream group with gen6n based stream class; Capacity configuration option for stream groups",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-gameliftstream-gen6-enhanced-autoscaling",
      "pubDate": "2025-12-22T17:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "launch",
        "ga"
      ]
    },
    {
      "id": "aws-news-327509a9ddcd",
      "title": "Amazon GameLift Streams launches real-time performance stats and improved API error messaging",
      "description": "Today, Amazon GameLift Streams launched new powerful observability capabilities with session performance stats that provide real-time data for individual stream sessions, offering insights into application performance issues.\n \nGame developers requested deeper visibility into session performance and resource utilization. The new stats we're delivering today help developers understand how their applications perform on specific stream classes and GPUs, giving them the data to make optimal GPU selections, optimize performance, and troubleshoot individual user experiences. Developers can now access detailed data on CPU, memory, GPU, and VRAM usage for active sessions through the GameLift Streams Web SDK, or view them in the AWS console's built-in overlay on the \"Test stream\" page. These performance stats can also be exported to a file for post-session analysis.\n \nGameLift Streams also launched improved session status reasons and error messaging. Game developers now have deeper insights and actionable information on the reasons for stream session termination, enabling them to root cause unexpected termination and improve their troubleshooting experience. \n  The stream session performance stats and improved API error messaging are available in all AWS Regions where Amazon GameLift Streams is offered at no additional cost.\n  To get started with these new features, create new stream groups. To integrate session performance stats into your clients, download the updated Web SDK 1.1.0.\n  To learn more, visit:\n AWS Docs: Real-time performance stats; Export stream session files\n API Reference: Stream Session > Status Reason",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-gameliftstream-performance-stats-error-messaging",
      "pubDate": "2025-12-22T17:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "launch",
        "ga",
        "new-feature",
        "update"
      ]
    },
    {
      "id": "aws-news-3f9500e0c49a",
      "title": "Research and Engineering Studio on AWS Version 2025.12 now available",
      "description": "Today we announce Research and Engineering Studio (RES) on AWS version 2025.12, which introduces tag propagation for CloudFormation resources, enhanced Windows domain configuration options, default session scheduling, and security improvements.\n  Research and Engineering Studio on AWS is an open source solution that provides a web-based portal for administrators to create and manage secure cloud-based research and engineering environments. RES enables scientists and engineers to access powerful Windows and Linux virtual desktops with pre-installed applications and shared resources, without requiring cloud expertise.\n  Tags applied to the CloudFormation stack now propagate to all resources created during RES deployment, making it easier to track costs and manage resources across your organization. Administrators can disable automatic Windows domain joining for hosts, providing flexibility to implement custom domain-join logic when needed. You can now set a default schedule for all new desktop sessions, helping teams standardize session management practices. This version includes several security improvements to help RES deployments meet the NIST 800-223 standard and fixes a bug where some sessions were logged out after 2 minutes when using a custom DNS domain.\n  This release is available in all AWS Regions where RES is available. To learn more about RES 2025.12, including detailed release notes and deployment instructions, visit the Research and Engineering Studio documentation or check out the RES GitHub repository.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/research-engineering-studio-aws-new-version-available/",
      "pubDate": "2025-12-22T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "cloudformation"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "cloudformation",
        "ga",
        "now-available",
        "improvement"
      ]
    },
    {
      "id": "aws-news-8086b8793273",
      "title": "AWS Storage Gateway now supports Nutanix AHV hypervisor",
      "description": "The AWS Storage Gateway service now supports the Nutanix AHV hypervisor as a deployment option for S3 File, Tape and Volume gateways. If you use Nutanix AHV hypervisor-based on-premises infrastructure, you can now deploy Storage Gateway in your environment to access virtually unlimited cloud storage. \n \nNutanix AHV (Acropolis Hypervisor) is a KVM-based virtualization platform that is integrated into the Nutanix hyper-converged infrastructure (HCI) solution. With this launch, you have the option to deploy Storage Gateway on a Nutanix AHV hypervisor. \n \nStorage Gateway is a hybrid cloud storage service that provides on-premises applications access to virtually unlimited cloud storage using NFS, SMB, iSCSI, and iSCSI-VTL interfaces. You can use the service to backup and archive data to AWS, shift on-premises storage to cloud-backed file shares, and provide on-premises applications low-latency access to data in AWS. You can deploy Storage Gateway as a virtual appliance (VMware ESXi, Microsoft Hyper-V, Linux KVM, and now Nutanix) on premises or as an Amazon EC2 instance in AWS.\n \nThis capability is available in all AWS Regions. Visit the Storage Gateway User guide to learn more, or log into the Storage Gateway management console to get started.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-storage-gateway-nutanix-avh-hypervisor",
      "pubDate": "2025-12-22T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "s3",
        "ec2"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "s3",
        "ec2",
        "launch",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-c3947de50d26",
      "title": "Announcing AWS Neuron SDK 2.27.0",
      "description": "Today, AWS announces Neuron SDK 2.27.0, introducing support for Trainium3 UltraServer with expanded open source components. Neuron also introduces the Neuron Explorer tools suite, Enhanced NKI with open source NKI Compiler built on MLIR (private beta), the NKI Library of optimized kernels, native PyTorch support through TorchNeuron (private beta), and Neuron DRA for Kubernetes-native resource management (private beta).\n  These updates enable standard frameworks to run unchanged on Trainium, removing barriers for researchers to experiment and innovate. For developers requiring deeper control, the enhanced Neuron Kernel Interface (NKI) Beta 2 provides direct access to hardware-level optimizations, enabling customers to scale AI workloads with improved performance. If you're interested in early access to new NKI features and improvements, you can join the Neuron private beta program.\n  The new SDK version is available in all AWS Regions supporting Inferentia and Trainium instances, offering enhanced performance and monitoring capabilities for machine learning workloads.\n  For more details, see:\n  \n \n \nWhat’s New in Neuron\n \n \nAWS Neuron 2.27.0 Release Notes\n \n \nAWS Trainium",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/announcing-aws-neuron-2-27",
      "pubDate": "2025-12-22T08:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "nova",
        "trainium",
        "trainium3",
        "inferentia",
        "neuron"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "nova",
        "trainium",
        "trainium3",
        "inferentia",
        "neuron",
        "beta",
        "early-access",
        "update",
        "improvement",
        "support"
      ]
    },
    {
      "id": "aws-news-aa43fee640a7",
      "title": "AWS Wickr launches admin APIs for programmatic network management at scale",
      "description": "AWS Wickr now provides a suite of admin APIs that empower administrators to programmatically manage secure communication networks at scale. These APIs enable you to automate critical administrative workflows including user lifecycle management, network configuration, and security group administration. With user lifecycle management APIs, you can automatically create users and assign security groups when employees join, or deactivate accounts when they leave. Network configuration APIs allow you to quickly create or delete networks on demand as your organization scales or restructures, and push standardized retention and federation policies across departments. Security group administration APIs enable automatic user placement based on directory attributes such as job function or clearance level. By connecting Wickr administration directly into your identity management systems, policy management frameworks, and automation pipelines, you can now manage secure communications infrastructure across thousands of users alongside your other cloud service integrations.\n \n\n AWS Wickr is a security-first messaging and collaboration service designed to help keep your communications secure, private, and compliant. AWS Wickr protects messaging, voice and video calling, file sharing, screen sharing, and location sharing with end-to-end encryption. Customers have full administrative control over data and users, including single sign-on (SSO) integration. Administrators can enforce policies that set password complexity and retention rules, configure ephemeral messaging options, or remotely delete credentials. You can log conversations to a private data store so you can retain messages and files sent to and from the organization to meet compliance requirements.\n  The AWS Wickr Admin APIs are available today in all AWS regions where AWS Wickr is currently supported, including AWS GovCloud (US-West). You can leverage these APIs through AWS SDKs, the AWS Command Line Interface (AWS CLI), or direct REST API calls. To learn more, see:\n \n \n \nAWS Wickr API Reference\n \n \nAWS Wickr Product Page\n \n \nAWS Wickr Administrator Guide",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-wickr-admin-apis-generally-available/",
      "pubDate": "2025-12-22T08:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "lex",
        "launch",
        "ga",
        "integration",
        "support"
      ]
    },
    {
      "id": "aws-news-8c511f1294ca",
      "title": "Amazon Application Recovery Controller region switch now supports three new capabilities",
      "description": "Amazon Application Recovery Controller (ARC) Region switch allows you to orchestrate the specific steps to switch your multi-Region applications to operate out of another AWS Region and achieve a bounded recovery time in the event of a Regional impairment to your applications. Region switch saves hours of engineering effort and eliminates the operational overhead previously required to complete failover steps, create custom dashboards, and manually gather evidence of a successful recovery for applications across your organization and hosted in multiple AWS accounts. Today, we are announcing three new Region switch capabilities:\n  AWS GovCloud (US) support: ARC Region switch is now generally available in AWS GovCloud (US-East and US-West) Regions.\n  Plan execution reports: Region switch now automatically generates a comprehensive report from each plan execution and saves it to an Amazon S3 bucket of your choice. Each report includes a detailed timeline of events for the recovery operation, resources in scope for the Region switch, alarm states for optional application status alarms, and recovery time objective (RTO) calculations. This eliminates the manual effort previously required to compile evidence and documentation for compliance officers and auditors.\n  DocumentDB global cluster execution blocks: Adding to the catalog of 9 execution blocks, Region switch now supports Amazon DocumentDB global cluster execution blocks for automated multi-Region database recovery. This feature allows you to orchestrate DocumentDB global cluster failover and switchover operations within your Region switch plans.\n  To get started, build a Region switch plan using the ARC console, API, or CLI. See the AWS Regional Services List for availability information. Visit our home page or read the documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-application-recovery-controller-region-switch-new-capabilities",
      "pubDate": "2025-12-19T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "s3",
        "rds"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "s3",
        "rds",
        "generally-available",
        "ga",
        "support",
        "new-region"
      ]
    },
    {
      "id": "aws-news-f8144c2c06b1",
      "title": "AWS Private CA OCSP now available in China and AWS GovCloud (US) Regions",
      "description": "AWS Private Certificate Authority (AWS Private CA) now supports Online Certificate Status Protocol (OCSP) in China and AWS GovCloud (US) Regions. AWS Private CA is a fully managed certificate authority service that makes it easy to create and manage private certificates for your organization without the operational overhead of running your own CA infrastructure. OCSP enables real-time certificate validation, allowing applications to check the revocation status of individual certificates on-demand rather than downloading Certificate Revocation List (CRL) files.\n  With OCSP support, customers in these Regions can implement more efficient certificate validation with minimal bandwidth, typically requiring a few hundred bytes per query, versus downloading large Certificate Revocation Lists (CRLs) that can be hundreds of kilobytes or larger. This enables real-time revocation checks for use cases such as validating internal microservices communications, implementing zero trust security architectures, and authenticating IoT devices. AWS Private CA fully manages the OCSP responder infrastructure, providing high availability without requiring you to deploy or maintain OCSP servers.\n  OCSP is now also available in the following AWS Regions: China (Beijing), and China (Ningxia), AWS GovCloud (US-East), AWS GovCloud (US-West).\n  To enable OCSP for your certificate authorities, use the AWS Private CA console, AWS CLI, or API. To learn more about OCSP, see Certificate Revocation in the AWS Private CA User Guide. For pricing information, visit the AWS Private CA pricing page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-private-ca-ocsp-china-govcloud-us-regions",
      "pubDate": "2025-12-19T15:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-ca2965bf0697",
      "title": "Amazon SageMaker Studio now supports SOCI indexing for faster container startup times",
      "description": "Today, AWS announces SOCI (Seekable Open Container Initiative) indexing support for Amazon SageMaker Studio, reducing container startup times by 30-50% when using custom images. Amazon SageMaker Studio is a fully integrated, browser-based environment for end-to-end machine learning development. SageMaker Studio provides pre-built container images for popular ML frameworks like TensorFlow, PyTorch, and Scikit-learn that enable quick environment setup. However, when data scientists need to tailor environments for specific use cases with additional libraries, dependencies, or configurations, they can build and register custom container images with pre-configured components to ensure consistency across projects. As ML workloads become increasingly complex, these custom container images have grown in size, leading to startup times of several minutes that create a bottlenecks in iterative ML development where quick experimentation and rapid prototyping are essential.\n  SOCI indexing addresses this challenge by enabling lazy loading of container images, downloading only the necessary components to start applications with additional files loaded on-demand as needed. Instead of waiting several minutes for complete custom image downloads, users can begin productive work in seconds while the environment completes initialization in the background. To use SOCI indexing, create a SOCI index for your custom container image using tools like Finch CLI, nerdctl, or Docker with SOCI CLI, push the indexed image to Amazon Elastic Container Registry (ECR), and reference the image index URI when creating SageMaker Image resources.\n  SOCI indexing is available in all AWS Regions where Amazon SageMaker Studio is available. To learn more about implementing SOCI indexing for your SageMaker Studio custom images, see Bring your own SageMaker image in the Amazon SageMaker Developer Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-sagemaker-nbi-soci/",
      "pubDate": "2025-12-19T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "sagemaker",
        "lex"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "lex",
        "support"
      ]
    },
    {
      "id": "aws-news-73dbb6d83e19",
      "title": "Amazon RDS enhances observability for snapshot exports to Amazon S3",
      "description": "Amazon Relational Database Service (RDS) now offers enhanced observability for your snapshot exports to Amazon S3, providing detailed insights into export progress, failures, and performance for each task. These notifications enable you to monitor your exports with greater granularity and enables more predictability.\n  With snapshot export to S3, you can export data from your RDS database snapshots to Apache Parquet format in your Amazon S3 bucket. This launch introduces four new event types, including current export progress and table-level notifications for long-running tables, providing more granular visibility into your snapshot export performance and recommendations for troubleshooting export operation issues. Additionally, you can view export progress, such as the number of tables exported and pending, along with exported data sizes, enabling you to better plan your operations and workflows. You can subscribe to these events through Amazon Simple Notification Service (SNS) to receive notifications and view the export events through the AWS Management Console, AWS CLI, or SDK.\n  This feature is available for RDS PostgreSQL, RDS MySQL, and RDS MariaDB engines in all Commercial Regions where RDS is generally available.\n  To learn more about the new event types, see Event categories in RDS.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-rds-observability-snapshot-exports-s3",
      "pubDate": "2025-12-19T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "s3",
        "rds",
        "sns"
      ],
      "categories": [
        "ai-services"
      ],
      "tags": [
        "s3",
        "rds",
        "sns",
        "launch",
        "generally-available"
      ]
    },
    {
      "id": "aws-news-28e135e2892d",
      "title": "Amazon Bedrock Data Automation launches instruction optimization for your document blueprints",
      "description": "Amazon Bedrock Data Automation (BDA) now supports blueprint instruction optimization, enabling you to improve the accuracy of your custom field extraction using just a few example document assets with ground truth labels. BDA automates the generation of insights from unstructured multimodal content such as documents, images, audio, and videos for your GenAI-powered applications. Blueprint instruction optimization automatically refines the natural language instructions in your blueprints, helping you achieve production-ready accuracy in minutes without model training or fine-tuning.\n  With blueprint instruction optimization, you can now bring up to 10 representative document assets from your production workload and provide the correct, expected values for each field. Blueprint instruction optimization analyzes the differences between your expected results and the Data Automation inference results, and then refines the natural language instructions to improve extraction accuracy across your examples. For your intelligent document processing applications, you can now improve the accuracy of extracting insights such as invoice line items, contract terms, tax form fields, or medical billing codes. After optimization completes, you receive detailed evaluation metrics including exact match rates and F1 scores measured against your ground truth, giving you confidence that your blueprint is ready for production deployment. \n  Data Automation blueprint instruction optimization for documents is available in all AWS Regions where Amazon Bedrock Data Automation is supported. \n  To learn more, see the Bedrock Data Automation User Guide and the Amazon Bedrock Pricing page. To get started with blueprint instruction optimization, navigate to your blueprint in the Amazon Bedrock console, go to Data Automation, select your custom outputs for documents, and select Start Optimization.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/bedrock-data-automation-optimization-document-blueprints/",
      "pubDate": "2025-12-19T08:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "bedrock"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "bedrock",
        "launch",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-402c34065845",
      "title": "Amazon ECR now supports creating repositories on push",
      "description": "Amazon Elastic Container Registry (ECR) now supports automatic repository creation on image push. This new capability simplifies container workflows by having ECR automatically create repositories if they don't exist when an image is pushed, without customers having to pre-create repositories before pushing container images. Now when customers push images, ECR will automatically create repositories according to defined repository creation template settings.\n  Create on push is available in all AWS commercial and AWS GovCloud (US) Regions. To learn more about repository creation templates, please visit our documentation. You can learn more about storing, managing and deploying container images and artifacts with Amazon ECR, including how to get started, from our product page and user guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-ecr-creating-repositories-on-push/",
      "pubDate": "2025-12-19T08:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "support",
        "new-capability"
      ]
    },
    {
      "id": "aws-news-d12abd08a1b9",
      "title": "Timestream for InfluxDB Now Supports Restart API Calls",
      "description": "Amazon Timestream for InfluxDB now offers a restart API for both InfluxDB versions 2 and 3. This new capability enables customers to trigger system restarts on their database instances directly through the AWS Management Console, API, or CLI, to streamline operational management of their time-series database environments.\n  With the restart API, customers can perform resilience testing to validate their application's behavior during database restarts and address health-related issues without requiring support intervention. This feature enhances operational flexibility for DevOps teams managing mission-critical workloads, allowing them to implement more comprehensive testing strategies and respond faster to performance concerns by providing direct control over database instance lifecycle operations.\n  Amazon Timestream for InfluxDB restart capability is available in all Regions where Timestream for InfluxDB is offered.\n  To get started with Amazon Timestream for InfluxDB 3, visit the Amazon Timestream for InfluxDB console. For more information, see the Amazon Timestream for InfluxDB documentation and pricing page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/timestream-influxdb-restart-api",
      "pubDate": "2025-12-19T08:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "support",
        "new-capability"
      ]
    },
    {
      "id": "aws-news-3a0b23aaaa74",
      "title": "Announcing Cost Allocation Tags support for Account Tags",
      "description": "AWS announces Cost Allocation tags support for account tags across AWS Cost Management products, enabling customers with multiple member accounts to utilize their existing AWS Organizations account tags directly in cost management tools. Account tags are applied at the account level in AWS Organizations and automatically apply to all metered usage within tagged accounts, eliminating the need to manually configure and maintain separate account groupings in AWS Cost Explorer, Cost and Usage Reports, AWS Budgets, and Cost Categories.\n  With account tag support, customers can analyze costs by account tag directly in Cost Explorer and Cost and Usage Reports (CUR 2.0 and FOCUS). Customers can set up AWS Budgets and AWS Cost Anomaly Detection alerts on groups of accounts without configuring lists of account IDs. Customers can also build complex cost categories on top of account tags for further categorization. Account tags enable cost allocation for untaggable resources including refunds, credits, and certain service charges that cannot be tagged at the resource level. When new accounts join the organization or existing accounts are removed, customers simply add or update relevant tags, and the changes automatically apply across all cost management products. To get started, customers apply tags to accounts in the AWS Organizations console, then activate those account tags from the Cost Allocation Tags page in the Billing and Cost Management console. This feature is generally available in all AWS Regions, excluding GovCloud (US) Regions and China (Beijing) and China (Ningxia) Regions.\n  To learn more, see organizing and tracking costs using AWS cost allocation tags.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/cost-allocation-tags/",
      "pubDate": "2025-12-19T08:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "lex",
        "organizations",
        "generally-available",
        "ga",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-243488f6776c",
      "title": "AWS IoT now offers event-based logging to help optimize observability costs",
      "description": "AWS IoT now supports event-based logging, a new capability that helps developers reduce Amazon CloudWatch costs while improving log management efficiency. This feature enables targeted logging for individual event with customizable log levels and Amazon CloudWatch log group destinations.\n With Event-Based Logging, you can set different log levels for different types of IoT events based on their operational importance. For example, you can configure INFO-level logging for certificateProvider events while maintaining ERROR-level logging for less critical activities like connectivity events. The granularity allows you to maintain comprehensive visibility into your IoT operations without the overhead of logging every activity at the same verbosity level, improving log searchability and analysis efficiency while helping to reducing costs.\n Event-level logging is now available for configuration through the AWS IoT console, CLI, and API in all AWS Regions where AWS IoT is supported. To learn more about configuring Event-Based Logging, visit AWS IoT Developer Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-iot-event-based-logging/",
      "pubDate": "2025-12-19T08:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "cloudwatch"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "cloudwatch",
        "now-available",
        "support",
        "new-capability"
      ]
    },
    {
      "id": "aws-news-0033ccedae59",
      "title": "Amazon WorkSpaces Applications now supports Microsoft Windows Server 2025",
      "description": "Amazon WorkSpaces Applications now offers images powered by Microsoft Windows Server 2025, enabling customers to launch streaming instances with the latest features and enhancements from Microsoft’s newest server operating system. This update ensures your application streaming environment benefits from improved security, performance, and modern capabilities.\n  With Windows Server 2025 support, you can deliver the Microsoft Windows 11 desktop experience to your end users, giving you greater flexibility in choosing the right operating system for your specific application and desktop streaming needs. Whether you're running business-critical applications or providing remote access to specialized software, you now have expanded options to align your infrastructure decisions with your unique workload requirements and organizational standards. You can select from AWS-provided public images or create custom images tailored to your requirements using Image Builder.\n  Support for Microsoft Windows Server 2025 is now generally available in all AWS Regions where Amazon WorkSpaces Applications is offered.\n  To get started with Microsoft Windows Server 2025 images, visit the Amazon WorkSpaces Applications documentation. For pricing details, see the Amazon WorkSpaces Applications Pricing page.",
      "link": "https://aws.amazon.comabout-aws/whats-new/2025/12/amazon-workspaces-applications-supports-microsoft-windows-server",
      "pubDate": "2025-12-19T08:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "rds"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "rds",
        "launch",
        "generally-available",
        "ga",
        "update",
        "enhancement",
        "support"
      ]
    },
    {
      "id": "aws-news-562047d8451c",
      "title": "Amazon Redshift ODBC 2.x Driver now supports Apple macOS",
      "description": "Amazon Redshift ODBC 2.x driver now supports Apple macOS, expanding platform compatibility for developers and analysts. This enhancement allows Apple macOS users to connect to Amazon Redshift clusters using the latest Amazon Redshift ODBC 2.x driver version. You can use an ODBC connection to connect to your Amazon Redshift cluster from many third-party SQL client tools and applications.\n  The Amazon Redshift ODBC 2.x native driver support enables you to access Amazon Redshift features such as data sharing write capabilities and Amazon IAM Identity Center integration - features that are only available through Amazon Redshift drivers. This native Apple macOS support enables seamless integration with Extract, Transform, Load (ETL) and Business Intelligence (BI) tools, allowing you to use Apple macOS while accessing the full suite of Amazon Redshift capabilities.\n  We recommend that you upgrade to the latest Amazon Redshift ODBC 2.x driver version to access new features. For installation instructions and system requirements, please see the Amazon Redshift ODBC 2.x driver documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/redshift-odbc-2-x-driver-apple-macos/",
      "pubDate": "2025-12-19T08:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "redshift",
        "iam",
        "iam identity center"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "redshift",
        "iam",
        "iam identity center",
        "new-feature",
        "enhancement",
        "integration",
        "support"
      ]
    },
    {
      "id": "aws-news-4e10ab4845c1",
      "title": "Zero-ETL for self-managed Database Sources now available in 7 new regions",
      "description": "AWS Glue now supports zero-ETL for self-managed database sources in seven additional regions. Using Glue zero-ETL, you can setup an integration to replicate data from Oracle, SQL Server, MySQL or PostgreSQL databases which are located on-premises or on AWS EC2 to Redshift with a simple experience that eliminates configuration complexity.\n  AWS zero-ETL for self-managed database sources will automatically create an integration for an on-going replication of data from your on-premises or EC2 databases through a simple, no-code interface. You can now replicate data from Oracle, SQL Server, MySQL and PostgreSQL databases into Redshift. This feature further reduces users' operational burden and saves weeks of engineering effort needed to design, build, and test data pipelines to ingest data from self-managed databases to Redshift. \n  AWS Glue zero-ETL for self-managed database sources are available in the following additional AWS Regions: Asia Pacific (Hong Kong), Asia Pacific (Tokyo), Asia Pacific (Singapore), Asia Pacific (Sydney), Europe (London), South America (São Paulo), and US (Virginia) regions. To get started, sign into the AWS Management Console. For more information visit the AWS Glue page or review the AWS Glue zero-ETL documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/zero-etl-for-self-managed-databases-in-additional-regions",
      "pubDate": "2025-12-19T08:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "ec2",
        "redshift",
        "eks",
        "glue"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "ec2",
        "redshift",
        "eks",
        "glue",
        "ga",
        "now-available",
        "integration",
        "support",
        "new-region"
      ]
    },
    {
      "id": "aws-news-e8f26776387b",
      "title": "Modernize Apache Spark workflows using Spark Connect on Amazon EMR on Amazon EC2",
      "description": "In this post, we demonstrate how to implement Apache Spark Connect on Amazon EMR on Amazon Elastic Compute Cloud (Amazon EC2) to build decoupled data processing applications. We show how to set up and configure Spark Connect securely, so you can develop and test Spark applications locally while executing them on remote Amazon EMR clusters.",
      "link": "https://aws.amazon.com/blogs/big-data/modernize-apache-spark-workflows-using-spark-connect-on-amazon-emr-on-amazon-ec2/",
      "pubDate": "2025-12-18T21:29:47.000Z",
      "source": "bigDataBlog",
      "services": [
        "ec2",
        "emr"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "ec2",
        "emr"
      ]
    },
    {
      "id": "aws-news-12f51c5b7c59",
      "title": "How Taxbit achieved cost savings and faster processing times using Amazon S3 Tables",
      "description": "In this post, we discuss how Taxbit partnered with Amazon Web Services (AWS) to streamline their crypto tax analytics solution using Amazon S3 Tables, achieving 82% cost savings and five times faster processing times.",
      "link": "https://aws.amazon.com/blogs/big-data/how-taxbit-achieved-cost-savings-and-faster-processing-times-using-amazon-s3-tables/",
      "pubDate": "2025-12-18T21:27:55.000Z",
      "source": "bigDataBlog",
      "services": [
        "s3"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "s3"
      ]
    },
    {
      "id": "aws-news-c6a3ef07c40b",
      "title": "Amazon EC2 now supports Availability Zone ID across its APIs",
      "description": "Amazon EC2 now supports Availability Zone ID (AZ ID) parameter, enabling you to create and manage resources such as instances, volumes, and subnets using consistent zone identifiers. AZ IDs are consistent and static identifiers that represent the same physical location across all AWS accounts, helping you optimize resource placement.\n  Prior to this launch, you had to use an AZ name while creating a resource, but these names could map to different physical locations. This mapping made it difficult to ensure resources were always co-located especially when operating with multiple accounts. Now, you can specify the AZ ID parameter directly in your EC2 APIs to guarantee consistent placement of resources. AZ IDs always refer to the same physical location across all accounts, which means you no longer need to manually map AZ names across your accounts or deal with the complexity of tracking and aligning zones. This capability is now available for resources including instances, launch templates, hosts, reserved instances, fleet, spot instances, volumes, capacity reservations, network insights, VPC endpoints and subnets, network interfaces, fast snapshot restore, and instance connect.\n  This feature is available in all AWS regions including China and AWS GovCloud (US) Regions. To learn more about Availability Zone IDs, visit the documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-ec2-az-id-api-support",
      "pubDate": "2025-12-18T20:55:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "ec2"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "ec2",
        "launch",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-c694bd28e528",
      "title": "Amazon WorkSpaces Applications announces Elastic fleets powered by Ubuntu Pro 24.04 LTS",
      "description": "Amazon WorkSpaces Applications now offers support for Ubuntu Pro 24.04 LTS on Elastic fleets, enabling Independent Software Vendors (ISVs) and central IT organizations to stream Ubuntu desktop applications to users while leveraging the flexibility, scalability, and cost-effectiveness of the AWS Cloud.\n  Amazon WorkSpaces Applications is a fully managed, secure desktops and applications streaming service that provides users with instant access to their desktops and applications from anywhere. Within Amazon WorkSpaces Applications, Elastic fleet is a server less fleet type that lets you stream desktop applications to your end users from an AWS-managed pool of streaming instances without needing to predict usage, create and manage scaling policies, or create an image. Elastic fleet type is designed for customers that want to stream applications to users without managing any capacity or creating WorkSpaces Applications images.\n  To get started sign into the WorkSpaces Applications management console and select one of the AWS Region of your choice. For the full list of Regions where WorkSpaces Applications is available, see the AWS Region Table. Amazon WorkSpaces Applications offers pay-as-you-go pricing. For more information, see Amazon WorkSpaces Applications Pricing.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-workspaces-ubuntu-elasticfleets",
      "pubDate": "2025-12-18T16:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "lex",
        "organizations",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-556f1b441553",
      "title": "Amazon EC2 C8a instances now available in the Europe (Spain) region",
      "description": "Starting today, the compute-optimized Amazon EC2 C8a instances are available in the Europe (Spain) region. C8a instances are powered by 5th Gen AMD EPYC processors (formerly code named Turin) with a maximum frequency of 4.5 GHz, delivering up to 30% higher performance and up to 19% better price-performance compared to C7a instances.\n  C8a instances deliver 33% more memory bandwidth compared to C7a instances, making these instances ideal for latency sensitive workloads. Compared to Amazon EC2 C7a instances, they are up to 57% faster for GroovyJVM allowing better response times for Java-based applications. C8a instances offer 12 sizes including 2 bare metal sizes. This range of instance sizes allows customers to precisely match their workload requirements.\n  C8a instances are built on AWS Nitro System and are ideal for high performance, compute-intensive workloads such as batch processing, distributed analytics, high performance computing (HPC), ad serving, highly-scalable multiplayer gaming, and video encoding.\n  To get started, sign in to the AWS Management Console. Customers can purchase these instances via Savings Plans, On-Demand instances, and Spot instances. For more information visit the Amazon EC2 C8a instance page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-ec2-c8a-instances-europe-spain-region",
      "pubDate": "2025-12-18T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "ga",
        "now-available"
      ]
    },
    {
      "id": "aws-news-0ee5b059a928",
      "title": "AWS IoT Core adds message batching to HTTP rule action",
      "description": "AWS IoT Core now lets you batch multiple IoT messages into a single HTTP rule action, before routing the messages to downstream HTTP endpoints. This enhancement helps you to reduce cost and throughput overhead when ingesting telemetry from your Internet of Things (IoT) workloads.\n  AWS IoT Core is a fully managed service that securely connects millions of IoT devices to the AWS cloud. Using rules for AWS IoT, you can filter, process, and decode device data, and route that data to AWS services or third-party endpoints via 20+ AWS IoT rule actions, such as HTTP rule action - which routes the data to HTTP endpoints. With the new feature, you can now batch messages together before routing that data set to downstream HTTP endpoints.\n  To efficiently process IoT messages using the new batching capability, connect your IoT devices to AWS IoT Core and define a HTTP rule action with your desired batch parameters. AWS IoT Core will then process incoming messages according to these specifications and route the messages to your designated HTTP endpoints. For example, you can now combine IoT messages published from multiple smart home devices in a single batch and route it to a HTTP endpoint in your smart home platform.\n  This new feature is available in all AWS Regions where AWS IoT Core is available, including AWS GovCloud (US) and Amazon China Regions. To learn more, visit our developer guide, pricing page, and API documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-iot-core-message-batching-http-rule-action",
      "pubDate": "2025-12-18T15:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "new-feature",
        "enhancement"
      ]
    },
    {
      "id": "aws-news-6a6ccca45535",
      "title": "Amazon WorkSpaces now supports IPv6",
      "description": "Amazon WorkSpaces now supports IPv6 for WorkSpaces domains and external endpoints, enabling users to connect through an IPv4/IPv6 dual-stack configuration from compatible clients (excluding SAML authentication). This helps customers meet IPv6 compliance requirements and eliminates the need for costly networking equipment to handle address translation between IPv4 and IPv6.\n  Dual-stack support for WorkSpaces addresses the Internet's growing demand for IP addresses by offering a vastly larger address space than IPv4. This eliminates the need to manage overlapping address ranges within your Virtual Private Cloud (VPC). Customers can deploy WorkSpaces through dual-stack that supports both IPv4 and IPv6 protocols while maintaining backward compatibility with existing IPv4 systems. Customers can also connect to their WorkSpaces through PrivateLink VPC endpoints over IPv6, enabling them to access the service privately without routing traffic over the public internet.\n  Connecting to Amazon WorkSpaces over IPv4/IPv6 dual-stack configuration is supported in all AWS Regions where Amazon WorkSpaces is available, including the AWS GovCloud (US East & US West) Regions. There is no additional cost for this feature.\n  To enable IPv6, you must use the latest WorkSpaces client application for Windows, macOS, Linux, PCoIP zero clients, or web access. To learn more about IPv6 support on Amazon WorkSpaces, refer to the Amazon WorkSpaces administration guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-workspaces-ipv6/",
      "pubDate": "2025-12-18T15:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "support"
      ]
    },
    {
      "id": "aws-news-4911a42f92d4",
      "title": "Power data ingestion into Splunk using Amazon Data Firehose",
      "description": "With Kinesis Data Firehose, customers can use a fully managed, reliable, and scalable data streaming solution to Splunk. In this post, we tell you a bit more about the Kinesis Data Firehose and Splunk integration. We also show you how to ingest large amounts of data into Splunk using Kinesis Data Firehose.",
      "link": "https://aws.amazon.com/blogs/big-data/power-data-ingestion-into-splunk-using-amazon-data-firehose/",
      "pubDate": "2025-12-17T18:52:29.000Z",
      "source": "bigDataBlog",
      "services": [
        "kinesis"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "kinesis",
        "integration"
      ]
    },
    {
      "id": "aws-news-93e908d04930",
      "title": "AWS Weekly Roundup: Amazon ECS, Amazon CloudWatch, Amazon Cognito and more (December 15, 2025)",
      "description": "Can you believe it? We’re nearly at the end of 2025. And what a year it’s been! From re:Invent recap events, to AWS Summits, AWS Innovate, AWS re:Inforce, Community Days, and DevDays and, recently, adding that cherry on the cake, re:Invent 2025, we have lived through a year filled with exciting moments and technology advancements […]",
      "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-amazon-ecs-amazon-cloudwatch-amazon-cognito-and-more-december-15-2025/",
      "pubDate": "2025-12-15T16:42:05.000Z",
      "source": "newsBlog",
      "services": [
        "nova",
        "ecs",
        "cloudwatch"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "nova",
        "ecs",
        "cloudwatch"
      ]
    },
    {
      "id": "aws-news-36722fddcb63",
      "title": "Building zero trust generative AI applications in healthcare with AWS Nitro Enclaves",
      "description": "In healthcare, generative AI is transforming how \nmedical professionals analyze data, \nsummarize clinical notes, and \ngenerate insights to improve patient outcomes. From \nautomating medical documentation to assisting in \ndiagnostic reasoning, large language models (LLMs) have the potential to augment clinical workflows and accelerate research. However, these innovations also introduce significant privacy, security, and intellectual property challenges.",
      "link": "https://aws.amazon.com/blogs/compute/building-zero-trust-generative-ai-applications-in-healthcare-with-aws-nitro-enclaves/",
      "pubDate": "2025-12-12T19:06:03.000Z",
      "source": "computeBlog",
      "services": [
        "nova"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "nova"
      ]
    },
    {
      "id": "aws-news-b56aaf668b93",
      "title": "Architecting conversational observability for cloud applications",
      "description": "In this post, we walk through building a generative AI–powered troubleshooting assistant for Kubernetes. The goal is to give engineers a faster, self-service way to diagnose and resolve cluster issues, cut down Mean Time to Recovery (MTTR), and reduce the cycles experts spend finding the root cause of issues in complex distributed systems.",
      "link": "https://aws.amazon.com/blogs/architecture/architecting-conversational-observability-for-cloud-applications/",
      "pubDate": "2025-12-11T15:59:39.000Z",
      "source": "architectureBlog",
      "services": [
        "lex"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "lex"
      ]
    },
    {
      "id": "aws-news-30581ecb3d79",
      "title": "How BASF’s Agriculture Solutions drives traceability and climate action by tokenizing cotton value chains using Amazon Managed Blockchain",
      "description": "BASF Agricultural Solutions combines innovative products and digital tools with practical farmer knowledge. This post explores how Amazon Managed Blockchain can drive a positive change in the agricultural industry by tokenizing food and cotton value chains for traceability, climate action, and circularity.",
      "link": "https://aws.amazon.com/blogs/architecture/how-basfs-agriculture-solutions-drives-traceability-and-climate-action-by-tokenizing-cotton-value-chains-using-amazon-managed-blockchain/",
      "pubDate": "2025-12-10T17:41:52.000Z",
      "source": "architectureBlog",
      "services": [
        "nova"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "nova"
      ]
    },
    {
      "id": "aws-news-c8a3488015cc",
      "title": "AWS SDK for JavaScript aligns with Node.js release schedule",
      "description": "This post is about AWS SDK for JavaScript v3 announcing end of support for Node.js versions based on Node.js release schedule, and it is not about AWS Lambda. For the latter, refer to the Lambda runtime deprecation policy. In the second week of January 2026, the AWS SDK for JavaScript v3 (JS SDK) will start […]",
      "link": "https://aws.amazon.com/blogs/developer/aws-sdk-for-javascript-aligns-with-node-js-release-schedule/",
      "pubDate": "2025-12-08T17:32:10.000Z",
      "source": "developersAndDevOps",
      "services": [
        "lambda"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "lambda",
        "support"
      ]
    },
    {
      "id": "aws-news-632e1959900f",
      "title": "AWS Weekly Roundup: AWS re:Invent keynote recap, on-demand videos, and more (December 8, 2025)",
      "description": "The week after AWS re:Invent builds on the excitement and energy of the event and is a good time to learn more and understand how the recent announcements can help you solve your challenges and unlock new opportunities. As usual, we have you covered with our top announcements of AWS re:Invent 2025 that you can […]",
      "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-aws-reinvent-keynote-recap-on-demand-videos-and-more-december-8-2025/",
      "pubDate": "2025-12-08T17:05:29.000Z",
      "source": "newsBlog",
      "services": [],
      "categories": [
        "news"
      ],
      "tags": [
        "announcement"
      ]
    },
    {
      "id": "aws-news-f8633d530b1e",
      "title": "She architects: Bringing unique perspectives to innovative solutions at AWS",
      "description": "Have you ever wondered what it is really like to be a woman in tech at one of the world's leading cloud companies? Or maybe you are curious about how diverse perspectives drive innovation beyond the buzzwords? Today, we are providing an insider's perspective on the role of a solutions architect (SA) at Amazon Web Services (AWS). However, this is not a typical corporate success story. We are three women who have navigated challenges, celebrated wins, and found our unique paths in the world of cloud architecture, and we want to share our real stories with you.",
      "link": "https://aws.amazon.com/blogs/architecture/she-architects-bringing-unique-perspectives-to-innovative-solutions-at-aws/",
      "pubDate": "2025-12-08T16:37:15.000Z",
      "source": "architectureBlog",
      "services": [
        "nova",
        "rds"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "nova",
        "rds",
        "ga"
      ]
    },
    {
      "id": "aws-news-ad98b700a350",
      "title": "Amazon Bedrock adds reinforcement ﬁne-tuning simplifying how developers build smarter, more accurate AI models",
      "description": "Amazon Bedrock now supports reinforcement fine-tuning delivering 66% accuracy gains on average over base models.",
      "link": "https://aws.amazon.com/blogs/aws/improve-model-accuracy-with-reinforcement-fine-tuning-in-amazon-bedrock/",
      "pubDate": "2025-12-03T16:08:14.000Z",
      "source": "newsBlog",
      "services": [
        "bedrock"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "bedrock",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-f27f0877e40c",
      "title": "New serverless customization in Amazon SageMaker AI accelerates model fine-tuning",
      "description": "Accelerate AI model development with new training features that enable rapid recovery from failures and automatic scaling based on resource availability.",
      "link": "https://aws.amazon.com/blogs/aws/new-serverless-customization-in-amazon-sagemaker-ai-accelerates-model-fine-tuning/",
      "pubDate": "2025-12-03T16:08:03.000Z",
      "source": "newsBlog",
      "services": [
        "sagemaker"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "sagemaker"
      ]
    },
    {
      "id": "aws-news-20b1f9fc07df",
      "title": "Introducing checkpointless and elastic training on Amazon SageMaker HyperPod",
      "description": "Accelerate AI model development with new training features that enable instant recovery from failures and automatic scaling based on resource availability.",
      "link": "https://aws.amazon.com/blogs/aws/introducing-checkpointless-and-elastic-training-on-amazon-sagemaker-hyperpod/",
      "pubDate": "2025-12-03T16:07:52.000Z",
      "source": "newsBlog",
      "services": [
        "sagemaker",
        "hyperpod"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "sagemaker",
        "hyperpod"
      ]
    },
    {
      "id": "aws-news-4139ea9a5e0b",
      "title": "Announcing replication support and Intelligent-Tiering for Amazon S3 Tables",
      "description": "New features enable automatic cost optimization through intelligent storage tiering and simplified table replication across AWS Regions and accounts.",
      "link": "https://aws.amazon.com/blogs/aws/announcing-replication-support-and-intelligent-tiering-for-amazon-s3-tables/",
      "pubDate": "2025-12-02T16:19:14.000Z",
      "source": "newsBlog",
      "services": [
        "s3"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "s3",
        "new-feature",
        "support"
      ]
    },
    {
      "id": "aws-news-64738829059d",
      "title": "Amazon S3 Storage Lens adds performance metrics, support for billions of prefixes, and export to S3 Tables",
      "description": "New capabilities help optimize application performance, analyze unlimited prefixes, and simplify metrics analysis through S3 Tables integration.",
      "link": "https://aws.amazon.com/blogs/aws/amazon-s3-storage-lens-adds-performance-metrics-support-for-billions-of-prefixes-and-export-to-s3-tables/",
      "pubDate": "2025-12-02T16:15:12.000Z",
      "source": "newsBlog",
      "services": [
        "s3"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "s3",
        "integration",
        "support"
      ]
    },
    {
      "id": "aws-news-17e673125d4d",
      "title": "Amazon Bedrock AgentCore adds quality evaluations and policy controls for deploying trusted AI agents",
      "description": "Deploy AI agents with confidence using new quality evaluations and policy controls—enabling precise boundaries on agent actions, continuous quality monitoring, and experience-based learning while maintaining natural conversation flows.",
      "link": "https://aws.amazon.com/blogs/aws/amazon-bedrock-agentcore-adds-quality-evaluations-and-policy-controls-for-deploying-trusted-ai-agents/",
      "pubDate": "2025-12-02T16:14:36.000Z",
      "source": "newsBlog",
      "services": [
        "bedrock",
        "agentcore"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "bedrock",
        "agentcore"
      ]
    },
    {
      "id": "aws-news-c6bdf0af2db1",
      "title": "Build multi-step applications and AI workflows with AWS Lambda durable functions",
      "description": "New Lambda capability lets you build applications that coordinate multiple steps reliably over extended periods—from seconds to up to one year—without paying for idle compute time when waiting for external events or human decisions.",
      "link": "https://aws.amazon.com/blogs/aws/build-multi-step-applications-and-ai-workflows-with-aws-lambda-durable-functions/",
      "pubDate": "2025-12-02T16:12:19.000Z",
      "source": "newsBlog",
      "services": [
        "lambda"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "lambda"
      ]
    },
    {
      "id": "aws-news-61eba6194632",
      "title": "New capabilities to optimize costs and improve scalability on Amazon RDS for SQL Server and Oracle",
      "description": "Manage development, testing, and production database workloads more efficiently with new features including Developer Edition support for SQL Server, M7i/R7i instance support with optimize CPU, and expanded storage options up to 256 TiB.",
      "link": "https://aws.amazon.com/blogs/aws/amazon-rds-for-oracle-and-rds-for-sql-server-add-new-capabilities-to-enhance-performance-and-optimize-costs/",
      "pubDate": "2025-12-02T16:09:29.000Z",
      "source": "newsBlog",
      "services": [
        "rds"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "rds",
        "new-feature",
        "support"
      ]
    },
    {
      "id": "aws-news-0da1e0b931e3",
      "title": "Introducing Database Savings Plans for AWS Databases",
      "description": "New pricing model helps maintain cost efficiency while providing flexibility with database services and deployment options.",
      "link": "https://aws.amazon.com/blogs/aws/introducing-database-savings-plans-for-aws-databases/",
      "pubDate": "2025-12-02T16:09:26.000Z",
      "source": "newsBlog",
      "services": [
        "lex"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "lex"
      ]
    },
    {
      "id": "aws-news-013962572343",
      "title": "Amazon CloudWatch introduces unified data management and analytics for operations, security, and compliance",
      "description": "Reduce data management complexity and costs with automatic normalization across sources, native analytics integration, and built-in support for industry-standard formats like OCSF and Apache Iceberg.",
      "link": "https://aws.amazon.com/blogs/aws/amazon-cloudwatch-introduces-unified-data-management-and-analytics-for-operations-security-and-compliance/",
      "pubDate": "2025-12-02T16:07:11.000Z",
      "source": "newsBlog",
      "services": [
        "lex",
        "cloudwatch"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "lex",
        "cloudwatch",
        "integration",
        "support"
      ]
    },
    {
      "id": "aws-news-c1b325cf4a05",
      "title": "New and enhanced AWS Support plans add AI capabilities to expert guidance",
      "description": "Prevent cloud infrastructure issues before they impact your business with AWS Support plans that combine AI-powered insights with expert guidance, offering faster response times and proactive monitoring across performance, security, and cost dimensions.",
      "link": "https://aws.amazon.com/blogs/aws/new-and-enhanced-aws-support-plans-add-ai-capabilities-to-expert-guidance/",
      "pubDate": "2025-12-02T16:07:03.000Z",
      "source": "newsBlog",
      "services": [],
      "categories": [
        "news"
      ],
      "tags": [
        "support"
      ]
    },
    {
      "id": "aws-news-9a0b50c6aecc",
      "title": "Amazon OpenSearch Service improves vector database performance and cost with GPU acceleration and auto-optimization",
      "description": "Build and optimize large-scale vector databases up to 10 times faster and at a quarter of the cost with new GPU acceleration and auto-optimization capabilities that automatically balance search quality, speed, and resource usage.",
      "link": "https://aws.amazon.com/blogs/aws/amazon-opensearch-service-improves-vector-database-performance-and-cost-with-gpu-acceleration-and-auto-optimization/",
      "pubDate": "2025-12-02T16:06:41.000Z",
      "source": "newsBlog",
      "services": [
        "opensearch",
        "opensearch service"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "opensearch",
        "opensearch service"
      ]
    },
    {
      "id": "aws-news-b8ed46f35335",
      "title": "Amazon S3 Vectors now generally available with increased scale and performance",
      "description": "Scale vector storage and querying to new heights with S3 Vectors' general availability—now supporting up to 1 billion vectors per index, 100ms query latencies, and expanded regional availability, while reducing costs up to 90% compared to specialized databases.",
      "link": "https://aws.amazon.com/blogs/aws/amazon-s3-vectors-now-generally-available-with-increased-scale-and-performance/",
      "pubDate": "2025-12-02T16:06:11.000Z",
      "source": "newsBlog",
      "services": [
        "s3 vectors",
        "s3"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "s3 vectors",
        "s3",
        "generally-available",
        "support"
      ]
    },
    {
      "id": "aws-news-46fcd3d2ef15",
      "title": "Amazon Bedrock adds 18 fully managed open weight models, including the new Mistral Large 3 and Ministral 3 models",
      "description": "Access fully managed foundation models from leading providers like Google, Kimi AI, MiniMax AI, Mistral AI, NVIDIA, OpenAI, and Qwen, including the new Mistral Large 3 and Ministral 3 3B, 8B, and 14B models through Amazon Bedrock.",
      "link": "https://aws.amazon.com/blogs/aws/amazon-bedrock-adds-fully-managed-open-weight-models/",
      "pubDate": "2025-12-02T16:05:57.000Z",
      "source": "newsBlog",
      "services": [
        "bedrock"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "bedrock"
      ]
    },
    {
      "id": "aws-news-0dbe89f3f79b",
      "title": "Orchestrating large-scale document processing with AWS Step Functions and Amazon Bedrock batch inference",
      "description": "Organizations often have large volumes of documents containing valuable information that remains locked away and unsearchable. This solution addresses the need for a \nscalable, automated text extraction and knowledge base pipeline that transforms static document collections into intelligent, searchable repositories for generative AI applications.",
      "link": "https://aws.amazon.com/blogs/compute/orchestrating-large-scale-document-processing-with-aws-step-functions-and-amazon-bedrock-batch-inference/",
      "pubDate": "2025-11-26T21:41:51.000Z",
      "source": "computeBlog",
      "services": [
        "bedrock",
        "step functions",
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "bedrock",
        "step functions",
        "organizations",
        "ga"
      ]
    },
    {
      "id": "aws-news-1c031b337189",
      "title": "Secure Amazon Elastic VMware Service (Amazon EVS) with AWS Network Firewall",
      "description": "In this post, we demonstrate how to utilize AWS Network Firewall to secure an Amazon EVS environment, using a centralized inspection architecture across an EVS cluster, VPCs, on-premises data centers and the internet. We walk through the implementation steps to deploy this architecture using AWS Network Firewall and AWS Transit Gateway.",
      "link": "https://aws.amazon.com/blogs/architecture/secure-amazon-elastic-vmware-service-amazon-evs-with-aws-network-firewall/",
      "pubDate": "2025-11-26T16:22:03.000Z",
      "source": "architectureBlog",
      "services": [],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "ga"
      ]
    },
    {
      "id": "aws-news-c9da28428aee",
      "title": "Node.js 24 runtime now available in AWS Lambda",
      "description": "You can now develop AWS Lambda functions using Node.js 24, either as a managed runtime or using the container base image. Node.js 24 is in active LTS status and ready for production use. It is expected to be supported with security patches and bugfixes until April 2028. The Lambda runtime for Node.js 24 includes a new implementation of the […]",
      "link": "https://aws.amazon.com/blogs/compute/node-js-24-runtime-now-available-in-aws-lambda/",
      "pubDate": "2025-11-25T22:19:46.000Z",
      "source": "computeBlog",
      "services": [
        "lambda"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-7cb737e81dc9",
      "title": "The attendee’s guide to hybrid cloud and edge computing at AWS re:Invent 2025",
      "description": "AWS re:Invent 2025 returns to Las Vegas, Nevada, from December 1–5, 2025. This year, we’re offering a comprehensive lineup of sessions and booth activities to help you build resilient, performant, and scalable applications wherever you need them—in the cloud, on premises, or at the edge.",
      "link": "https://aws.amazon.com/blogs/compute/the-attendees-guide-to-hybrid-cloud-and-edge-computing-at-aws-reinvent-2025/",
      "pubDate": "2025-11-25T19:27:19.000Z",
      "source": "computeBlog",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga"
      ]
    },
    {
      "id": "aws-news-e5767083a6d4",
      "title": "Optimize unused capacity with Amazon EC2 interruptible capacity reservations",
      "description": "Organizations running critical workloads on Amazon Elastic Compute Cloud (Amazon EC2) reserve compute capacity using On-Demand Capacity Reservations (ODCR) to have availability when needed. However, reserved capacity can intermittently sit idle during off-peak periods, between deployments, or when workloads scale down. This unused capacity represents a missed opportunity for cost optimization and resource efficiency across the organization.",
      "link": "https://aws.amazon.com/blogs/compute/optimize-unused-capacity-with-amazon-ec2-interruptible-capacity-reservations/",
      "pubDate": "2025-11-25T01:09:16.000Z",
      "source": "computeBlog",
      "services": [
        "ec2",
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "ec2",
        "organizations",
        "ga"
      ]
    },
    {
      "id": "aws-news-5403d33b1bbc",
      "title": "How potential performance upside with AWS Graviton helps reduce your costs further",
      "description": "Amazon Web Services (AWS) provides many mechanisms to optimize the price performance of workloads running on Amazon Elastic Compute Cloud (Amazon EC2), and the selection of the optimal infrastructure to run on can be one of the most impactful levers. When we started building the AWS Graviton processor, our goal was to optimize AWS Graviton […]",
      "link": "https://aws.amazon.com/blogs/compute/how-potential-performance-upside-with-aws-graviton-helps-reduce-your-costs-further/",
      "pubDate": "2025-11-24T19:11:55.000Z",
      "source": "computeBlog",
      "services": [
        "ec2",
        "graviton"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "graviton"
      ]
    },
    {
      "id": "aws-news-7d35cf5f9ae9",
      "title": "Enhancing API security with Amazon API Gateway TLS security policies",
      "description": "In this post, you will learn how the new Amazon API Gateway’s enhanced TLS security policies help you meet standards such as PCI DSS, Open Banking, and FIPS, while strengthening how your APIs handle TLS negotiation. This new capability increases your security posture without adding operational complexity, and provides you with a single, consistent way to standardize TLS configuration across your API Gateway infrastructure.",
      "link": "https://aws.amazon.com/blogs/compute/enhancing-api-security-with-amazon-api-gateway-tls-security-policies/",
      "pubDate": "2025-11-21T21:17:52.000Z",
      "source": "computeBlog",
      "services": [
        "lex",
        "rds",
        "api gateway"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "rds",
        "api gateway",
        "ga",
        "new-capability"
      ]
    },
    {
      "id": "aws-news-2e1c3c046458",
      "title": "Introducing Amazon S3 Transfer Manager for Swift (Developer Preview)",
      "description": "e are pleased to announce the Developer Preview release of the Amazon S3 Transfer Manager for Swift —a high-level file and directory transfer utility for \nAmazon Simple Storage Service (Amazon S3) built with the \nAWS SDK for Swift.",
      "link": "https://aws.amazon.com/blogs/developer/introducing-amazon-s3-transfer-manager-for-swift-developer-preview/",
      "pubDate": "2025-11-21T21:02:48.000Z",
      "source": "developersAndDevOps",
      "services": [
        "s3"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "s3",
        "preview"
      ]
    },
    {
      "id": "aws-news-9d3d32287870",
      "title": "Improving throughput of serverless streaming workloads for Kafka",
      "description": "Event-driven applications often need to process data in real-time. When you use AWS Lambda to process records from Apache Kafka topics, you frequently encounter two typical requirements: you need to process very high volumes of records in close to real-time, and you want your consumers to have the ability to scale rapidly to handle traffic spikes. Achieving both necessitates understanding how Lambda consumes Kafka streams, where the potential bottlenecks are, and how to optimize configurations for high throughput and best performance.",
      "link": "https://aws.amazon.com/blogs/compute/improving-throughput-of-serverless-streaming-workloads-for-kafka/",
      "pubDate": "2025-11-21T20:02:57.000Z",
      "source": "computeBlog",
      "services": [
        "lambda",
        "rds",
        "kafka"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda",
        "rds",
        "kafka"
      ]
    },
    {
      "id": "aws-news-b3a3371e0c90",
      "title": "Build scalable REST APIs using Amazon API Gateway private integration with Application Load Balancer",
      "description": "Today, we announced \nAmazon API Gateway REST API’s support for private integration with \nApplication Load Balancers (ALBs). You can use this new capability to securely expose your VPC-based applications through your REST APIs without exposing your ALBs to the public internet.",
      "link": "https://aws.amazon.com/blogs/compute/build-scalable-rest-apis-using-amazon-api-gateway-private-integration-with-application-load-balancer/",
      "pubDate": "2025-11-21T19:28:04.000Z",
      "source": "computeBlog",
      "services": [
        "api gateway"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "api gateway",
        "ga",
        "integration",
        "support",
        "new-capability"
      ]
    },
    {
      "id": "aws-news-d48c6bab49bb",
      "title": "Serverless strategies for streaming LLM responses",
      "description": "Modern generative AI applications often need to stream large language model (LLM) outputs to users in real-time. Instead of waiting for a complete response, streaming delivers partial results as they become available, which significantly improves the user experience for chat interfaces and long-running AI tasks. This post compares three serverless approaches to handle Amazon Bedrock LLM streaming on Amazon Web Services (AWS), which helps you choose the best fit for your application.",
      "link": "https://aws.amazon.com/blogs/compute/serverless-strategies-for-streaming-llm-responses/",
      "pubDate": "2025-11-21T03:42:56.000Z",
      "source": "computeBlog",
      "services": [
        "bedrock"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "bedrock"
      ]
    },
    {
      "id": "aws-news-df24f6f1c182",
      "title": "Building multi-tenant SaaS applications with AWS Lambda’s new tenant isolation mode",
      "description": "Today, AWS is announcing tenant isolation for AWS Lambda, enabling you to process function invocations in separate execution environments for each end-user or tenant invoking your Lambda function. This capability simplifies building secure multi-tenant SaaS applications by managing tenant-level compute environment isolation and request routing, allowing you to focus on core business logic rather than implementing tenant-aware compute environment isolation.",
      "link": "https://aws.amazon.com/blogs/compute/building-multi-tenant-saas-applications-with-aws-lambdas-new-tenant-isolation-mode/",
      "pubDate": "2025-11-20T17:47:17.000Z",
      "source": "computeBlog",
      "services": [
        "lambda"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda"
      ]
    },
    {
      "id": "aws-news-b04be71f4d69",
      "title": "Improve API discoverability with the new Amazon API Gateway Portal",
      "description": "In this post, we will show how you can use the new portal feature to create customizable portals with enhanced security features in minutes, with APIs from multiple accounts, without managing any infrastructure.",
      "link": "https://aws.amazon.com/blogs/compute/improve-api-discoverability-with-the-new-amazon-api-gateway-portal/",
      "pubDate": "2025-11-20T00:41:25.000Z",
      "source": "computeBlog",
      "services": [
        "api gateway"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "api gateway",
        "ga"
      ]
    },
    {
      "id": "aws-news-9150859a247c",
      "title": "Building an AI gateway to Amazon Bedrock with Amazon API Gateway",
      "description": "In this post, we'll explore a reference architecture that helps enterprises govern their Amazon Bedrock implementations using Amazon API Gateway. This pattern enables key capabilities like authorization controls, usage quotas, and real-time response streaming. We'll examine the architecture, provide deployment steps, and discuss potential enhancements to help you implement AI governance at scale.",
      "link": "https://aws.amazon.com/blogs/architecture/building-an-ai-gateway-to-amazon-bedrock-with-amazon-api-gateway/",
      "pubDate": "2025-11-19T23:33:41.000Z",
      "source": "architectureBlog",
      "services": [
        "bedrock",
        "api gateway"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "bedrock",
        "api gateway",
        "ga",
        "enhancement"
      ]
    },
    {
      "id": "aws-news-547c9eb92bd7",
      "title": "Building responsive APIs with Amazon API Gateway response streaming",
      "description": "Today, AWS announced support for response streaming in Amazon API Gateway to significantly improve the responsiveness of your REST APIs by progressively streaming response payloads back to the client. With this new capability, you can use streamed responses to enhance user experience when building LLM-driven applications (such as AI agents and chatbots), improve time-to-first-byte (TTFB) performance for web and mobile applications, stream large files, and perform long-running operations while reporting incremental progress using protocols such as server-sent events (SSE).",
      "link": "https://aws.amazon.com/blogs/compute/building-responsive-apis-with-amazon-api-gateway-response-streaming/",
      "pubDate": "2025-11-19T23:10:51.000Z",
      "source": "computeBlog",
      "services": [
        "api gateway"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "api gateway",
        "ga",
        "support",
        "new-capability"
      ]
    },
    {
      "id": "aws-news-053825de2c68",
      "title": "Optimize latency-sensitive workloads with Amazon EC2 detailed NVMe statistics",
      "description": "Amazon Elastic Cloud Compute (Amazon EC2) instances with locally attached NVMe storage can provide the performance needed for workloads demanding ultra-low latency and high I/O throughput. High-performance workloads, from high-frequency trading applications and in-memory databases to real-time analytics engines and AI/ML inference, need comprehensive performance tracking. Operating system tools like iostat and sar provide valuable system-level insights, and Amazon CloudWatch offers important disk IOPs and throughput measurements, but high-performance workloads can benefit from even more detailed visibility into instance store performance.",
      "link": "https://aws.amazon.com/blogs/compute/optimize-latency-sensitive-workloads-with-amazon-ec2-detailed-nvme-statistics/",
      "pubDate": "2025-11-19T21:13:06.000Z",
      "source": "computeBlog",
      "services": [
        "ec2",
        "cloudwatch"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "ec2",
        "cloudwatch"
      ]
    },
    {
      "id": "aws-news-4934fd40d9d8",
      "title": "Architecting for AI excellence: AWS launches three Well-Architected Lenses at re:Invent 2025",
      "description": "At re:Invent 2025, we introduce one new lens and two significant updates to the AWS Well-Architected Lenses specifically focused on AI workloads: the Responsible AI Lens, the Machine Learning (ML) Lens, and the Generative AI Lens. Together, these lenses provide comprehensive guidance for organizations at different stages of their AI journey, whether you're just starting to experiment with machine learning or already deploying complex AI applications at scale.",
      "link": "https://aws.amazon.com/blogs/architecture/architecting-for-ai-excellence-aws-launches-three-well-architected-lenses-at-reinvent-2025/",
      "pubDate": "2025-11-19T19:36:31.000Z",
      "source": "architectureBlog",
      "services": [
        "lex",
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "lex",
        "organizations",
        "launch",
        "ga",
        "update"
      ]
    },
    {
      "id": "aws-news-61647c9310e0",
      "title": "Announcing the updated AWS Well-Architected Generative AI Lens",
      "description": "We are delighted to announce an update to the AWS Well-Architected Generative AI Lens. This update features several new sections of the Well-Architected Generative AI Lens, including new best practices, advanced scenario guidance, and improved preambles on responsible AI, data architecture, and agentic workflows.",
      "link": "https://aws.amazon.com/blogs/architecture/announcing-the-updated-aws-well-architected-generative-ai-lens/",
      "pubDate": "2025-11-19T19:36:28.000Z",
      "source": "architectureBlog",
      "services": [],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "update"
      ]
    },
    {
      "id": "aws-news-5044b6bc98c4",
      "title": "Announcing the updated AWS Well-Architected Machine Learning Lens",
      "description": "We are excited to announce the updated AWS Well-Architected Machine Learning Lens, now enhanced with the latest capabilities and best practices for building machine learning (ML) workloads on AWS.",
      "link": "https://aws.amazon.com/blogs/architecture/announcing-the-updated-aws-well-architected-machine-learning-lens/",
      "pubDate": "2025-11-19T19:36:25.000Z",
      "source": "architectureBlog",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "update"
      ]
    },
    {
      "id": "aws-news-05b9bc2e3644",
      "title": "Python 3.14 runtime now available in AWS Lambda",
      "description": "AWS Lambda now supports Python 3.14 as both a managed runtime and container base image. Python is a popular language for building serverless applications. Developers can now take advantage of new features and enhancements when creating serverless applications on Lambda.",
      "link": "https://aws.amazon.com/blogs/compute/python-3-14-runtime-now-available-in-aws-lambda/",
      "pubDate": "2025-11-18T21:29:50.000Z",
      "source": "computeBlog",
      "services": [
        "lambda"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda",
        "now-available",
        "new-feature",
        "enhancement",
        "support"
      ]
    },
    {
      "id": "aws-news-c36d51e13ef0",
      "title": "Building serverless applications with Rust on AWS Lambda",
      "description": "Today, AWS Lambda is promoting Rust support from Experimental to Generally Available. This means you can now use Rust to build business-critical serverless applications, backed by AWS Support and the Lambda availability SLA.",
      "link": "https://aws.amazon.com/blogs/compute/building-serverless-applications-with-rust-on-aws-lambda/",
      "pubDate": "2025-11-14T21:38:15.000Z",
      "source": "computeBlog",
      "services": [
        "lambda"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda",
        "experimental",
        "generally-available",
        "support"
      ]
    },
    {
      "id": "aws-news-360e834c997a",
      "title": "BASF Digital Farming builds a STAC-based solution on Amazon EKS",
      "description": "This post was co-written with Frederic Haase and Julian Blau with BASF Digital Farming GmbH. At xarvio – BASF Digital Farming, our mission is to empower farmers around the world with cutting-edge digital agronomic decision-making tools. Central to this mission is our crop optimization platform, xarvio FIELD MANAGER, which delivers actionable insights through a range […]",
      "link": "https://aws.amazon.com/blogs/architecture/basf-digital-farming-builds-a-stac-based-solution-on-amazon-eks/",
      "pubDate": "2025-10-22T16:21:09.000Z",
      "source": "architectureBlog",
      "services": [
        "eks"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "eks"
      ]
    },
    {
      "id": "aws-news-24029d05087c",
      "title": "What’s New in the AWS Deploy Tool for .NET",
      "description": "Version 2.0 of the AWS Deploy Tool for .NET is now available. This new major version introduces several foundational upgrades to improve the deployment experience for .NET applications on AWS. The tool comes with new minimum runtime requirements. We have upgraded it to require .NET 8 because the predecessor, .NET 6, is now out of […]",
      "link": "https://aws.amazon.com/blogs/developer/whats-new-in-the-aws-deploy-tool-for-net/",
      "pubDate": "2025-10-14T13:25:42.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "now-available"
      ]
    },
    {
      "id": "aws-news-2f3bd8791ed1",
      "title": "Modernization of real-time payment orchestration on AWS",
      "description": "The global real-time payments market is experiencing significant growth. According to Fortune Business Insights, the market was valued at USD 24.91 billion in 2024 and is projected to grow to USD 284.49 billion by 2032, with a CAGR of 35.4%. Similarly, Grand View Research reports that the global mobile payment market, valued at USD 88.50 […]",
      "link": "https://aws.amazon.com/blogs/architecture/modernization-of-real-time-payment-orchestration-on-aws/",
      "pubDate": "2025-10-01T23:34:00.000Z",
      "source": "architectureBlog",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": []
    },
    {
      "id": "aws-news-089334445f81",
      "title": "Build resilient generative AI agents",
      "description": "Generative AI agents in production environments demand resilience strategies that go beyond traditional software patterns. AI agents make autonomous decisions, consume substantial computational resources, and interact with external systems in unpredictable ways. These characteristics create failure modes that conventional resilience approaches might not address. This post presents a framework for AI agent resilience risk analysis […]",
      "link": "https://aws.amazon.com/blogs/architecture/build-resilient-generative-ai-agents/",
      "pubDate": "2025-09-30T15:11:51.000Z",
      "source": "architectureBlog",
      "services": [],
      "categories": [
        "generative-ai"
      ],
      "tags": []
    },
    {
      "id": "aws-news-4fbb29739c17",
      "title": "General Availability Release of the Migration Tool for the AWS SDK for Java 2.x",
      "description": "The AWS SDK for Java 1.x (v1) entered maintenance mode on July 31, 2024, and will reach end-of-support on December 31, 2025. We recommend that you migrate to the AWS SDK for Java 2.x (v2) to access new features, enhanced performance, and continued support from AWS. To help you migrate efficiently, we’ve created a migration […]",
      "link": "https://aws.amazon.com/blogs/developer/general-availability-release-of-the-migration-tool-for-the-aws-sdk-for-java-2-x/",
      "pubDate": "2025-09-26T16:47:36.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "new-feature",
        "support"
      ]
    },
    {
      "id": "aws-news-4711328feee4",
      "title": "A scalable, elastic database and search solution for 1B+ vectors built on LanceDB and Amazon S3",
      "description": "In this post, we explore how Metagenomi built a scalable database and search solution for over 1 billion protein vectors using LanceDB and Amazon S3. The solution enables rapid enzyme discovery by transforming proteins into vector embeddings and implementing a serverless architecture that combines AWS Lambda, AWS Step Functions, and Amazon S3 for efficient nearest neighbor searches.",
      "link": "https://aws.amazon.com/blogs/architecture/a-scalable-elastic-database-and-search-solution-for-1b-vectors-built-on-lancedb-and-amazon-s3/",
      "pubDate": "2025-09-22T17:15:44.000Z",
      "source": "architectureBlog",
      "services": [
        "lambda",
        "s3",
        "step functions"
      ],
      "categories": [
        "ai-services"
      ],
      "tags": [
        "lambda",
        "s3",
        "step functions"
      ]
    },
    {
      "id": "aws-news-7e2f23dd38ac",
      "title": "Simplify multi-tenant encryption with a cost-conscious AWS KMS key strategy",
      "description": "In this post, we explore an efficient approach to managing encryption keys in a multi-tenant SaaS environment through centralization, addressing challenges like key proliferation, rising costs, and operational complexity across multiple AWS accounts and services. We demonstrate how implementing a centralized key management strategy using a single AWS KMS key per tenant can maintain security and compliance while reducing operational overhead as organizations scale.",
      "link": "https://aws.amazon.com/blogs/architecture/simplify-multi-tenant-encryption-with-a-cost-conscious-aws-kms-key-strategy/",
      "pubDate": "2025-08-21T21:54:51.000Z",
      "source": "architectureBlog",
      "services": [
        "lex",
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "lex",
        "organizations",
        "ga"
      ]
    },
    {
      "id": "aws-news-d1d1f77f887e",
      "title": "How Karrot built a feature platform on AWS, Part 1: Motivation and feature serving",
      "description": "This two-part series shows how Karrot developed a new feature platform, which consists of three main components: feature serving, a stream ingestion pipeline, and a batch ingestion pipeline. This post starts by presenting our motivation, our requirements, and the solution architecture, focusing on feature serving.",
      "link": "https://aws.amazon.com/blogs/architecture/how-karrot-built-a-feature-platform-on-aws-part-1-motivation-and-feature-serving/",
      "pubDate": "2025-08-14T15:16:29.000Z",
      "source": "architectureBlog",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "new-feature"
      ]
    },
    {
      "id": "aws-news-40ebd26fef7f",
      "title": "How Karrot built a feature platform on AWS, Part 2: Feature ingestion",
      "description": "This two-part series shows how Karrot developed a new feature platform, which consists of three main components: feature serving, a stream ingestion pipeline, and a batch ingestion pipeline. This post covers the process of collecting features in real-time and batch ingestion into an online store, and the technical approaches for stable operation.",
      "link": "https://aws.amazon.com/blogs/architecture/how-karrot-built-a-feature-platform-on-aws-part-2-feature-ingestion/",
      "pubDate": "2025-08-14T15:16:27.000Z",
      "source": "architectureBlog",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "new-feature"
      ]
    },
    {
      "id": "aws-news-b1018aefba54",
      "title": "Deploy LLMs on Amazon EKS using vLLM Deep Learning Containers",
      "description": "In this post, we demonstrate how to deploy the DeepSeek-R1-Distill-Qwen-32B model using AWS DLCs for vLLMs on Amazon EKS, showcasing how these purpose-built containers simplify deployment of this powerful open source inference engine. This solution can help you solve the complex infrastructure challenges of deploying LLMs while maintaining performance and cost-efficiency.",
      "link": "https://aws.amazon.com/blogs/architecture/deploy-llms-on-amazon-eks-using-vllm-deep-learning-containers/",
      "pubDate": "2025-08-14T15:09:51.000Z",
      "source": "architectureBlog",
      "services": [
        "lex",
        "eks"
      ],
      "categories": [
        "foundation-models"
      ],
      "tags": [
        "lex",
        "eks"
      ]
    },
    {
      "id": "aws-news-875544c87826",
      "title": "Preview Release of the AWS SDK Java 2.x HTTP Client built on Apache HttpClient 5.5.x",
      "description": "The AWS SDK for Java 2.x introduces the Apache 5 SDK HTTP client which is built on Apache HttpClient 5.5.x. This new SDK HTTP client is available alongside our existing SDK HTTP clients: Apache HttpClient 4.5.x, Netty, URL Connection, and AWS CRT HttpClient. To differentiate the use of Apache HttpClient 4.5.x and Apache HttpClient 5.5.x, […]",
      "link": "https://aws.amazon.com/blogs/developer/preview-release-of-theaws-sdk-java-2-x-http-client-built-on-apache-httpclient-5-5-x/",
      "pubDate": "2025-07-18T03:36:05.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "preview"
      ]
    },
    {
      "id": "aws-news-6606f79cd3d5",
      "title": "AWS .NET Distributed Cache Provider for Amazon DynamoDB now Generally Available",
      "description": "Today, we are excited to announce the general availability of the AWS .NET Distributed Cache Provider for Amazon DynamoDB. This is a seamless, serverless caching solution that enables .NET developers to efficiently manage their caching needs across distributed systems. Consistent caching is a difficult problem in distributed architectures, where maintaining data integrity and performance across […]",
      "link": "https://aws.amazon.com/blogs/developer/aws-net-distributed-cache-provider-for-amazon-dynamodb-now-generally-available/",
      "pubDate": "2025-07-03T13:49:25.000Z",
      "source": "developersAndDevOps",
      "services": [
        "dynamodb"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "dynamodb",
        "generally-available"
      ]
    },
    {
      "id": "aws-news-ae25b45e1a62",
      "title": "AWS Tools for PowerShell V5 now Generally Available",
      "description": "This blog was co-authored by Afroz Mohammed and Jonathan Nunn, Software Developers on the AWS PowerShell team. We’re excited to announce the general availability of the AWS Tools for PowerShell version 5, a major update that brings new features and improvements in security, along with a few breaking changes. New Features You can now cancel […]",
      "link": "https://aws.amazon.com/blogs/developer/aws-tools-for-powershell-v5-now-generally-available/",
      "pubDate": "2025-06-23T22:59:33.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "generally-available",
        "new-feature",
        "update",
        "improvement"
      ]
    },
    {
      "id": "aws-news-54c273e45b01",
      "title": "Upgrading your AWS SDK for Go from V1 to V2 with Amazon Q Developer",
      "description": "Software development is far more than just writing code. In reality, a developer spends a large amount of time maintaining existing applications and fixing bugs. For example, migrating a Go application from the older AWS SDK for Go v1 to the newer v2 can be a significant undertaking, but it’s a crucial step to future-proof […]",
      "link": "https://aws.amazon.com/blogs/developer/upgrading-your-aws-sdk-for-go-from-v1-to-v2-with-amazon-q-developer/",
      "pubDate": "2025-06-18T06:38:24.000Z",
      "source": "developersAndDevOps",
      "services": [
        "amazon q",
        "q developer"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "amazon q",
        "q developer"
      ]
    },
    {
      "id": "aws-news-27b43a8f9a42",
      "title": "Deploy to ARM-Based Compute with AWS Deploy Tool for .NET",
      "description": "We’re excited to announce that the AWS Deploy Tool for .NET now supports deploying .NET applications to select ARM-based compute platforms on AWS! Whether you’re deploying from Visual Studio or using the .NET CLI, you can now target cost-effective ARM infrastructure like AWS Graviton with the same streamlined experience you’re used to. Why deploy to […]",
      "link": "https://aws.amazon.com/blogs/developer/deploy-to-arm-based-compute-with-aws-deploy-tool-for-net/",
      "pubDate": "2025-05-08T20:16:40.000Z",
      "source": "developersAndDevOps",
      "services": [
        "graviton"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "graviton",
        "support"
      ]
    },
    {
      "id": "aws-news-4d3126ea3a15",
      "title": "General Availability of AWS SDK for .NET V4.0",
      "description": "Version 4.0 of the AWS SDK for .NET has been released for general availability (GA). V4 has been in development for a little over a year in our SDK’s public GitHub repository with 13 previews being released. This new version contains performance improvements, consistency with other AWS SDKs, and bug and usability fixes that required […]",
      "link": "https://aws.amazon.com/blogs/developer/general-availability-of-aws-sdk-for-net-v4-0/",
      "pubDate": "2025-04-28T20:05:16.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "preview",
        "ga",
        "improvement"
      ]
    },
    {
      "id": "aws-news-49859f1bef68",
      "title": "Introducing the AWS IoT Device SDK for Swift (Developer Preview)",
      "description": "Today, AWS launches the developer preview of the AWS IoT Device SDK for Swift. The IoT Device SDK for Swift empowers Swift developers to create IoT applications for Linux and Apple macOS, iOS, and tvOS platforms using the MQTT 5 protocol. The SDK supports Swift 5.10+ and is designed to help developers easily integrate with […]",
      "link": "https://aws.amazon.com/blogs/developer/introducing-the-aws-iot-device-sdk-for-swift-developer-preview/",
      "pubDate": "2025-03-31T16:26:05.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "launch",
        "preview",
        "support"
      ]
    },
    {
      "id": "aws-news-c4f514e85eef",
      "title": "AWS SDK for Ruby: Deprecating Ruby 2.5 & 2.6 Runtime Supports and Future Compatibility",
      "description": "Effective June 2, 2025, AWS SDK for Ruby Version 3 will no longer support following end-of-life (EOL) Ruby runtime versions: Ruby 2.5 (EOL began on 2021-04-05) Ruby 2.6 (EOL began on 2022-04-12) To ensure your applications and services remain secure, we strongly encourage you to upgrade to Ruby 2.7 or later. Moving forward, AWS SDK […]",
      "link": "https://aws.amazon.com/blogs/developer/aws-sdk-for-ruby-deprecating-ruby-2-5-2-6-runtime-supports-and-future-compatibility/",
      "pubDate": "2025-03-27T15:08:27.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-5cf08af5aca4",
      "title": "Announcing the Developer Preview of Amazon S3 Transfer Manager in Rust",
      "description": "We are excited to announce the Developer Preview of the Amazon S3 Transfer Manager for Rust, a high-level utility that speeds up and simplifies uploads and downloads with Amazon Simple Storage Service (Amazon S3). Using this new library, developers can efficiently transfer data between Amazon S3 and various sources, including files, in-memory buffers, memory streams, […]",
      "link": "https://aws.amazon.com/blogs/developer/announcing-the-developer-preview-of-amazon-s3-transfer-manager-in-rust/",
      "pubDate": "2025-03-26T15:52:22.000Z",
      "source": "developersAndDevOps",
      "services": [
        "s3"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "s3",
        "preview"
      ]
    },
    {
      "id": "aws-news-dd08a704e7e9",
      "title": "Building and Debugging .NET Lambda applications with .NET Aspire (Part 2)",
      "description": "In Part 1 of our blog posts for .NET Aspire and AWS Lambda, we showed you how .NET Aspire can be used for running and debugging .NET Lambda functions. In this part, Part 2, we’ll show you how to take advantage of the .NET Aspire programming model for best practices and for connecting dependent resources […]",
      "link": "https://aws.amazon.com/blogs/developer/building-lambda-with-aspire-part-2/",
      "pubDate": "2025-03-04T17:54:04.000Z",
      "source": "developersAndDevOps",
      "services": [
        "lambda"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda"
      ]
    },
    {
      "id": "aws-news-4185fb6b40aa",
      "title": "Building and Debugging .NET Lambda applications with .NET Aspire (Part 1)",
      "description": "In a recent post we gave some background on .NET Aspire and introduced our AWS integrations with .NET Aspire that integrate AWS into the .NET dev inner loop for building applications. The integrations included how to provision application resources with AWS CloudFormation or AWS Cloud Development Kit (AWS CDK) and using Amazon DynamoDB local for […]",
      "link": "https://aws.amazon.com/blogs/developer/building-lambda-with-aspire-part-1/",
      "pubDate": "2025-03-03T21:16:42.000Z",
      "source": "developersAndDevOps",
      "services": [
        "lambda",
        "dynamodb",
        "cloudformation"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda",
        "dynamodb",
        "cloudformation",
        "ga",
        "integration"
      ]
    },
    {
      "id": "aws-news-866c6557a5ec",
      "title": "Integrating AWS with .NET Aspire",
      "description": ".NET Aspire is a new way of building cloud-ready applications. In particular, it provides an orchestration for local environments in which to run, connect, and debug the components of distributed applications. Those components can be .NET projects, databases, containers, or executables. .NET Aspire is designed to have integrations with common components used in distributed applications. […]",
      "link": "https://aws.amazon.com/blogs/developer/integrating-aws-with-net-aspire/",
      "pubDate": "2025-02-11T20:39:27.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "integration"
      ]
    },
    {
      "id": "aws-news-9568575bd4f9",
      "title": "Updating AWS SDK defaults – AWS STS service endpoint and Retry Strategy",
      "description": "AWS announces important configuration updates coming July 31st, 2025, affecting AWS SDKs and CLIs default settings. Two key changes include switching the AWS Security Token Service (STS) endpoint to regional and updating the default retry strategy to standard. These updates aim to improve service availability and reliability by implementing regional endpoints to reduce cross-regional dependencies and introducing token-bucket throttling for standardized retry behavior. Organizations should test their applications before the release date and can opt-in early or temporarily opt-out of these changes. These updates align with AWS best practices for optimal service performance and security.",
      "link": "https://aws.amazon.com/blogs/developer/updating-aws-sdk-defaults-aws-sts-service-endpoint-and-retry-strategy/",
      "pubDate": "2025-02-11T05:37:32.000Z",
      "source": "developersAndDevOps",
      "services": [
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "organizations",
        "ga",
        "update"
      ]
    }
  ]
}