{
  "lastUpdated": "2025-10-28T06:15:58.833Z",
  "totalItems": 192,
  "sources": {
    "whatsNew": 92,
    "mlBlog": 20,
    "newsBlog": 17,
    "bigDataBlog": 19,
    "architectureBlog": 16,
    "computeBlog": 13,
    "developersAndDevOps": 15
  },
  "items": [
    {
      "id": "aws-news-29fb262a0808",
      "title": "Federate access to SageMaker Unified Studio with AWS IAM Identity Center and Okta",
      "description": "This post shows step-by-step guidance to setup workforce access to Amazon SageMaker Unified Studio using Okta as an external Identity provider with AWS IAM Identity Center.",
      "link": "https://aws.amazon.com/blogs/big-data/federate-access-to-sagemaker-unified-studio-with-aws-iam-identity-center-and-okta/",
      "pubDate": "2025-10-27T21:11:07.000Z",
      "source": "bigDataBlog",
      "services": [
        "sagemaker",
        "unified studio",
        "iam",
        "iam identity center"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "unified studio",
        "iam",
        "iam identity center"
      ]
    },
    {
      "id": "aws-news-ddd0469c6cc3",
      "title": "AWS Payment Cryptography is now available in Canada(Montreal), Africa (Cape Town) and Europe (London)",
      "description": "AWS Payment Cryptography has expanded its global presence with availability in three new regions - Canada(Montreal), Africa (Cape Town) and Europe (London). This expansion enables customers with latency-sensitive payment applications to build, deploy or migrate into additional AWS Regions without depending on cross-region support. For customers processing payment workloads in Europe, availability in London offers additional options for multi-Region high availability.\n  AWS Payment Cryptography is a fully managed service that simplifies payment-specific cryptographic operations and key management for cloud-hosted payment applications. The service scales elastically with your business needs and is assessed as compliant with PCI PIN and PCI P2PE requirements, eliminating the need to maintain dedicated payment HSM instances. Organizations performing payment functions - including acquirers, payment facilitators, networks, switches, processors, and banks can now position their payment cryptographic operations closer to their applications while reducing dependencies on auxiliary data centers with dedicated payment HSMs.\n  AWS Payment Cryptography is available in the following AWS Regions: Canada(Montreal), US East (Ohio, N. Virginia), US West (Oregon), Europe (Ireland, Frankfurt, London), Africa(Cape Town) and Asia Pacific (Singapore, Tokyo, Osaka, Mumbai).\n  To start using the service, please download the latest AWS CLI/SDK and see the AWS Payment Cryptography user guide for more information.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-payment-cryptography-available-montreal-south-africa",
      "pubDate": "2025-10-27T18:01:00.000Z",
      "source": "whatsNew",
      "services": [
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "organizations",
        "ga",
        "now-available",
        "support",
        "new-region",
        "expansion"
      ]
    },
    {
      "id": "aws-news-f3c966ea90f4",
      "title": "Amazon Location Service introduces new API key restrictions",
      "description": "Today, AWS announced enhanced API key restrictions for Amazon Location Service, enabling developers to secure their location-based applications more effectively. This new capability helps organizations that need to restrict API access to specific mobile applications, providing improved security controls for location services across their application portfolio.\n  Developers can now create granular security policies by restricting API keys to specific Android applications using package names and SHA-1 certificate fingerprints, or to iOS applications using Bundle IDs. For example, enterprises can ensure their API keys only work with their approved mobile applications, while development teams can create separate keys for testing and production environments.\n  Amazon Location Service API key restrictions are available in the following AWS Regions: US East (Ohio), US East (N. Virginia), US West (Oregon), Asia Pacific (Mumbai), Asia Pacific (Sydney), Asia Pacific (Tokyo), Canada (Central), Europe (Frankfurt), Europe (Ireland), Europe (London), Europe (Stockholm), Europe (Spain), and South America (São Paulo). To implement these restrictions, you'll need to update your API key configurations using the Amazon Location Service console or APIs. To learn more, please visit the Developer Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-location-service-new-api-key-security-restrictions",
      "pubDate": "2025-10-27T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "organizations",
        "ga",
        "update",
        "new-capability"
      ]
    },
    {
      "id": "aws-news-89b837dc6976",
      "title": "Amazon ECS Managed Instances now available in all  commercial AWS Regions",
      "description": "Amazon Elastic Container Service (Amazon ECS) Managed Instances is now available in all commercial AWS Regions. ECS Managed Instances is a fully managed compute option designed to eliminate infrastructure management overhead while giving you access to the full capabilities of Amazon EC2. By offloading infrastructure operations to AWS, you get the application performance you want and the simplicity you need while reducing your total cost of ownership.\n  Managed Instances dynamically scales EC2 instances to match your workload requirements and continuously optimizes task placement to reduce infrastructure costs. It also enhances your security posture through regular security patching initiated every 14 days. You can simply define your task requirements such as the number of vCPUs, memory size, and CPU architecture, and Amazon ECS automatically provisions, configures and operates most optimal EC2 instances within your AWS account using AWS-controlled access. You can also specify desired instance types in Managed Instances Capacity Provider configuration, including GPU-accelerated, network-optimized, and burstable performance, to run your workloads on the instance families you prefer.\n  To get started with ECS Managed Instances, use the AWS Console, Amazon ECS MCP Server, or your favorite infrastructure-as-code tooling to enable it in a new or existing Amazon ECS cluster. You will be charged for the management of compute provisioned, in addition to your regular Amazon EC2 costs. To learn more about ECS Managed Instances, visit the feature page, documentation, and AWS News launch blog.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-ecs-managed-instances-commercial-regions/",
      "pubDate": "2025-10-27T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2",
        "ecs"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "ecs",
        "launch",
        "now-available"
      ]
    },
    {
      "id": "aws-news-2bf2cf1f0a1d",
      "title": "Amazon SageMaker adds additional search context for search results",
      "description": "Amazon SageMaker enhances search results in Amazon SageMaker Unified Studio with additional context that improves transparency and interpretability. Users can see which metadata fields matched their query and understand why each result appears, increasing clarity and trust in data discovery. The capability introduces inline highlighting for matched terms and an explanation panel that details where and how each match occurred across metadata fields such as name, description, glossary, schema, and other metadata.\n  The enhancement reduces time spent evaluating irrelevant assets by presenting match evidence directly in search results. Users can quickly validate relevance without opening individual assets.\n  This capability is now available in all AWS Regions where Amazon SageMaker is supported.\n  To learn more about Amazon SageMaker, see Amazon SageMaker documentaion.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-sagemaker-adds-search-context/",
      "pubDate": "2025-10-27T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "sagemaker",
        "unified studio"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "sagemaker",
        "unified studio",
        "now-available",
        "enhancement",
        "support"
      ]
    },
    {
      "id": "aws-news-78b353d06eec",
      "title": "Amazon Redshift Serverless is now available in the AWS Asia Pacific (Osaka) and Asia Pacific (Malaysia) regions",
      "description": "Amazon Redshift Serverless, which allows you to run and scale analytics without having to provision and manage data warehouse clusters, is now generally available in the AWS Asia Pacific (Osaka) and Asia Pacific (Malaysia) regions. With Amazon Redshift Serverless, all users, including data analysts, developers, and data scientists, can use Amazon Redshift to get insights from data in seconds. Amazon Redshift Serverless automatically provisions and intelligently scales data warehouse capacity to deliver high performance for all your analytics. You only pay for the compute used for the duration of the workloads on a per-second basis. You can benefit from this simplicity without making any changes to your existing analytics and business intelligence applications.\n  With a few clicks in the AWS Management Console, you can get started with querying data using the Query Editor V2 or your tool of choice with Amazon Redshift Serverless. There is no need to choose node types, node count, workload management, scaling, and other manual configurations. You can create databases, schemas, and tables, and load your own data from Amazon S3, access data using Amazon Redshift data shares, or restore an existing Amazon Redshift provisioned cluster snapshot. With Amazon Redshift Serverless, you can directly query data in open formats, such as Apache Parquet, in Amazon S3 data lakes. Amazon Redshift Serverless provides unified billing for queries on any of these data sources, helping you efficiently monitor and manage costs.\n  To get started, see the Amazon Redshift Serverless feature page, user documentation, and API Reference.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-redshift-serverless-osaka-malaysia-regions/",
      "pubDate": "2025-10-27T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "s3",
        "redshift"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "s3",
        "redshift",
        "generally-available",
        "now-available"
      ]
    },
    {
      "id": "aws-news-6ab33ada19c8",
      "title": "Accelerate data governance with custom subscription workflows in Amazon SageMaker",
      "description": "Organizations need to efficiently manage data assets while maintaining governance controls in their data marketplaces. Although manual approval workflows remain important for sensitive datasets and production systems, there’s an increasing need for automated approval processes with less sensitive datasets. In this post, we show you how to automate subscription request approvals within SageMaker, accelerating data access for data consumers.",
      "link": "https://aws.amazon.com/blogs/big-data/accelerate-data-governance-with-custom-subscription-workflows-in-amazon-sagemaker/",
      "pubDate": "2025-10-24T20:41:19.000Z",
      "source": "bigDataBlog",
      "services": [
        "sagemaker",
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "sagemaker",
        "organizations",
        "ga"
      ]
    },
    {
      "id": "aws-news-c9717e0cdb77",
      "title": "Implement fine-grained access control for Iceberg tables using Amazon EMR on EKS integrated with AWS Lake Formation",
      "description": "On February 6th 2025, AWS introduced fine-grained access control based on AWS Lake Formation for EMR on EKS from Amazon EMR 7.7 and higher version. You can now significantly enhance your data governance and security frameworks using this feature. In this post, we demonstrate how to implement FGAC on Apache Iceberg tables using EMR on EKS with Lake Formation.",
      "link": "https://aws.amazon.com/blogs/big-data/implement-fine-grained-access-control-for-iceberg-tables-using-amazon-emr-on-eks-integrated-with-aws-lake-formation/",
      "pubDate": "2025-10-24T20:39:25.000Z",
      "source": "bigDataBlog",
      "services": [
        "emr",
        "eks"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "emr",
        "eks",
        "ga"
      ]
    },
    {
      "id": "aws-news-e4bdcf2aeec1",
      "title": "Amazon EC2 Auto Scaling now supports predictive scaling in six more regions",
      "description": "Customers can now enable predictive scaling for their Auto Scaling groups (ASGs) in six more regions: Asia Pacific (Hyderabad), Asia Pacific (Melbourne), Israel (Tel Aviv), Canada West (Calgary), Europe (Spain), and Europe (Zurich). Predictive Scaling can proactively scale out your ASGs to be ready for upcoming demand. This allows you to avoid the need to over-provision capacity, resulting in lower EC2 cost, while ensuring your application’s responsiveness. To see the list of all supported AWS public regions and AWS GovCloud (US) regions, click here.\n  Predictive Scaling is appropriate for applications that experience recurring patterns of steep demand changes, such as early morning spikes when business resumes. It learns from the past patterns and launches instances in advance of predicted demand, giving instances time to warm up. Predictive scaling enhances existing Auto Scaling policies, such as Target Tracking or Simple Scaling, so that your applications scale based on both real-time metrics and historic patterns. You can preview how Predictive Scaling works with your ASG by using the “Forecast Only” mode.\n  Predictive Scaling is available as a scaling policy type through AWS Command Line Interface (CLI), EC2 Auto Scaling Management Console, AWS CloudFormation and AWS SDKs. To learn more, visit the Predictive Scaling page in the EC2 Auto Scaling documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-ec2-auto-scaling-predictive-scaling-in-six/",
      "pubDate": "2025-10-24T18:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "forecast",
        "ec2",
        "cloudformation"
      ],
      "categories": [
        "ai-services"
      ],
      "tags": [
        "forecast",
        "ec2",
        "cloudformation",
        "launch",
        "preview",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-00fb14f930ae",
      "title": "Responsible AI design in healthcare and life sciences",
      "description": "In this post, we explore the critical design considerations for building responsible AI systems in healthcare and life sciences, focusing on establishing governance mechanisms, transparency artifacts, and security measures that ensure safe and effective generative AI applications. The discussion covers essential policies for mitigating risks like confabulation and bias while promoting trust, accountability, and patient safety throughout the AI development lifecycle.",
      "link": "https://aws.amazon.com/blogs/machine-learning/responsible-ai-design-in-healthcare-and-life-sciences/",
      "pubDate": "2025-10-24T17:25:39.000Z",
      "source": "mlBlog",
      "services": [],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "ga"
      ]
    },
    {
      "id": "aws-news-b969c01826bf",
      "title": "Aurora DSQL now supports resource-based policies",
      "description": "Amazon Aurora DSQL now supports resource-based policies, enabling you to simplify access control for your Aurora DSQL resources. With resource-based policies, you can specify Identity and Access Management (IAM) principals and the specific IAM actions they can perform against your Aurora DSQL resources. Resource-based policies also enable you to implement Block Public Access (BPA), which helps to further restrict access to your Aurora DSQL public or VPC endpoints.\n  Aurora DSQL support for resource-based policies is available in the following AWS Regions: US East (N. Virginia), US East (Ohio), US West (Oregon), Asia Pacific (Osaka), Asia Pacific (Tokyo), Asia Pacific (Seoul), Europe (Ireland), Europe (London), Europe (Paris), and Europe (Frankfurt). To get started, visit the Aurora DSQL resource-based policies documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aurora-dsql-resource-based-policies",
      "pubDate": "2025-10-24T17:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "iam"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "iam",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-548e59908fe6",
      "title": "Amazon VPC Reachability Analyzer and Amazon VPC Network Access Analyzer are now available in AWS GovCloud (US) Regions",
      "description": "With this launch, Amazon VPC Reachability Analyzer and Amazon VPC Network Access Analyzer are now available in both AWS GovCloud (US-West) and AWS GovCloud (US-East) Regions.\n  VPC Reachability Analyzer allows you to diagnose network reachability between a source resource and a destination resource in your virtual private clouds (VPCs) by analyzing your network configurations. For example, Reachability Analyzer can help you identify a missing route table entry in your VPC route table that could be blocking network reachability between an EC2 instance in Account A that is not able to connect to another EC2 instance in Account B in your AWS Organization.\n  VPC Network Access Analyzer allows you to identify unintended network access to your AWS resources, helping you meet your security and compliance guidelines. For example, you can create a scope to verify that all paths from your web-applications to the internet, traverse the firewall, and detect any paths that bypass the firewall.\n  For more information, visit documentation for VPC Reachability Analyzer and VPC Network Access Analyzer. For pricing, refer to the Network Analysis tab on the Amazon VPC Pricing Page.",
      "link": "https://aws.amazon.comabout-aws/whats-new/2025/10/amazon-vpc-reachability-network-access-analyzer-govcloud",
      "pubDate": "2025-10-24T17:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "launch",
        "ga",
        "now-available"
      ]
    },
    {
      "id": "aws-news-f902e3002218",
      "title": "AWS Transfer Family now supports changing identity provider type on a server",
      "description": "AWS Transfer Family now enables you to change your server's identity provider (IdP) type without service interruption. This enhancement gives you more control and flexibility over authentication management in your file transfer workflows, enabling you to adapt quickly to changing business requirements.\n  AWS Transfer Family provides fully managed file transfers over SFTP, FTP, FTPS, AS2, and web-browser based interfaces. With this launch, you can now dynamically switch between service managed authentication, Active Directory, and custom IdP configurations for SFTP, FTPS, and FTP servers. This enables you to implement zero-downtime authentication migration and meet evolving compliance requirements. \n  Changing IDP type is available in all AWS Regions where the service is available. To learn more, visit the Transfer Family User Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-transfer-family-changing-idp-type",
      "pubDate": "2025-10-24T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "launch",
        "enhancement",
        "support"
      ]
    },
    {
      "id": "aws-news-b3eab0dbf681",
      "title": "Beyond pilots: A proven framework for scaling AI to production",
      "description": "In this post, we explore the Five V's Framework—a field-tested methodology that has helped 65% of AWS Generative AI Innovation Center customer projects successfully transition from concept to production, with some launching in just 45 days. The framework provides a structured approach through Value, Visualize, Validate, Verify, and Venture phases, shifting focus from \"What can AI do?\" to \"What do we need AI to do?\" while ensuring solutions deliver measurable business outcomes and sustainable operational excellence.",
      "link": "https://aws.amazon.com/blogs/machine-learning/beyond-pilots-a-proven-framework-for-scaling-ai-to-production/",
      "pubDate": "2025-10-24T14:42:41.000Z",
      "source": "mlBlog",
      "services": [
        "nova"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "nova",
        "launch"
      ]
    },
    {
      "id": "aws-news-5f20fa4f076a",
      "title": "New Amazon CloudWatch metrics to monitor EC2 instances exceeding I/O performance",
      "description": "Today, Amazon announced two new Amazon CloudWatch metrics that provide insight into when your application exceeds the I/O performance limits for your EC2 instance with attached EBS volumes. These two metrics, Instance EBS IOPS Exceeded Check and Instance EBS Throughput Exceeded Check, monitor if the driven IOPS or throughput is exceeding the maximum EBS IOPS or throughput that your instance can support.\n  With these two new metrics at the instance level, you can quickly identify and respond to application performance issues stemming from exceeding the EBS-Optimized limits of your instance. These metrics will return a value of 0 (performance not exceeded) or a 1 (performance exceeded) when your workload is exceeding the EBS-Optimized IOPS or throughput limit of the EC2 instance. With Amazon CloudWatch, you can use these new metrics to create customized dashboards and set alarms that notify you or automatically perform actions based on these metrics, such as moving to a larger instance size or a different instance type that supports higher EBS-Optimized limits.\n  The Instance EBS IOPS Exceeded Check and Instance EBS Throughput Exceeded Check metrics are available by default at a 1-minute frequency at no additional charges, for all Nitro-based Amazon EC2 instances with EBS volumes attached. You can access these metrics via the EC2 console, CLI, or CloudWatch API in all Commercial AWS Regions, including the AWS GovCloud (US) Regions and China Regions. To learn more about these CloudWatch metrics, please visit the EC2 CloudWatch Metrics documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-cloudwatch-metrics-monitor-ec2-instances-i-o-performance",
      "pubDate": "2025-10-24T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2",
        "rds",
        "cloudwatch"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "rds",
        "cloudwatch",
        "support"
      ]
    },
    {
      "id": "aws-news-98cfef58cd17",
      "title": "Amazon SageMaker Unified Studio supports Amazon Athena workgroups",
      "description": "Data engineers and data analysts using Amazon SageMaker Unified Studio can now connect to and run queries with pre-existing Amazon Athena workgroups. This feature enables data teams to run SQL queries in SageMaker Unified Studio with the default settings and properties from existing Athena workgroups. Since Athena workgroups are used to manage query access and control costs, data engineers and data analysts can save time by reusing Athena workgroups as their SQL analytics compute while maintaining data usage limits and tracking query usage by team or project. \n  When choosing a compute for SQL analytics within SageMaker Unified Studio, customers can create a new Athena compute connection or choose to connect to an existing Athena workgroup. To get started, navigate to SageMaker Unified Studio, select “Add compute” and choose “Connect to existing compute resources”. Then create a connection to your pre-existing Athena workgroups and save. This new compute is now available within the SageMaker Unified Studio query editor to run SQL queries.\n  Connecting to Athena workgroups within SageMaker Unified Studio is available in all regions where SageMaker Unified Studio is supported.\n  To learn more, refer to the SageMaker Unified Studio Guide and Athena Workgroups Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-sagemaker-unified-studio-athena-workgroups/",
      "pubDate": "2025-10-24T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "sagemaker",
        "unified studio",
        "athena"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "unified studio",
        "athena",
        "ga",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-e0919cbce33a",
      "title": "AWS Lambda increases maximum payload size from 256 KB to 1 MB for asynchronous invocations",
      "description": "AWS Lambda increases asynchronous invocations maximum payload size from 256 KB to 1 MB, allowing customers to ingest richer, complex payloads for their event-driven workloads without the need to split, compress, or externalize data. Customers invoke their Lambda functions asynchronously using either Lambda API directly, or by receiving push-based events from various AWS services like Amazon S3, Amazon CloudWatch, Amazon SNS, Amazon EventBridge, AWS Step Functions.\n  Modern cloud applications increasingly rely on AWS Lambda’s asynchronous invocations and its integration with various AWS serverless services to build scalable, event-driven architectures. These applications often need to process rich contextual data, including large-language model prompts, telemetry signals, and complex JSON structures for machine learning outputs. With increase in maximum payload size to 1MB for asynchronous invocations, developers can streamline their architectures by including comprehensive data, from detailed user profiles to complete transaction histories, in a single event, eliminating the need for complex data chunking or external storage solutions.\n  This feature is generally available in all AWS Commercial and AWS GovCloud (US) Regions. Customers can start sending asynchronous invocation payloads up to 1 MB using Lambda’s invoke API. Customers are charged for 1 request per each asynchronous invocation for first 256 KB. Individual payload size beyond 256 KB is charged 1 additional request for each 64 KB of chunk up to 1 MB. To learn more, read Lambda asynchronous invocation documentation and AWS Lambda pricing.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-lambda-payload-size-256-kb-1-mb-invocations/",
      "pubDate": "2025-10-24T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "lambda",
        "s3",
        "eventbridge",
        "step functions",
        "sns",
        "cloudwatch"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "lex",
        "lambda",
        "s3",
        "eventbridge",
        "step functions",
        "sns",
        "cloudwatch",
        "generally-available",
        "integration"
      ]
    },
    {
      "id": "aws-news-86a35a734483",
      "title": "Generate Gremlin queries using Amazon Bedrock models",
      "description": "In this post, we explore an innovative approach that converts natural language to Gremlin queries using Amazon Bedrock models such as Amazon Nova Pro, helping business analysts and data scientists access graph databases without requiring deep technical expertise. The methodology involves three key steps: extracting graph knowledge, structuring the graph similar to text-to-SQL processing, and generating executable Gremlin queries through an iterative refinement process that achieved 74.17% overall accuracy in testing.",
      "link": "https://aws.amazon.com/blogs/machine-learning/generate-gremlin-queries-using-amazon-bedrock-models/",
      "pubDate": "2025-10-23T20:57:29.000Z",
      "source": "mlBlog",
      "services": [
        "bedrock",
        "nova"
      ],
      "categories": [
        "foundation-models"
      ],
      "tags": [
        "bedrock",
        "nova"
      ]
    },
    {
      "id": "aws-news-c1e726155a72",
      "title": "Incorporating responsible AI into generative AI project prioritization",
      "description": "In this post, we explore how companies can systematically incorporate responsible AI practices into their generative AI project prioritization methodology to better evaluate business value against costs while addressing novel risks like hallucination and regulatory compliance. The post demonstrates through a practical example how conducting upfront responsible AI risk assessments can significantly change project rankings by revealing substantial mitigation work that affects overall project complexity and timeline.",
      "link": "https://aws.amazon.com/blogs/machine-learning/incorporating-responsible-ai-into-generative-ai-project-prioritization/",
      "pubDate": "2025-10-23T20:51:41.000Z",
      "source": "mlBlog",
      "services": [
        "lex"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "lex",
        "ga"
      ]
    },
    {
      "id": "aws-news-b7276fec0ee1",
      "title": "Unlock real-time data insights with schema evolution using Amazon MSK Serverless, Iceberg, and AWS Glue streaming",
      "description": "This post showcases a solution that businesses can use to access real-time data insights without the traditional delays between data creation and analysis. By combining Amazon MSK Serverless, Debezium MySQL connector, AWS Glue streaming, and Apache Iceberg tables, the architecture captures database changes instantly and makes them immediately available for analytics through Amazon Athena. A standout feature is the system's ability to automatically adapt when database structures change—such as adding new columns—without disrupting operations or requiring manual intervention.",
      "link": "https://aws.amazon.com/blogs/big-data/unlock-real-time-data-insights-with-schema-evolution-using-amazon-msk-serverless-iceberg-and-aws-glue-streaming/",
      "pubDate": "2025-10-23T19:54:50.000Z",
      "source": "bigDataBlog",
      "services": [
        "msk",
        "glue",
        "athena"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "msk",
        "glue",
        "athena"
      ]
    },
    {
      "id": "aws-news-da53636727be",
      "title": "Amazon Connect outbound campaigns supports preview dialing for greater agent control",
      "description": "Amazon Connect outbound campaigns now offers a preview dialing mode that gives agents more context about a customer before placing a call. Agents can see key customer information—such as name, account balance, and prior interactions—and choose the right moment to call. Campaign managers can tailor preview settings and monitor performance through new dashboards that bring visibility to agent behavior, campaign outcomes, and customer engagement trends.\n  Without proper context, agents struggle to personalize interactions, leading to low customer engagement and poor experiences. Additionally, businesses can face steep regulatory penalties under laws such as the U.S. Telephone Consumer Protection Act (TCPA) or the UK Office of Communications (OFCOM) for delays in customer-agent connection.\n  With preview dialing, campaign managers can define review time limits and optionally enable contact removal from campaigns. During preview, agents see a countdown timer alongside customer data and can initiate calls at any moment. Analytics reveal performance patterns—such as average preview time or discard volume—giving managers data to optimize strategy and coach teams effectively. By reserving an agent prior to placing the call, companies can support compliance with regulations while bringing precision to outbound calling, improving both customer connection and operational control.\n  With Amazon Connect outbound campaigns, companies pay-as-they-go for campaign processing and channel usage. Preview dialing is available in AWS regions, including US East (N. Virginia), US West (Oregon), Africa (Cape Town), Asia Pacific (Seoul), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Canada (Central), Europe (Frankfurt), and Europe (London).\n  To learn more about configuring preview dialing, visit our webpage.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-connect-outbound-campaigns-preview-dialing/",
      "pubDate": "2025-10-23T17:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "personalize",
        "rds"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "personalize",
        "rds",
        "preview",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-fb17a65bd193",
      "title": "Amazon Aurora DSQL is now available in Europe (Frankfurt)",
      "description": "Starting today, Amazon Aurora DSQL is now available in Europe (Frankfurt). Aurora DSQL is the fastest serverless, distributed SQL database with active-active high availability and multi-Region strong consistency. Aurora DSQL enables you to build always available applications with virtually unlimited scalability, the highest availability, and zero infrastructure management. It is designed to make scaling and resilience effortless for your applications and offers the fastest distributed SQL reads and writes.\n  Aurora DSQL is now available in the following AWS Regions: US East (N. Virginia), US East (Ohio), US West (Oregon), Asia Pacific (Osaka), Asia Pacific (Tokyo), Asia Pacific (Seoul), Europe (Ireland), Europe (London), Europe (Paris), and Europe (Frankfurt).\n  Get started with Aurora DSQL for free with the AWS Free Tier. To learn more, visit the Aurora DSQL webpage and documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-aurora-dsql-available-in-frankfurt",
      "pubDate": "2025-10-23T17:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "now-available"
      ]
    },
    {
      "id": "aws-news-8c07c7c147a6",
      "title": "Amazon Connect now provides granular permissions for conversation recordings and transcripts",
      "description": "Amazon Connect now provides granular permissions to access conversation recordings and transcripts in the UI, giving administrators greater flexibility and security control. Contact center administrators can now separately configure access to recordings and transcripts, allowing users to listen to calls while preventing unauthorized copying of transcripts. The system also provides flexible download controls, enabling users to download redacted recordings while restricting downloads of unredacted versions. Administrators can also create sophisticated permission scenarios, providing access to redacted recordings of sensitive conversations while granting unredacted recording access for other conversations.\n  This feature is available in all regions where Amazon Connect is offered. To learn more, please visit our documentation and our webpage.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-connect-granular-permissions-conversation-recordings-transcripts/",
      "pubDate": "2025-10-23T17:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex"
      ]
    },
    {
      "id": "aws-news-e621226bcfb0",
      "title": "AWS Outposts 2U server is now available in the AWS GovCloud (US) Regions",
      "description": "AWS Outposts 2U server is now supported in the AWS GovCloud (US-East) and AWS GovCloud (US-West) Regions. Outposts 2U server is a fully managed service that extends AWS infrastructure, AWS services, APIs, and tools to on-premises or edge locations with limited space or smaller capacity requirements for a truly consistent hybrid experience. It is delivered in an industry-standard 2U form factor and provides up to 128 vCPUs of compute. It is ideal for applications that need to run on-premises to meet low latency and stringent compliance requirements. You can also use Outposts 2U server to manage your local data processing needs.\n \nWith the availability of Outposts 2U server in the GovCloud (US-East) and GovCloud (US-West) Regions, you can now run Amazon Elastic Compute Cloud (Amazon EC2), Amazon Elastic Container Service (Amazon ECS), and AWS IoT Greengrass locally on Outposts 2U servers, and connect to a broader range of AWS services available in the parent AWS GovCloud (US) Region. For AWS GovCloud (US) Regions customers, this means you can run sensitive and controlled unclassified information (CUI) data on-premises at your facilities and connect to the parent AWS GovCloud (US) Region for management and operations.\n \nTo learn more about Outposts 2U server, visit the product page and read the user guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-outposts-2u-server-govcloud-regions",
      "pubDate": "2025-10-23T16:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2",
        "ecs",
        "outposts"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "ecs",
        "outposts",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-19d9fd03b349",
      "title": "Amazon DynamoDB zero-ETL integration with Amazon Redshift now available in the Asia Pacific (Taipei) region",
      "description": "Amazon DynamoDB zero-ETL integration with Amazon Redshift is now supported in the Asia Pacific (Taipei) region. This expansion enables customers to run high-performance analytics on their DynamoDB data in Amazon Redshift with no impact on production workloads running on DynamoDB. \n  Zero-ETL integrations help you derive holistic insights across many applications, break data silos in your organization, and gain significant cost savings and operational efficiencies. Now you can run enhanced analysis on your DynamoDB data with the rich capabilities of Amazon Redshift, such as high performance SQL, built-in ML and Spark integrations, materialized views with automatic and incremental refresh, and data sharing. Additionally, you can use history mode to easily run advanced analytics on historical data, build lookback reports, and build Type 2 Slowly Changing Dimension (SCD 2) tables on your historical data from DynamoDB, out-of-the-box in Amazon Redshift, without writing any code.\n  The Amazon DynamoDB zero-ETL integration with Amazon Redshift is now available in Asia Pacific (Taipei), in addition to previously supported regions. For a complete list of supported regions, please refer to the AWS Region Table where Amazon Redshift is available.\n  To learn more, visit the getting started guides for DynamoDB and Amazon Redshift. For more information on using history mode, we encourage you to visit our recent blog post here.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-dynamodb-zero-etl-integration-redshift-asia-pacific-taipei-region",
      "pubDate": "2025-10-23T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "redshift",
        "dynamodb"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "redshift",
        "dynamodb",
        "ga",
        "now-available",
        "integration",
        "support",
        "expansion"
      ]
    },
    {
      "id": "aws-news-58c630dbdb44",
      "title": "Amazon Quick Sight announces the general availability of a new data preparation experience",
      "description": "Amazon Quick Sight, a capability of Amazon Quick Suite, now offers a visual data preparation experience that helps business users perform advanced data transformations without writing complex code. Users can now clean, transform, and combine data in multi-step workflows—appending tables, aggregating data, executing flexible joins, and other advanced operations that previously required custom programming or SQL commands.\n  Users can easily track data transformations step-by-step, enhancing traceability and shareability. With the ability to utilize datasets as a source expanded from 3 to 10 levels, teams can build reusable transformation logic that cascades across departments. For instance, centralized data analysts can now prepare foundational data sets that can then be further customized by regional business users, applying territory-specific calculations and business logic with simple clicks. The enhanced experience now also supports 20X larger cross-source joins, moving from a previous capacity of 1GB to 20GB today.\n  This feature is available to Quick Sight Author and Author Pro customers in the following regions: US East (N.Virginia and Ohio), US West (Oregon), Canada (Central), South America (Sao Paulo), Europe (Frankfurt, Milan, Paris, Spain, Stockholm, Ireland, London, Zurich), Africa (Cape Town), Middle East (UAE), Israel (Tel Aviv), Asia Pacific (Jakarta, Mumbai, Singapore, Tokyo, Seoul, Sydney), AWS GovCloud (US-West, US- East) and to Quick Suite Enterprise subscribers in US East (N. Virginia), US West (Oregon), Asia Pacific (Sydney), and Europe (Ireland). For more details, read our documentation here.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-quick-sight-general-availability-data-preparation-experience",
      "pubDate": "2025-10-23T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "amazon q",
        "lex"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "amazon q",
        "lex",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-1892be311751",
      "title": "Now generally available: AWS RTB Fabric for real-time bidding workloads",
      "description": "Today, AWS announces RTB Fabric, a fully managed service that helps you connect with your AdTech partners such as Amazon Ads, GumGum, Kargo, MobileFuse, Sovrn, TripleLift, Viant, Yieldmo, and more in three steps while delivering single-digit millisecond latency through a private, high-performance network environment. RTB Fabric reduces standard cloud networking costs by up to 80% and does not require upfront commitments.\n \nThe service includes modules, a capability that helps you bring your own and partner applications securely into the compute environment for real-time bidding. Modules support containerized applications and foundation models (FMs) that can enhance transaction efficiency and bidding effectiveness. Today, AWS RTB Fabric launches with three built-in modules to help you optimize traffic, improve bid efficiency, and increase bid response rates—all running inline for consistent low-latency execution. AWS RTB Fabric helps you to optimize auction execution, maximize supply monetization, and increase publisher revenue. You can connect with AdTech companies faster to reach target audiences, increase campaign scale, and improve performance for higher return on ad spend.\n \nAWS RTB Fabric is generally available in the following AWS Regions: US East (N. Virginia), US West (Oregon), Asia Pacific (Singapore), Asia Pacific (Tokyo), Europe (Frankfurt), and Europe (Ireland).. To learn more, read the Blog, Documentation, or visit the AWS RTB Fabric product page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-rtb-fabric-generally-available/",
      "pubDate": "2025-10-23T08:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "foundation-models"
      ],
      "tags": [
        "launch",
        "generally-available",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-e1aead73d5d9",
      "title": "Amazon EC2 I8g instances now available in additional AWS regions",
      "description": "AWS is announcing the general availability of Amazon EC2 Storage Optimized I8g instances in Europe (London), Asia Pacific (Singapore), and Asia Pacific (Tokyo) regions. I8g instances offer the best performance in Amazon EC2 for storage-intensive workloads. I8g instances are powered by AWS Graviton4 processors that deliver up to 60% better compute performance compared to previous generation I4g instances. I8g instances use the latest third generation AWS Nitro SSDs, local NVMe storage that deliver up to 65% better real-time storage performance per TB while offering up to 50% lower storage I/O latency and up to 60% lower storage I/O latency variability. These instances are built on the AWS Nitro System, which oﬄoads CPU virtualization, storage, and networking functions to dedicated hardware and software enhancing the performance and security for your workloads.\n  Amazon EC2 I8g instances are designed for I/O intensive workloads that require rapid data access and real-time latency from storage. These instances excel at handling transactional, real-time, distributed databases, including MySQL, PostgreSQL, Hbase and NoSQL solutions like Aerospike, MongoDB, ClickHouse, and Apache Druid. They're also optimized for real-time analytics platforms such as Apache Spark, data lakehouse and AI LLM pre-processing for training. I8g instances are available in 10 different sizes with up to 48xlarge including one metal size, 1.5 TiB of memory, and 45 TB local instance storage. They deliver up to 100 Gbps of network performance bandwidth, and 60 Gbps of dedicated bandwidth for Amazon Elastic Block Store (EBS).\n  To learn more, visit EC2 I8g instances.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-ec2-i8g-instances-available-in-additional-aws/",
      "pubDate": "2025-10-23T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2",
        "graviton"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "ec2",
        "graviton",
        "ga",
        "now-available"
      ]
    },
    {
      "id": "aws-news-a2db976a9cdf",
      "title": "Amazon Connect now supports threaded views and includes conversation history in agent replies",
      "description": "Amazon Connect now includes the conversation history in agent replies and introduces threaded views of email exchanges, making it easier for both agents and customers to maintain context and continuity across interactions. This enhancement provides a more natural and familiar email experience for both agents and customers.\n  Amazon Connect Email is available in the US East (N. Virginia), US West (Oregon), Africa (Cape Town), Asia Pacific (Seoul), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Canada (Central), Europe (Frankfurt), and Europe (London) regions. To learn more and get started, please refer to the help documentation, pricing page, or visit the Amazon Connect website.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-connect-threaded-views-conversation-history/",
      "pubDate": "2025-10-23T07:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga",
        "enhancement",
        "support"
      ]
    },
    {
      "id": "aws-news-a68cc34788e6",
      "title": "Build scalable creative solutions for product teams with Amazon Bedrock",
      "description": "In this post, we explore how product teams can leverage Amazon Bedrock and AWS services to transform their creative workflows through generative AI, enabling rapid content iteration across multiple formats while maintaining brand consistency and compliance. The solution demonstrates how teams can deploy a scalable generative AI application that accelerates everything from product descriptions and marketing copy to visual concepts and video content, significantly reducing time to market while enhancing creative quality.",
      "link": "https://aws.amazon.com/blogs/machine-learning/build-scalable-creative-solutions-for-product-teams-with-amazon-bedrock/",
      "pubDate": "2025-10-22T23:02:04.000Z",
      "source": "mlBlog",
      "services": [
        "bedrock"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "bedrock"
      ]
    },
    {
      "id": "aws-news-b147351ed9fa",
      "title": "Upgrade from Amazon Redshift DC2 node type to Amazon Redshift Serverless",
      "description": "In this post, we show you the upgrade process from DC2 instances to Amazon Redshift Serverless. By using Amazon Redshift Serverless, you can run and scale analytics without managing data warehouse infrastructure.",
      "link": "https://aws.amazon.com/blogs/big-data/upgrade-from-amazon-redshift-dc2-node-type-to-amazon-redshift-serverless/",
      "pubDate": "2025-10-22T21:04:31.000Z",
      "source": "bigDataBlog",
      "services": [
        "redshift"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "redshift"
      ]
    },
    {
      "id": "aws-news-6b8927b02983",
      "title": "Breaking down monolith workflows: Modularizing AWS Step Functions workflows",
      "description": "You can use AWS Step Functions to orchestrate complex business problems. However, as workflows grow and evolve, you can find yourself grappling with monolithic state machines that become increasingly difficult to maintain and update. In this post, we show you strategies for decomposing large Step Functions workflows into modular, maintainable components.",
      "link": "https://aws.amazon.com/blogs/compute/breaking-down-monolith-workflows-modularizing-aws-step-functions-workflows/",
      "pubDate": "2025-10-22T21:02:22.000Z",
      "source": "computeBlog",
      "services": [
        "lex",
        "step functions"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "step functions",
        "update"
      ]
    },
    {
      "id": "aws-news-c0b42ee33a26",
      "title": "Build a proactive AI cost management system for Amazon Bedrock – Part 2",
      "description": "In this post, we explore advanced cost monitoring strategies for Amazon Bedrock deployments, introducing granular custom tagging approaches for precise cost allocation and comprehensive reporting mechanisms that build upon the proactive cost management foundation established in Part 1. The solution demonstrates how to implement invocation-level tagging, application inference profiles, and integration with AWS Cost Explorer to create a complete 360-degree view of generative AI usage and expenses.",
      "link": "https://aws.amazon.com/blogs/machine-learning/build-a-proactive-ai-cost-management-system-for-amazon-bedrock-part-2/",
      "pubDate": "2025-10-22T18:58:16.000Z",
      "source": "mlBlog",
      "services": [
        "bedrock"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "bedrock",
        "integration"
      ]
    },
    {
      "id": "aws-news-280196bc4877",
      "title": "Build a proactive AI cost management system for Amazon Bedrock – Part 1",
      "description": "In this post, we introduce a comprehensive solution for proactively managing Amazon Bedrock inference costs through a cost sentry mechanism designed to establish and enforce token usage limits, providing organizations with a robust framework for controlling generative AI expenses. The solution uses serverless workflows and native Amazon Bedrock integration to deliver a predictable, cost-effective approach that aligns with organizational financial constraints while preventing runaway costs through leading indicators and real-time budget enforcement.",
      "link": "https://aws.amazon.com/blogs/machine-learning/build-a-proactive-ai-cost-management-system-for-amazon-bedrock-part-1/",
      "pubDate": "2025-10-22T18:58:05.000Z",
      "source": "mlBlog",
      "services": [
        "bedrock",
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "bedrock",
        "organizations",
        "ga",
        "integration"
      ]
    },
    {
      "id": "aws-news-84c8038a250f",
      "title": "Streamline code migration using Amazon Nova Premier with an agentic workflow",
      "description": "In this post, we demonstrate how Amazon Nova Premier with Amazon Bedrock can systematically migrate legacy C code to modern Java/Spring applications using an intelligent agentic workflow that breaks down complex conversions into specialized agent roles. The solution reduces migration time and costs while improving code quality through automated validation, security assessment, and iterative refinement processes that handle even large codebases exceeding token limitations.",
      "link": "https://aws.amazon.com/blogs/machine-learning/streamline-code-migration-using-amazon-nova-premier-with-an-agentic-workflow/",
      "pubDate": "2025-10-22T18:48:48.000Z",
      "source": "mlBlog",
      "services": [
        "bedrock",
        "nova",
        "lex"
      ],
      "categories": [
        "foundation-models"
      ],
      "tags": [
        "bedrock",
        "nova",
        "lex",
        "ga"
      ]
    },
    {
      "id": "aws-news-1c1dddaf6ab7",
      "title": "Customer Carbon Footprint Tool Expands: Additional emissions categories including Scope 3 are now available",
      "description": "AWS has expanded its Customer Carbon Footprint Tool (CCFT) to include Scope 3 emissions data alongside updated Scope 1 and 2 emissions, giving customers more insight into their carbon impact. The CCFT now tracks emissions from fuel- and energy-related activities (FERA), IT hardware, buildings, equipment, and transportation. AWS customers can access this information and track changes over time through the AWS Billing console.",
      "link": "https://aws.amazon.com/blogs/aws/aws-customer-carbon-footprint-tool-now-includes-scope-3-emissions/",
      "pubDate": "2025-10-22T17:48:18.000Z",
      "source": "newsBlog",
      "services": [],
      "categories": [
        "news"
      ],
      "tags": [
        "now-available",
        "update"
      ]
    },
    {
      "id": "aws-news-442279e3e2a5",
      "title": "AWS Secret-West Region is now available",
      "description": "Amazon Web Services (AWS) is excited to announce the launch of our second Secret Region - AWS Secret-West. With this launch, AWS now offers two regions capable of operating mission-critical workloads at the Secret U.S. security classification level. AWS Secret-West places cloud resources in closer proximity to users and mission in the western U.S., delivering enhanced performance for latency-sensitive workloads and improving operational efficiency. Additionally, the region provides customers with multi-region resiliency capabilities and geographic separation to best meet their U.S. Government mission requirements.\n  Architected for Security and Compliance\n Security is the highest priority at AWS. With the AWS Secret-West Region, customers benefit from data centers and network architecture designed, built, accredited, and operated for security compliance with Intelligence Community Directive (ICD) requirements. The region features multiple Availability Zones, providing the high availability, fault tolerance, and resilience that mission-critical workloads require.\n  Mission Workload Support\n The AWS Secret-West Region allows customers to:\n • Build and run mission-critical applications with enhanced geographic distribution\n • Process and analyze sensitive data across multiple regions\n • Deploy robust disaster recovery strategies\n • Leverage comprehensive compute and storage solutions located in the western U.S.\n • Utilize services authorized at ICD 503 and Department of Defense (DoD) Security Requirements Guide (SRG) Impact Level (IL6) supporting Intelligence Community and Department of Defense authority to operate mission needs.\n  To learn more about the AWS Secret-West Region and how to get started, contact us.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-secret-west-region-is-now-available",
      "pubDate": "2025-10-22T17:04:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "launch",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-ff58ed620495",
      "title": "Amazon CloudWatch introduces interactive incident reporting",
      "description": "Amazon CloudWatch now offers interactive incident report generation, enabling customers to create comprehensive post-incident analysis reports in minutes. The new capability, available within CloudWatch investigations, automatically gathers and correlates your telemetry data, as well as your input and any actions taken during an investigation, and produces a streamlined incident report.\n  Using the new feature you can automatically capture critical operational telemetry, service configurations, and investigation findings to generate detailed reports. Reports include executive summaries, timeline of events, impact assessments, and actionable recommendations. These reports help you better identify patterns, implement preventive measures, and continuously improve your operational posture through structured post incident analysis.\n  The incident report generation feature is available in US East (N. Virginia), US East (Ohio), US West (Oregon), Asia Pacific (Hong Kong), Asia Pacific (Mumbai), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Europe (Frankfurt), Europe (Ireland), Europe (Spain), and Europe (Stockholm).\n  You can create their first incident report by first creating a CloudWatch investigation and then clicking “Incident report”. To learn more about this new feature, visit the CloudWatch incident reports documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-cloudwatch-incident-report/",
      "pubDate": "2025-10-22T16:52:00.000Z",
      "source": "whatsNew",
      "services": [
        "cloudwatch"
      ],
      "categories": [
        "ai-services"
      ],
      "tags": [
        "cloudwatch",
        "ga",
        "new-feature",
        "new-capability"
      ]
    },
    {
      "id": "aws-news-3d4a6ffbaa2c",
      "title": "Amazon U7i instances now available in AWS US East (Ohio) Region",
      "description": "Starting today, Amazon EC2 High Memory U7i instances with 6TB of memory (u7i-6tb.112xlarge) are now available in the US East (Ohio) region. U7i-6tb instances are part of AWS 7th generation and are powered by custom fourth generation Intel Xeon Scalable Processors (Sapphire Rapids). U7i-6tb instances offer 6TB of DDR5 memory, enabling customers to scale transaction processing throughput in a fast-growing data environment.\n  U7i-6tb instances offer 448 vCPUs, support up to 100Gbps Elastic Block Storage (EBS) for faster data loading and backups, deliver up to 100Gbps of network bandwidth, and support ENA Express. U7i instances are ideal for customers using mission-critical in-memory databases like SAP HANA, Oracle, and SQL Server.\n  To learn more about U7i instances, visit the High Memory instances page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-u7i-instances-available-aws-us-east-ohio-region/",
      "pubDate": "2025-10-22T16:46:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "ec2",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-360e834c997a",
      "title": "BASF Digital Farming builds a STAC-based solution on Amazon EKS",
      "description": "This post was co-written with Frederic Haase and Julian Blau with BASF Digital Farming GmbH. At xarvio – BASF Digital Farming, our mission is to empower farmers around the world with cutting-edge digital agronomic decision-making tools. Central to this mission is our crop optimization platform, xarvio FIELD MANAGER, which delivers actionable insights through a range […]",
      "link": "https://aws.amazon.com/blogs/architecture/basf-digital-farming-builds-a-stac-based-solution-on-amazon-eks/",
      "pubDate": "2025-10-22T16:21:09.000Z",
      "source": "architectureBlog",
      "services": [
        "eks"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "eks"
      ]
    },
    {
      "id": "aws-news-e18b0e809647",
      "title": "Amazon DCV releases version 2025.0 with enhanced keyboard handling and WebAuthn support",
      "description": "AWS announces Amazon DCV 2025.0, the latest version of the high-performance remote display protocol that enables customers to securely access remote desktops and application sessions. This release focuses on enhancing user productivity and security while expanding platform compatibility for diverse use cases.\n  Amazon DCV 2025.0 includes the following key features and improvements:\n  \n \n \nEnhanced WebAuthn redirection on Windows and standard browser-based WebAuthn support on Linux, enabling security key authentication (like Yubikeys, Windows Hello) in native Windows and SaaS applications within virtual desktop sessions\n \n \nLinux client support for ARM architecture, further broadening compatibility and performance\n \n \nWindows Server 2025 support, delivering latest security standards and enhanced performance on DCV hosts\n \n \nServer side keyboard layout support and layout alignment for Windows clients, enhancing input reliability and consistency\n \n \nScroll wheel optimizations for smoother navigation\n \n \nFor more information about the new features and enhancements in Amazon DCV 2025.0, see the release notes or visit the Amazon DCV webpage to learn more and get started.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-dvc-releases-version-2025-0",
      "pubDate": "2025-10-22T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "rds"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "rds",
        "ga",
        "new-feature",
        "improvement",
        "enhancement",
        "support"
      ]
    },
    {
      "id": "aws-news-f7a499ca3343",
      "title": "Amazon S3 now generates AWS CloudTrail events for S3 Tables maintenance operations",
      "description": "Amazon S3 adds AWS CloudTrail events for table maintenance activities in Amazon S3 Tables. You can now use AWS CloudTrail to track compaction and snapshot expiration operations performed by S3 Tables on your tables.\n  S3 Tables automatically performs maintenance to optimize query performance and lower costs of your tables stored in S3 table buckets. You can monitor and audit S3 Tables maintenance activities such as compaction and snapshot expiration as management events in AWS CloudTrail. To get started with monitoring, create a trail in the AWS CloudTrail console and filter for 'AwsServiceEvents' as the eventType and 'TablesMaintenanceEvent' as the eventName.\n  AWS CloudTrail events for S3 Tables maintenance are now available in all AWS Regions where S3 Tables are available. To learn more, visit Amazon S3 Tables product page and documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-s3-generates-aws-cloudtrail-events",
      "pubDate": "2025-10-22T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "s3"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "s3",
        "now-available"
      ]
    },
    {
      "id": "aws-news-296ede5a4ed7",
      "title": "Amazon Redshift auto-copy is now available in 4 additional AWS regions",
      "description": "Amazon Redshift auto-copy is now available in the AWS Asia Pacific (Malaysia), Asia Pacific (Thailand), Mexico (Central), and Asia Pacific (Taipei) regions. With Auto-Copy, you can set up continuous file ingestion from your Amazon S3 prefix and automatically load new files to tables in your Amazon Redshift data warehouse without the need for additional tools or custom solutions.\n  Previously, Amazon Redshift customers had to build their data pipelines using COPY commands to automate continuous loading of data from S3 to Amazon Redshift tables. With auto-copy, you can now setup an integration which will automatically detect and load new files in a specified S3 prefix to Redshift tables. The auto-copy jobs keep track of previously loaded files and exclude them from the ingestion process. You can monitor auto-copy jobs using system tables.\n  To learn more, see the documentation or check out the AWS Blog.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-redshift-auto-copy-additional-aws-regions",
      "pubDate": "2025-10-22T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "s3",
        "redshift"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "s3",
        "redshift",
        "now-available",
        "integration"
      ]
    },
    {
      "id": "aws-news-cde0df35d350",
      "title": "Amazon CloudWatch Agent adds support for Windows Event Log Filters",
      "description": "Amazon CloudWatch agent has added support for configurable Windows Event log filters. This new feature allows customers to selectively collect and send system and application events to CloudWatch from Windows hosts running on Amazon EC2 or on-premises. The addition of customizable filters helps customers to focus on events that meet specific criteria, streamlining log management and analysis.\n  Using this new functionality of the CloudWatch agent, you can define filter criteria for each Windows Event log stream in the agent configuration file. The filtering options include event levels, event IDs, and regular expressions to either \"include\" or \"exclude\" text within events. The agent evaluates each log event against your defined filter criteria to determine whether it should be sent to CloudWatch. Events that don't match your criteria are discarded. Windows event filters help you to manage your log ingestion by processing only the events you need, such as those containing specific error codes, while excluding verbose or unwanted log entries.\n  Amazon CloudWatch Agent is available in all commercial AWS Regions, and the AWS GovCloud (US) Regions.\n  To get started, see Create or Edit the CloudWatch Agent Configuration File in the Amazon CloudWatch User Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-cloudwatch-agent-windows-event-log-filters",
      "pubDate": "2025-10-22T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2",
        "cloudwatch"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "cloudwatch",
        "ga",
        "new-feature",
        "support"
      ]
    },
    {
      "id": "aws-news-91fedc222546",
      "title": "Amazon EKS Auto Mode now available in AWS GovCloud (US-East) and (US-West)",
      "description": "Amazon Elastic Kubernetes Service (Amazon EKS) Auto Mode is now available in the AWS GovCloud (US-East) and (US-West) regions. This feature fully automates compute, storage, and networking management for Kubernetes clusters. Additionally, EKS Auto Mode now supports FIPS-validated cryptographic modules through its Amazon Machine Images (AMIs) to help customers meet FedRAMP compliance requirements.\n  EKS Auto Mode enables organizations to get Kubernetes conformant managed compute, networking, and storage for any new or existing EKS cluster. Its AMIs include FIPS-compliant cryptographic modules to help meet federal security standards for regulated workloads. EKS Auto Mode manages OS patching and updates, and strengthens security posture through ephemeral compute, making it ideal for workloads that require high security standards. It also dynamically scales EC2 instances based on demand, helping optimize compute costs while maintaining application availability.\n  Amazon EKS Auto Mode is now available in AWS GovCloud (US-East) and (US-West). You can enable EKS Auto Mode in any EKS cluster running Kubernetes 1.29 and above with no upfront fees or commitments—you pay for the management of the compute resources provisioned, in addition to your regular EC2 costs.\n  To get started with EKS Auto Mode, visit the Amazon EKS product page. For additional details, see the Amazon EKS User Guide and AWS GovCloud (US) documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-eks-auto-mode-aws-govcloud-us-east-west",
      "pubDate": "2025-10-22T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2",
        "rds",
        "eks",
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "ec2",
        "rds",
        "eks",
        "organizations",
        "ga",
        "now-available",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-55e105851b9b",
      "title": "Amazon Location Service Introduces New Map Styling Features for Enhanced Customization",
      "description": "Today, AWS announced enhanced map styling features for Amazon Location Service, enabling users to further customize maps with terrain visualization, contour lines, real-time traffic data, and transportation-specific routing information. Developers can create more detailed and informative maps tailored for various use cases, such as outdoor navigation, logistics planning, and traffic management, by leveraging parameters like terrain, contour-density, traffic, and travel-mode through the GetStyleDescriptor API.\n  With these styling capabilities, users can overlay real-time traffic conditions, visualize transportation-specific routing information such as transit and trucks, and display topographic features through elevation shading. For instance, developers can display current traffic conditions for optimized route planning, show truck-specific routing restrictions for logistics applications, or create maps that highlight physical terrain details for hiking and outdoor activities. Each feature operates seamlessly, providing enhanced map visualization and reliable performance for diverse use cases.\n  These new map styling features are available in the following AWS Regions: US East (Ohio), US East (N. Virginia), US West (Oregon), Asia Pacific (Mumbai), Asia Pacific (Sydney), Asia Pacific (Tokyo), Canada (Central), Europe (Frankfurt), Europe (Ireland), Europe (London), Europe (Stockholm), Europe (Spain), and South America (São Paulo). To learn more, please visit the Developer Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-location-services-new-map-styling-enchanced-customization",
      "pubDate": "2025-10-22T14:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "ga"
      ]
    },
    {
      "id": "aws-news-6264980d4817",
      "title": "Amazon CloudWatch Synthetics now supports bundled multi-check canaries",
      "description": "Amazon CloudWatch Synthetics introduces multi-check blueprints, enabling customers to create comprehensive synthetic tests using simple JSON configuration files. This new feature addresses the challenge many customers face when developing custom scripts for basic endpoint monitoring, which often lack the depth needed for thorough synthetic testing across various check types like HTTP endpoints with different authentication methods, DNS record validation, SSL certificate monitoring, and TCP port checks.\n  With multi-check blueprints, customers can now bundle up to 10 different monitoring steps, one step per endpoint, in a single canary, making API monitoring more cost-effective and easier to implement. The solution provides built-in support for complex assertions on response codes, latency, headers, and body content, along with seamless integration with AWS Secrets Manager for secure credential handling. Customers benefit from detailed step-by-step results and debugging capabilities through the existing CloudWatch Synthetics console, significantly simplifying the process of implementing comprehensive API monitoring compared to writing individual custom canaries for each check. This feature streamlines monitoring workflows, reduces costs, and enhances the overall efficiency of synthetic monitoring setups.\n  Multi-check blueprints are available in all commercial AWS regions where Amazon CloudWatch Synthetics is offered. For pricing details, see Amazon CloudWatch pricing. To learn more about multi-check blueprints and how to get started, see the CloudWatch Synthetics Canaries Blueprints documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-cloudwatch-synthetics-bundled-multi-check-canaries",
      "pubDate": "2025-10-22T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "secrets manager",
        "cloudwatch"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "secrets manager",
        "cloudwatch",
        "new-feature",
        "integration",
        "support"
      ]
    },
    {
      "id": "aws-news-81652e95d35c",
      "title": "Metagenomi generates millions of novel enzymes cost-effectively using AWS Inferentia",
      "description": "In this post, we detail how Metagenomi partnered with AWS to implement the Progen2 protein language model on AWS Inferentia, achieving up to 56% cost reduction for high-throughput enzyme generation workflows. The implementation enabled cost-effective generation of millions of novel enzyme variants using EC2 Inf2 Spot Instances and AWS Batch, demonstrating how cloud-based generative AI can make large-scale protein design more accessible for biotechnology applications .",
      "link": "https://aws.amazon.com/blogs/machine-learning/metagenomi-generates-millions-of-novel-enzymes-cost-effectively-using-aws-inferentia/",
      "pubDate": "2025-10-22T13:53:20.000Z",
      "source": "mlBlog",
      "services": [
        "inferentia",
        "ec2"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "inferentia",
        "ec2"
      ]
    },
    {
      "id": "aws-news-4c75acc2ab71",
      "title": "Amazon RDS for SQL Server now supports retaining CDC configurations when restoring database backups",
      "description": "Amazon Relational Database Service (Amazon RDS) for SQL Server now allows maintaining Change Data Capture (CDC) settings and metadata when restoring native database backups. CDC is a Microsoft SQL Server feature that customers can use to record insert, update, and delete operations occurring in a database table, and make these changes accessible to applications. When a database is restored from a backup, CDC configurations and data are not preserved by default, which can result in gaps in data capture. With this new feature, customers can preserve their database CDC settings when restoring a database backup to a new instance, or a different database name.\n  To retain CDC configurations, customers can specify the KEEP_CDC option when restoring a database backup. This option ensures that the CDC metadata and any captured change data are kept intact. Refer to the Amazon RDS for SQL Server User Guide to learn more about KEEP_CDC. This feature is available in all AWS Regions where Amazon RDS for SQL Server is available.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-rds-sql-server-retaining-cdc/",
      "pubDate": "2025-10-22T07:36:00.000Z",
      "source": "whatsNew",
      "services": [
        "rds"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "rds",
        "ga",
        "new-feature",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-f35c600a1583",
      "title": "AWS Parallel Computing Service (PCS) now supports rotation of cluster secret keys",
      "description": "AWS Parallel Computing Service (PCS) now supports rotation of cluster secret keys using AWS Secrets Manager, enabling you to update the secure credentials used for authentication between Slurm controller and compute nodes without creating a new cluster. Regularly rotating your Slurm cluster secret keys strengthens your security posture by reducing the risk of credential compromise and ensuring compliance with best practices. This helps keep your HPC workloads and accounting data safe from unauthorized access.\n  PCS is a managed service that makes it easier to run and scale high performance computing (HPC) workloads on AWS using Slurm. With the support of cluster secret rotation in PCS, you can strengthen your security controls and maintain operational efficiency. You can now implement secret rotation as part of your security best practices while maintaining cluster continuity.\n  This feature is available in all AWS Regions where PCS is available. You can rotate cluster secrets using either the AWS Secrets Manager console or API after preparing your cluster for the rotation process. Read more about PCS support for cluster secret rotation in the PCS User Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-parallel-computing-service-rotation-cluster-secret-keys/",
      "pubDate": "2025-10-22T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "secrets manager"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "secrets manager",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-4a3512637f4d",
      "title": "Amazon EC2 C7i-flex instances are now available in the Asia Pacific (Jakarta) Region",
      "description": "Starting today, Amazon Elastic Compute Cloud (Amazon EC2) C7i-flex instances that deliver up to 19% better price performance compared to C6i instances, are available in the Asia Pacific (Jakarta) Region. C7i-flex instances expand the EC2 Flex instances portfolio to provide the easiest way for you to get price performance benefits for a majority of compute intensive workloads. The new instances are powered by the 4th generation Intel Xeon Scalable custom processors (Sapphire Rapids) that are available only on AWS, and offer 5% lower prices compared to C7i.\n  C7i-flex instances offer the most common sizes, from large to 16xlarge, and are a great first choice for applications that don't fully utilize all compute resources. With C7i-flex instances, you can seamlessly run web and application servers, databases, caches, Apache Kafka, and Elasticsearch, and more. For compute-intensive workloads that need larger instance sizes (up to 192 vCPUs and 384 GiB memory) or continuous high CPU usage, you can leverage C7i instances.\n  To learn more, visit Amazon EC2 C7i-flex instances. To get started, see the AWS Management Console.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-ec2-c7i-flex-instances-jakarta-region/",
      "pubDate": "2025-10-22T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "ec2",
        "kafka"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "lex",
        "ec2",
        "kafka",
        "now-available"
      ]
    },
    {
      "id": "aws-news-61a7491573f9",
      "title": "Amazon MQ is now available in AWS Asia Pacific (New Zealand) Region",
      "description": "Amazon MQ is now available in the AWS Asia Pacific (New Zealand) Region with three Availability Zones and API name ap-southeast-6. With this launch, Amazon MQ is now available in a total of 38 regions.\n  Amazon MQ is a managed message broker service for open-source Apache ActiveMQ and RabbitMQ that makes it easier to set up and operate message brokers on AWS. Amazon MQ reduces your operational responsibilities by managing the provisioning, setup, and maintenance of message brokers for you. Because Amazon MQ connects to your current applications with industry-standard APIs and protocols, you can more easily migrate to AWS without having to rewrite code.\n  For more information, please visit the Amazon MQ product page, and see the AWS Region Table for complete regional availability.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-mq-asia-pacific-new-zealand-region/",
      "pubDate": "2025-10-22T07:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "launch",
        "now-available"
      ]
    },
    {
      "id": "aws-news-1da2b8897a46",
      "title": "AWS’ Customer Carbon Footprint Tool now includes Scope 3 emissions data",
      "description": "Today, AWS’ Customer Carbon Footprint Tool (CCFT) has been updated to include Scope 3 emissions data and Scope 1 natural gas and refrigerants, providing AWS customers more complete visibility into their cloud carbon footprint. This update expands the CCFT to cover all three industry-standard emission scopes as defined by the Greenhouse Gas Protocol.\n \nThe CCFT Scope 3 update gives AWS customers full visibility into the lifecycle carbon impact of their AWS usage, including emissions from manufacturing the servers that run their workloads, powering AWS facilities, and transporting equipment to data centers. Historical data is available back to January 2022, allowing organizations to track their progress over time and make informed decisions about their cloud strategy to meet their sustainability goals. This data is available through the CCFT dashboard and AWS Billing and Cost Management Data Exports, enabling customers to easily incorporate carbon insights into their operational workflows, sustainability planning, and reporting processes.\n \nTo learn more about the enhanced Customer Carbon Footprint Tool, visit the CCFT Website, AWS Billing and Cost Management console or read the updated methodology documentation and release notes.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-customer-carbon-footprint-tool-scope-3-emissions-data",
      "pubDate": "2025-10-22T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "organizations",
        "ga",
        "update"
      ]
    },
    {
      "id": "aws-news-6a8726bc260d",
      "title": "Amazon DocumentDB (with MongoDB compatibility) now supports Graviton4-based R8g database instances",
      "description": "AWS Graviton4-based R8g database instances are now generally available for Amazon DocumentDB (with MongoDB compatibility). R8g instances are powered by AWS Graviton4 processors and feature the latest DDR5 memory, making it ideal for memory-intensive workloads. These instances are built on the AWS Nitro System, which oﬄoads CPU virtualization, storage, and networking functions to dedicated hardware and software to enhance the performance and security of your workloads.\n  Customers can get started with R8g instances through the AWS Management Console, CLI, and SDK by modifying their existing Amazon DocumentDB database cluster or creating a new one. R8g instances are available for Amazon DocumentDB 5.0 on both Standard and IO-Optimized cluster storage configurations. For more information including region availability visit our pricing page and documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-documentdb-graviton4-based-r8g-database-instances/",
      "pubDate": "2025-10-22T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "graviton"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "graviton",
        "generally-available",
        "support"
      ]
    },
    {
      "id": "aws-news-9b9902b865f4",
      "title": "Amazon S3 Metadata is now available in three additional AWS Regions",
      "description": "Amazon S3 Metadata is now available in three additional AWS Regions: Europe (Frankfurt), Europe (Ireland), and Asia Pacific (Tokyo).\n  Amazon S3 Metadata is the easiest and fastest way to help you instantly discover and understand your S3 data with automated, easily-queried metadata that updates in near real-time. This helps you to curate, identify, and use your S3 data for business analytics, real-time inference applications, and more. S3 Metadata supports object metadata, which includes system-defined details like size and source of the object, and custom metadata, which allows you to use tags to annotate your objects with information like product SKU, transaction ID, or content rating. S3 Metadata automatically populates metadata for both new and existing objects, providing you with a comprehensive, queryable view of your data.\n  With this expansion, S3 Metadata is now generally available in six AWS Regions. For pricing details, visit the S3 pricing page. To learn more, visit the product page, documentation, and AWS Storage Blog.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-s3-metadata-three-additional-regions/",
      "pubDate": "2025-10-22T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "s3"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "s3",
        "generally-available",
        "now-available",
        "update",
        "support",
        "expansion"
      ]
    },
    {
      "id": "aws-news-88804b297e43",
      "title": "AWS announces Nitro Enclaves are now available in all AWS Regions",
      "description": "AWS Nitro Enclaves is an Amazon EC2 capability that enables customers to create isolated compute environments (enclaves) to further protect and securely process highly sensitive data within their EC2 instances. Nitro Enclaves helps customers reduce the attack surface area for their most sensitive data processing applications.\n  There is no additional cost other than the cost for the using Amazon EC2 instances and any other AWS services that are used with Nitro Enclaves.\n  Nitro Enclaves is now available across all AWS Regions, expanding to include new regions in Asia Pacific (New Zealand, Thailand, Jakarta, Hyderabad, Malaysia, Melbourne, and Taipei), Europe (Spain and Zurich), Middle East (UAE and Tel Aviv), and North America (Central Mexico and Calgary).\n  To learn more about AWS Nitro Enclaves and how to get started, visit the AWS Nitro Enclaves page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-nitro-enclaves-available-in-all-regions/",
      "pubDate": "2025-10-21T21:07:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "ec2",
        "ga",
        "now-available",
        "new-region"
      ]
    },
    {
      "id": "aws-news-e7f28cce076c",
      "title": "Stifel’s approach to scalable Data Pipeline Orchestration in Data Mesh",
      "description": "Stifel Financial Corp, a diversified financial services holding company is expanding its data landscape that requires an orchestration solution capable of managing increasingly complex data pipeline operations across multiple business domains. Traditional time-based scheduling systems fall short in addressing the dynamic interdependencies between data products, requires event-driven orchestration. Key challenges include coordinating cross-domain dependencies, maintaining data consistency across business units, meeting stringent SLAs, and scaling effectively as data volumes grow. Without a flexible orchestration solution, these issues can lead to delayed business operations and insights, increased operational overhead, and heightened compliance risks due to manual interventions and rigid scheduling mechanisms that cannot adapt to evolving business needs. In this post, we walk through how Stifel Financial Corp, in collaboration with AWS ProServe, has addressed these challenges by building a modular, event-driven orchestration solution using AWS native services that enables precise triggering of data pipelines based on dependency satisfaction, supporting near real-time responsiveness and cross-domain coordination.",
      "link": "https://aws.amazon.com/blogs/big-data/stifels-approach-to-scalable-data-pipeline-orchestration-in-data-mesh/",
      "pubDate": "2025-10-21T21:02:00.000Z",
      "source": "bigDataBlog",
      "services": [
        "lex"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "support"
      ]
    },
    {
      "id": "aws-news-b5bfe4ecdc05",
      "title": "Automate email notifications for governance teams working with Amazon SageMaker Catalog",
      "description": "In this post, we show you how to create custom notifications for events occurring in SageMaker Catalog using Amazon EventBridge, AWS Lambda, and Amazon SNS. You can expand this solution to automatically integrate SageMaker Catalog with in-house enterprise workflow tools like ServiceNow and Helix.",
      "link": "https://aws.amazon.com/blogs/big-data/automate-email-notifications-for-governance-teams-working-with-amazon-sagemaker-catalog/",
      "pubDate": "2025-10-21T20:59:53.000Z",
      "source": "bigDataBlog",
      "services": [
        "sagemaker",
        "lambda",
        "eventbridge",
        "sns"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "lambda",
        "eventbridge",
        "sns"
      ]
    },
    {
      "id": "aws-news-4ff92cfccd7d",
      "title": "How Twilio built a multi-engine query platform using Amazon Athena and open-source Presto",
      "description": "At Twilio, we manage a 20 petabyte-scale Amazon S3 data lake that serves the analytics needs of over 1,500 users, processing 2.5 million queries monthly and scanning an average of 85 PB of data. To meet our growing demands for scalability, emerging technology support, and data mesh architecture adoption, we built Odin, a multi-engine query platform that provides an abstraction layer built on top of Presto Gateway. In this post, we discuss how we designed and built Odin, combining Amazon Athena with open-source Presto to create a flexible, scalable data querying solution.",
      "link": "https://aws.amazon.com/blogs/big-data/how-twilio-built-a-multi-engine-query-platform-using-amazon-athena-and-open-source-presto/",
      "pubDate": "2025-10-21T20:57:32.000Z",
      "source": "bigDataBlog",
      "services": [
        "lex",
        "s3",
        "athena"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "lex",
        "s3",
        "athena",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-a711a087d1f2",
      "title": "Serverless deployment for your Amazon SageMaker Canvas models",
      "description": "In this post, we walk through how to take an ML model built in SageMaker Canvas and deploy it using SageMaker Serverless Inference, helping you go from model creation to production-ready predictions quickly and efficiently without managing any infrastructure. This solution demonstrates a complete workflow from adding your trained model to the SageMaker Model Registry through creating serverless endpoint configurations and deploying endpoints that automatically scale based on demand .",
      "link": "https://aws.amazon.com/blogs/machine-learning/serverless-deployment-for-your-amazon-sagemaker-canvas-models/",
      "pubDate": "2025-10-21T19:03:19.000Z",
      "source": "mlBlog",
      "services": [
        "sagemaker",
        "canvas"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "canvas"
      ]
    },
    {
      "id": "aws-news-4cf5d24f3814",
      "title": "Building a multi-agent voice assistant with Amazon Nova Sonic and Amazon Bedrock AgentCore",
      "description": "In this post, we explore how Amazon Nova Sonic's speech-to-speech capabilities can be combined with Amazon Bedrock AgentCore to create sophisticated multi-agent voice assistants that break complex tasks into specialized, manageable components. The approach demonstrates how to build modular, scalable voice applications using a banking assistant example with dedicated sub-agents for authentication, banking inquiries, and mortgage services, offering a more maintainable alternative to monolithic voice assistant designs.",
      "link": "https://aws.amazon.com/blogs/machine-learning/building-a-multi-agent-voice-assistant-with-amazon-nova-sonic-and-amazon-bedrock-agentcore/",
      "pubDate": "2025-10-21T17:31:05.000Z",
      "source": "mlBlog",
      "services": [
        "bedrock",
        "agentcore",
        "nova",
        "lex"
      ],
      "categories": [
        "foundation-models"
      ],
      "tags": [
        "bedrock",
        "agentcore",
        "nova",
        "lex",
        "ga"
      ]
    },
    {
      "id": "aws-news-fb38b18fd554",
      "title": "Accelerate large-scale AI training with Amazon SageMaker HyperPod training operator",
      "description": "In this post, we demonstrate how to deploy and manage machine learning training workloads using the Amazon SageMaker HyperPod training operator, which enhances training resilience for Kubernetes workloads through pinpoint recovery and customizable monitoring capabilities. The Amazon SageMaker HyperPod training operator helps accelerate generative AI model development by efficiently managing distributed training across large GPU clusters, offering benefits like centralized training process monitoring, granular process recovery, and hanging job detection that can reduce recovery times from tens of minutes to seconds.",
      "link": "https://aws.amazon.com/blogs/machine-learning/accelerate-large-scale-ai-training-with-amazon-sagemaker-hyperpod-training-operator/",
      "pubDate": "2025-10-21T17:26:32.000Z",
      "source": "mlBlog",
      "services": [
        "sagemaker",
        "hyperpod"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "sagemaker",
        "hyperpod"
      ]
    },
    {
      "id": "aws-news-32decb1e0b2a",
      "title": "Amazon SES adds IP observability for Dedicated IP addresses (managed)",
      "description": "Today, Amazon Simple Email Service (SES) added visibility into the IP addresses used by Dedicated IP Addresses - Managed (DIP-M) pools. Customers can now find out the exact addresses in use when sending emails through DIP-M pools to mailbox providers. Customers can also see Microsoft Smart Network Data Services (SNDS) metrics for these IP addresses, giving them more insight into their sending reputation with Microsoft mailbox providers. This gives customers more transparency into the IP activities in DIP-M pools.\n  Previously, customers could configure DIP-M pools to perform automatic IP allocation and warm-up in response to changes in email sending volumes. This reduced the operational overhead of managing dedicated sending channels, but customers could not easily see which IP addresses were in use by DIP-M pools. This also made it difficult to find SNDS feedback, which customers use to improve their reputation. Now, customers can see the IPs in DIP-M pools through the console, CLI, or SES API. SES also automatically creates CloudWatch Metrics for SNDS information on each IP address, which customers can access through the CloudWatch console or APIs. This gives customers more tools to monitor their sending reputation.\n  SES supports DIP-M IP observability in all AWS Regions where SES is available.\n  For more information, see the documentation for information about DIP-M pools.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-ses-ip-observability-dedicated-op-addresses-managed",
      "pubDate": "2025-10-21T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "cloudwatch"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "cloudwatch",
        "support"
      ]
    },
    {
      "id": "aws-news-b90b0ae9cef4",
      "title": "Amazon Corretto October 2025 Quarterly Updates",
      "description": "On October 21, 2025 Amazon announced quarterly security and critical updates for Amazon Corretto Long-Term Supported (LTS) versions of OpenJDK. Corretto 25.0.1, 21.0.9, 17.0.17, 11.0.29, 8u472 are now available for download. Amazon Corretto is a no-cost, multi-platform, production-ready distribution of OpenJDK. \n  This release of Corretto JDK binaries for Generic Linux, Alpine and macOS will include Async-Profiler, a low overhead sampling profiler for Java supported by the Amazon Corretto team. Async-Profiler is designed to provide profiling data for CPU time, allocations in Java Heap, native memory allocations and leaks, contended locks, hardware and software performance counters like cache misses, page faults, context switches, Java method profiling, and much more.\n  Click on the Corretto home page to download Corretto 25, Corretto 21, Corretto 17, Corretto 11, or Corretto 8. You can also get the updates on your Linux system by configuring a Corretto Apt, Yum, or Apk repo.\n  Feedback is welcomed!",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-corretto-october-2025-quarterly-updates",
      "pubDate": "2025-10-21T14:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "now-available",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-a814c649b2c7",
      "title": "Amazon CloudWatch Database Insights now provides on-demand analysis for RDS for SQL Server",
      "description": "Amazon CloudWatch Database Insights expands the availability of its on-demand analysis experience to the RDS for SQL Server database engine. CloudWatch Database Insights is a monitoring and diagnostics solution that helps database administrators and developers optimize database performance by providing comprehensive visibility into database metrics, query analysis, and resource utilization patterns. This feature leverages machine learning models to help identify performance bottlenecks during the selected time period, and gives advice on what to do next.\n  Previously, database administrators had to manually analyze performance data, correlate metrics, and investigate root cause. This process is time-consuming and requires deep database expertise. With this launch, you can now analyze database performance monitoring data for any time period with automated intelligence. The feature automatically compares your selected time period against normal baseline performance, identifies anomalies, and provides specific remediation advice. Through intuitive visualizations and clear explanations, you can quickly identify performance issues and receive step-by-step guidance for resolution. This automated analysis and recommendation system reduces mean-time-to-diagnosis from hours to minutes.\n  You can get started with this feature by enabling the Advanced mode of CloudWatch Database Insights on your RDS for SQL Server databases using the RDS service console, AWS APIs, the AWS SDK, or AWS CloudFormation. Please refer to RDS documentation and Aurora documentation for information regarding the availability of Database Insights across different regions, engines and instance classes.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/cloudwatch-database-on-demand-analysis-rds-sql-server/",
      "pubDate": "2025-10-21T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "rds",
        "cloudformation",
        "cloudwatch"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "rds",
        "cloudformation",
        "cloudwatch",
        "launch",
        "ga"
      ]
    },
    {
      "id": "aws-news-8e47ff068b33",
      "title": "Amazon Nova now supports the customization of content moderation settings",
      "description": "Amazon Nova models now support the customization of content moderation settings for approved business use cases that require processing or generating sensitive content.\n  Organizations with approved business use cases can adjust content moderation settings across four domains: safety, sensitive content, fairness, and security. These settings allow customers to adjust specific settings relevant to their business requirements. Amazon Nova enforces essential, non-configurable controls to ensure responsible use of AI, such as controls to prevent harm to children and preserve privacy.\n  Customization of content moderation settings is available for Amazon Nova Lite and Amazon Nova Pro in the US East (N. Virginia) region.\n  To learn more about Amazon Nova, visit the Amazon Nova product page and to learn about Amazon Nova responsible use of AI, visit the AWS AI Service Cards, or see the User Guide. To see if your business model is appropriate to customize content moderation settings, contact your AWS Account Manager.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-nova-customization-content-moderation-settings/",
      "pubDate": "2025-10-21T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "nova",
        "rds",
        "organizations"
      ],
      "categories": [
        "foundation-models"
      ],
      "tags": [
        "nova",
        "rds",
        "organizations",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-df9024666c3f",
      "title": "Amazon U7i instances now available in Europe (London) Region",
      "description": "Starting today, Amazon EC2 High Memory U7i instances with 6TB of memory (u7i-6tb.112xlarge) are now available in the Europe (London) region. U7i-6tb instances are part of AWS 7th generation and are powered by custom fourth generation Intel Xeon Scalable Processors (Sapphire Rapids). U7i-6tb instances offer 6TB of DDR5 memory, enabling customers to scale transaction processing throughput in a fast-growing data environment.\n  U7i-6tb instances offer 448 vCPUs, support up to 100Gbps Elastic Block Storage (EBS) for faster data loading and backups, deliver up to 100Gbps of network bandwidth, and support ENA Express. U7i instances are ideal for customers using mission-critical in-memory databases like SAP HANA, Oracle, and SQL Server.\n  To learn more about U7i instances, visit the High Memory instances page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-u7i-instances-europe-london-region/",
      "pubDate": "2025-10-21T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "ec2",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-116474bd5ba4",
      "title": "Amazon Bedrock Data Automation supports additional formats for video and faster processing for images",
      "description": "Amazon Bedrock Data Automation (BDA) now supports AVI, MKV, and WEBM file formats along with the AV1 and MPEG-4 Visual (Part 2) codecs, enabling you to generate structured insights across a broader range of video content. Additionally, BDA delivers up to 50% faster image processing. \n  BDA automates the generation of insights from unstructured multimodal content such as documents, images, audio, and videos for your GenAI-powered applications. With support for AVI, MKV, and WEBM formats, you can now analyze content from archival footage, high-quality video archives with multiple audio tracks and subtitles, and web-based and open-source video content. This expanded video format and codec support enables you to process video content directly in the formats your organization uses, streamlining your workflows and accelerating time-to-insight. With faster image processing on BDA, you you can extract insights from visual content faster than ever before. You can now analyze larger volumes of images in less time, helping you scale your AI applications and deliver value to your customers more quickly.\n  Amazon Bedrock Data Automation is available in 8 AWS regions: Europe (Frankfurt), Europe (London), Europe (Ireland), Asia Pacific (Mumbai), Asia Pacific (Sydney), US West (Oregon) and US East (N. Virginia), and GovCloud (US-West) AWS Regions.\n  To learn more, see the Bedrock Data Automation User Guide and the Amazon Bedrock Pricing page. To get started with using Bedrock Data Automation, visit the Amazon Bedrock console.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-bedrock-data-automation-formats-video-images/",
      "pubDate": "2025-10-21T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "bedrock",
        "ecs"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "bedrock",
        "ecs",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-bd8c8927135a",
      "title": "Amazon ECS now publishes AWS CloudTrail data events for insight into API activities",
      "description": "Amazon Elastic Container Service (Amazon ECS) now supports AWS CloudTrail data events, providing detailed visibility into Amazon ECS Agent API activities. This new capability enables customers to monitor, audit, and troubleshoot container instance operations.\n  With CloudTrail data event support, security and operations teams can now maintain comprehensive audit trails of ECS Agent API activities, detect unusual access patterns, and troubleshoot agent communication issues more effectively. Customers can opt in to receive detailed logging through the new data event resource type AWS::ECS::ContainerInstance for ECS agent activities, including when the ECS agent polls for work (ecs:Poll), starts telemetry sessions (ecs:StartTelemetrySession), and submits ECS Managed Instances logs (ecs:PutSystemLogEvents). This enhanced visibility enables teams to better understand how container instance roles are utilized, meet compliance requirements for API activity monitoring, and quickly diagnose operational issues related to agent communications.\n  This new feature is available for Amazon ECS on EC2 in all AWS Regions and ECS Managed Instances in select regions. Standard CloudTrail data event charges apply. To learn more, visit the Developer Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-ecs-aws-cloudtrail-data-events-insight-api-activities",
      "pubDate": "2025-10-20T18:26:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2",
        "ecs"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "ec2",
        "ecs",
        "new-feature",
        "support",
        "new-capability"
      ]
    },
    {
      "id": "aws-news-5bde5fbf03d4",
      "title": "Configure seamless single sign-on with SQL analytics in Amazon SageMaker Unified Studio",
      "description": "This post demonstrates how to configure SageMaker Unified Studio with SSO, set up projects and user onboarding, and access data securely using integrated analytics tools.",
      "link": "https://aws.amazon.com/blogs/big-data/configure-seamless-single-sign-on-with-sql-analytics-in-amazon-sagemaker-unified-studio/",
      "pubDate": "2025-10-17T23:20:34.000Z",
      "source": "bigDataBlog",
      "services": [
        "sagemaker",
        "unified studio"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "unified studio"
      ]
    },
    {
      "id": "aws-news-3c84fcba387e",
      "title": "AWS Parallel Computing Service (PCS) now supports Slurm v25.05",
      "description": "AWS Parallel Computing Service (PCS) now supports Slurm v25.05. You can now create AWS PCS clusters running the newer Slurm v25.05.\n  The release of Slurm v25.05 in PCS provides new Slurm functionalities including enhanced multi-cluster sackd configuration and improved requeue behavior for instance launch failures. With this release, login nodes can now control multiple clusters without requiring sackd reconfiguration or restart. This enables administrators to pre-configure access to multiple clusters for their users. The new requeue behavior enables more resilient job scheduling by automatically retrying failed instance launches during capacity shortages, thus increasing overall cluster reliability.\n  AWS PCS is a managed service that makes it easier for you to run and scale your high performance computing (HPC) workloads on AWS using Slurm. To learn more about PCS, refer to the service documentation and AWS Region Table.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-parallel-computing-service-supports-pcs-slurm-v25-05/",
      "pubDate": "2025-10-17T20:37:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "launch",
        "support"
      ]
    },
    {
      "id": "aws-news-c129a835c3dc",
      "title": "CloudWatch Database Insights now supports tag based access control",
      "description": "Amazon CloudWatch Database Insights now supports tag-based access control for database and per-query metrics powered by RDS Performance Insights. You can implement access controls across a logical grouping of database resources without managing individual resource-level permissions.\n  Previously, tags defined on RDS and Aurora instances did not apply to metrics powered by Performance Insights, creating significant overhead in manually configuring metric-related permissions at the database resource level. With this launch, those instance tags are now automatically evaluated to authorize metrics powered by Performance Insights. This allows you to define IAM policies using tag-based access conditions, resulting in improved governance and security consistency.\n  Please refer to RDS and Aurora documentation to get started with defining IAM policies with tag-based access control on database and per-query metrics. This feature is available in all AWS regions where CloudWatch Database Insights is available.\n  CloudWatch Database Insights delivers database health monitoring aggregated at the fleet level, as well as instance-level dashboards for detailed database and SQL query analysis. It offers vCPU-based pricing – see the pricing page for details. For further information, visit the Database Insights User Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/database-insights-tag-based-access-control",
      "pubDate": "2025-10-17T17:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "rds",
        "iam",
        "cloudwatch"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "rds",
        "iam",
        "cloudwatch",
        "launch",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-97f113855faf",
      "title": "How TP ICAP transformed CRM data into real-time insights with Amazon Bedrock",
      "description": "This post shows how TP ICAP used Amazon Bedrock Knowledge Bases and Amazon Bedrock Evaluations to build ClientIQ, an enterprise-grade solution with enhanced security features for extracting CRM insights using AI, delivering immediate business value.",
      "link": "https://aws.amazon.com/blogs/machine-learning/how-tp-icap-transformed-crm-data-into-real-time-insights-with-amazon-bedrock/",
      "pubDate": "2025-10-17T16:15:25.000Z",
      "source": "mlBlog",
      "services": [
        "bedrock"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "bedrock"
      ]
    },
    {
      "id": "aws-news-adae458eebc7",
      "title": "Principal Financial Group accelerates build, test, and deployment of Amazon Lex V2 bots through automation",
      "description": "In the post Principal Financial Group increases Voice Virtual Assistant performance using Genesys, Amazon Lex, and Amazon QuickSight, we discussed the overall Principal Virtual Assistant solution using Genesys Cloud, Amazon Lex V2, multiple AWS services, and a custom reporting and analytics solution using Amazon QuickSight.",
      "link": "https://aws.amazon.com/blogs/machine-learning/principal-financial-group-accelerates-build-test-and-deployment-of-amazon-lex-v2-bots-through-automation/",
      "pubDate": "2025-10-17T16:13:18.000Z",
      "source": "mlBlog",
      "services": [
        "amazon q",
        "lex",
        "quicksight"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "amazon q",
        "lex",
        "quicksight"
      ]
    },
    {
      "id": "aws-news-37dcae1b25ff",
      "title": "Beyond vibes: How to properly select the right LLM for the right task",
      "description": "In this post, we discuss an approach that can guide you to build comprehensive and empirically driven evaluations that can help you make better decisions when selecting the right model for your task.",
      "link": "https://aws.amazon.com/blogs/machine-learning/beyond-vibes-how-to-properly-select-the-right-llm-for-the-right-task/",
      "pubDate": "2025-10-17T16:09:22.000Z",
      "source": "mlBlog",
      "services": [],
      "categories": [
        "industry-cases"
      ],
      "tags": []
    },
    {
      "id": "aws-news-27954996bc50",
      "title": "Splash Music transforms music generation using AWS Trainium and Amazon SageMaker HyperPod",
      "description": "In this post, we show how Splash Music is setting a new standard for AI-powered music creation by using its advanced HummingLM model with AWS Trainium on Amazon SageMaker HyperPod. As a selected startup in the 2024 AWS Generative AI Accelerator, Splash Music collaborated closely with AWS Startups and the AWS Generative AI Innovation Center (GenAIIC) to fast-track innovation and accelerate their music generation FM development lifecycle.",
      "link": "https://aws.amazon.com/blogs/machine-learning/splash-music-transforms-music-generation-using-aws-trainium-and-amazon-sagemaker-hyperpod/",
      "pubDate": "2025-10-17T16:06:01.000Z",
      "source": "mlBlog",
      "services": [
        "nova",
        "sagemaker",
        "hyperpod",
        "trainium"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "nova",
        "sagemaker",
        "hyperpod",
        "trainium"
      ]
    },
    {
      "id": "aws-news-b3f58661ceb2",
      "title": "Announcing Amazon EC2 Capacity Manager",
      "description": "Today, AWS is announcing the general availability of Amazon EC2 Capacity Manager, a new capability that enables customers to monitor, analyze, and manage EC2 capacity across all of their accounts and regions. This new capability simplifies resource management using a single interface.\n  EC2 Capacity Manager offers customers a comprehensive view of On-Demand, Spot, and Capacity Reservation usage across their accounts and Regions. The new service features dashboards and charts that present high-level insights while allowing customers to drill down into specific details where needed. These details include historical usage trends to help customers gain a better understanding of their capacity patterns over time, as well as optimization opportunities to guide informed capacity decisions, complete with workflows for implementing these insights. In addition to the updated user interface and APIs, EC2 Capacity Manager allows customers to export data, enabling integration with their existing systems.\n  EC2 Capacity Manager is available in all commercial AWS Regions enabled by default at no additional cost.\n  To learn more, visit the EC2 Capacity Manager user guide, read the AWS News Blog, or get started using EC2 Capacity Manager in the AWS console.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-ec2-capacity-manager",
      "pubDate": "2025-10-17T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2",
        "rds"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "rds",
        "ga",
        "update",
        "integration",
        "new-capability"
      ]
    },
    {
      "id": "aws-news-15c89948dcbc",
      "title": "Amazon OpenSearch Service now supports Graviton4 based (c8g,m8g,r8g and r8gd) instances",
      "description": "Amazon OpenSearch Service now supports latest generation Graviton4-based Amazon EC2 instance families. These new instance types are compute optimized (C8g), general purpose (M8g), and memory optimized (R8g, R8gd) instances. \n  AWS Graviton4 processors provide up to 30% better performance than AWS Graviton3 processors with c8g, m8g and r8g & r8gd offering the best price performance for compute-intensive, general purpose, and memory-intensive workloads respectively. To learn more about Graviton4 improvements, please see the blog on r8g instances and the blog on c8g & m8g instances.\n  Amazon OpenSearch Service Graviton4 instances are supported on all OpenSearch versions, and Elasticsearch (open source) versions 7.9 and 7.10. \n  One or more than one Graviton4 instance types are now available on Amazon OpenSearch Service across 23 regions globally: US East (N. Virginia), US East (Ohio), US West (N. California), US West (Oregon), Asia Pacific (Jakarta), Asia Pacific (Hong Kong), Asia Pacific (Hyderabad), Asia Pacific (Mumbai), Asia Pacific (Malaysia), Asia Pacific (Osaka), Asia Pacific (Seoul), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Asia Pacific (Thailand), Canada (Central), Europe (Frankfurt), Europe (Ireland), Europe (London), Europe (Spain), Europe (Stockholm), South America(Sao Paulo) and AWS GovCloud (US-West).\n  For region specific availability & pricing, visit our pricing page. To learn more about Amazon OpenSearch Service and its capabilities, visit our product page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-opensearch-service-supports-graviton4-based-instances",
      "pubDate": "2025-10-17T11:23:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2",
        "opensearch",
        "opensearch service",
        "graviton"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "opensearch",
        "opensearch service",
        "graviton",
        "ga",
        "now-available",
        "improvement",
        "support"
      ]
    },
    {
      "id": "aws-news-466dfd2484ad",
      "title": "AWS Systems Manager Patch Manager launches security updates notification for Windows",
      "description": "AWS Systems Manager announces the launch of security updates notification for Windows patching compliance, which helps customers identify security updates that are available but not approved by their patch baseline configuration. This feature introduces a new patch state called \"AvailableSecurityUpdate\" that reports security patches of all severity levels that are available to install on Windows instances but do not meet the approval rules in your patch baseline.\n  As organizations grow, administrators need to maintain secure systems while controlling when patches are applied. The security updates notification helps prevent situations where customers could unintentionally leave instances unpatched when using features like ApprovalDelay with large values. By default, instances with available security updates are marked as Non-Compliant, providing a clear signal that security patches require attention. Customers can also configure this behavior through their patch baseline settings to maintain existing compliance reporting if preferred.\n  This feature is available in all AWS Regions where AWS Systems Manager is available. To get started with security updates notification for Windows patching compliance, visit the AWS Systems Manager Patch Manager console. For more information about this feature, refer to our user documentation or update your patch baseline with the details here. There are no additional charges for using this feature beyond standard AWS Systems Manager pricing.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-systems-manager-patch-manager-windows/",
      "pubDate": "2025-10-17T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "organizations",
        "launch",
        "ga",
        "update"
      ]
    },
    {
      "id": "aws-news-c3df5c11b27b",
      "title": "Customer managed KMS keys now available for Automated Reasoning checks",
      "description": "AWS announces support for customer managed AWS Key Management Service (KMS) keys in Automated Reasoning checks in Amazon Bedrock Guardrails. This enhancement enables you to use your own encryption keys to protect policy content and tests, giving you full control over key management. Automated Reasoning checks in Amazon Bedrock Guardrails is the first and only generative AI safeguard that helps correct factual errors from hallucinations using logically accurate and verifiable reasoning that explains why responses are correct.\n  This feature enables organizations in regulated industries like healthcare, financial services, and government to adopt Automated Reasoning checks while meeting compliance requirements for customer-owned encryption keys. For example, a financial institution can now use Automated Reasoning checks to validate loan processing guidelines while maintaining full control over the encryption keys protecting their policy content. When creating an Automated Reasoning policy, you can now select a customer managed KMS key to encrypt your content rather than using the default key.\n  Customer managed KMS key support for Automated Reasoning checks is available in all AWS Regions where Amazon Bedrock Guardrails is offered: US East (N. Virginia), US East (Ohio), US West (Oregon), Europe (Frankfurt), Europe (Ireland), and Europe (Paris).\n  To get started, see the following resources:\n  \n \n \nAutomated Reasoning checks user guide\n \n \nAmazon Bedrock Guardrails product page\n \n \nAWS Key Management Service developer guide\n \n \nCreate an Automated Reasoning policy in the Bedrock console",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/customer-managed-kms-keys-automated-reasoning-checks/",
      "pubDate": "2025-10-17T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "bedrock",
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "bedrock",
        "organizations",
        "ga",
        "now-available",
        "enhancement",
        "support"
      ]
    },
    {
      "id": "aws-news-c8d41c80e16e",
      "title": "Amazon EC2 C8g instances now available in additional regions",
      "description": "Starting today, Amazon Elastic Compute Cloud (Amazon EC2) C8g instances are available in AWS Europe (Milan), and AWS Asia Pacific (Hong Kong, Osaka, Melbourne) regions. These instances are powered by AWS Graviton4 processors and deliver up to 30% better performance compared to AWS Graviton3-based instances. Amazon EC2 C8g instances are built for compute-intensive workloads, such as high performance computing (HPC), batch processing, gaming, video encoding, scientific modeling, distributed analytics, CPU-based machine learning (ML) inference, and ad serving. These instances are built on the AWS Nitro System, which oﬄoads CPU virtualization, storage, and networking functions to dedicated hardware and software to enhance the performance and security of your workloads.\n  AWS Graviton4-based Amazon EC2 instances deliver the best performance and energy efficiency for a broad range of workloads running on Amazon EC2. These instances offer larger instance sizes with up to 3x more vCPUs and memory compared to Graviton3-based Amazon C7g instances. AWS Graviton4 processors are up to 40% faster for databases, 30% faster for web applications, and 45% faster for large Java applications than AWS Graviton3 processors. C8g instances are available in 12 different instance sizes, including two bare metal sizes. They offer up to 50 Gbps enhanced networking bandwidth and up to 40 Gbps of bandwidth to the Amazon Elastic Block Store (Amazon EBS).\n  To learn more, see Amazon EC2 C8g Instances. To get started, see the AWS Management Console.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-ec2-c8g-instances-additional-regions/",
      "pubDate": "2025-10-17T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2",
        "graviton"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "ec2",
        "graviton",
        "ga",
        "now-available"
      ]
    },
    {
      "id": "aws-news-ad7fa072f6f9",
      "title": "Iterative fine-tuning on Amazon Bedrock for strategic model improvement",
      "description": "Organizations often face challenges when implementing single-shot fine-tuning approaches for their generative AI models. The single-shot fine-tuning method involves selecting training data, configuring hyperparameters, and hoping the results meet expectations without the ability to make incremental adjustments. Single-shot fine-tuning frequently leads to suboptimal results and requires starting the entire process from scratch when improvements are […]",
      "link": "https://aws.amazon.com/blogs/machine-learning/iterative-fine-tuning-on-amazon-bedrock-for-strategic-model-improvement/",
      "pubDate": "2025-10-16T23:11:28.000Z",
      "source": "mlBlog",
      "services": [
        "bedrock",
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "bedrock",
        "organizations",
        "ga",
        "improvement"
      ]
    },
    {
      "id": "aws-news-11031ecd9926",
      "title": "Zero downtime blue/green deployments with Amazon API Gateway",
      "description": "In this post, you learn how to implement blue/green deployments by using Amazon API Gateway for your APIs. For this post, we use AWS Lambda functions on the backend. However, you can follow the same strategy for other backend implementations of the APIs. All the required infrastructure is deployed by using AWS Serverless Application Model (AWS SAM).",
      "link": "https://aws.amazon.com/blogs/compute/zero-downtime-blue-green-deployments-with-amazon-api-gateway/",
      "pubDate": "2025-10-16T19:01:22.000Z",
      "source": "computeBlog",
      "services": [
        "lambda",
        "api gateway"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "lambda",
        "api gateway",
        "ga"
      ]
    },
    {
      "id": "aws-news-c83bf77ed8b8",
      "title": "Stream mainframe data to AWS in near real time with Precisely and Amazon MSK",
      "description": "In this post, we introduce an alternative architecture to synchronize mainframe data to the cloud using Amazon Managed Streaming for Apache Kafka (Amazon MSK) for greater flexibility and scalability. This event-driven approach provides additional possibilities for mainframe data integration and modernization strategies.",
      "link": "https://aws.amazon.com/blogs/big-data/stream-mainframe-data-to-aws-in-near-real-time-with-precisely-and-amazon-msk/",
      "pubDate": "2025-10-16T18:55:25.000Z",
      "source": "bigDataBlog",
      "services": [
        "lex",
        "kafka",
        "msk"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "kafka",
        "msk",
        "integration"
      ]
    },
    {
      "id": "aws-news-7a86c4c249c4",
      "title": "Voice AI-powered drive-thru ordering with Amazon Nova Sonic and dynamic menu displays",
      "description": "In this post, we'll demonstrate how to implement a Quick Service Restaurants (QSRs) drive-thru solution using Amazon Nova Sonic and AWS services. We'll walk through building an intelligent system that combines voice AI with interactive menu displays, providing technical insights and implementation guidance to help restaurants modernize their drive-thru operations.",
      "link": "https://aws.amazon.com/blogs/machine-learning/voice-ai-powered-drive-thru-ordering-with-amazon-nova-sonic-and-dynamic-menu-displays/",
      "pubDate": "2025-10-16T18:36:28.000Z",
      "source": "mlBlog",
      "services": [
        "nova"
      ],
      "categories": [
        "foundation-models"
      ],
      "tags": [
        "nova"
      ]
    },
    {
      "id": "aws-news-c7d82641b37e",
      "title": "Optimizing document AI and structured outputs by fine-tuning Amazon Nova Models and on-demand inference",
      "description": "This post provides a comprehensive hands-on guide to fine-tune Amazon Nova Lite for document processing tasks, with a focus on tax form data extraction. Using our open-source GitHub repository code sample, we demonstrate the complete workflow from data preparation to model deployment.",
      "link": "https://aws.amazon.com/blogs/machine-learning/optimizing-document-ai-and-structured-outputs-by-fine-tuning-amazon-nova-models-and-on-demand-inference/",
      "pubDate": "2025-10-16T18:32:55.000Z",
      "source": "mlBlog",
      "services": [
        "nova"
      ],
      "categories": [
        "foundation-models"
      ],
      "tags": [
        "nova"
      ]
    },
    {
      "id": "aws-news-e33f594c2ad4",
      "title": "AWS Marketplace now supports purchase order line numbers",
      "description": "AWS Marketplace now supports purchase order line numbers for AWS Marketplace purchases, simplifying cost-allocation and payment processing. This launch makes it easier for customers to process and pay invoices.\n  AWS purchase order support allows customers to provide purchase orders per transaction, which reflect on invoices related to that purchase. Now, customers can associate transaction charges not only to purchase orders, but also to a specific PO line number for AWS Marketplace purchases. This capability is supported during procurement and, for future charges, post-procurement in the AWS Marketplace console. You can also view the purchase order and purchase order line number associated to an AWS invoice in the AWS Billing and Cost Management console. Streamline your invoice processing by accurately matching AWS invoices with your purchase order and purchase order line number.\n  This capability is available today in all AWS Regions where AWS Marketplace is supported.\n  To learn about transaction purchase orders for AWS Marketplace, view the AWS Marketplace buyer guide. For information on using blanket purchase orders with AWS, refer to the AWS Billing Documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-marketplace-po-line-numbers",
      "pubDate": "2025-10-16T17:29:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "launch",
        "support"
      ]
    },
    {
      "id": "aws-news-b856f65fb676",
      "title": "Amazon Timestream now supports InfluxDB 3",
      "description": "Amazon Timestream for InfluxDB now offers support for InfluxDB 3. Now application developers and DevOps teams can run InfluxDB 3 databases as a managed service. InfluxDB 3 uses a new architecture for the InfluxDB database engine, built on Apache Arrow for in-memory data processing, Apache DataFusion for query execution, and columnar Parquet storage format with data persistence in Amazon S3 to deliver fast performance for high-cardinality data and large scale data processing for large analytical workloads.\n  With Amazon Timestream for InfluxDB 3, customers can leverage improved query performance and resource utilization for data-intensive use cases while benefiting from virtually unlimited storage capacity through S3-based object storage. The service is available in two editions: Core, the open source version of InfluxDB 3, for near real-time workloads focused on recent data, and Enterprise for production workloads requiring high availability, multi-node deployments, and essential compaction capabilities for long-term storage. The Enterprise edition supports multi-node cluster configurations with up to 3 nodes initially, providing enhanced availability, improved performance for concurrent queries, and greater system resilience.\n  Amazon Timestream for InfluxDB 3 is available in all Regions where Timestream for InfluxDB is available. See here for a full listing of our Regions.\n  To get started with Amazon Timestream for InfluxDB 3, visit the Amazon Timestream for InfluxDB console. For more information, see the Amazon Timestream for InfluxDB documentation and pricing page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-timestream-influxdb-3/",
      "pubDate": "2025-10-16T17:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "s3"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "s3",
        "support"
      ]
    },
    {
      "id": "aws-news-81499b3fe296",
      "title": "Monitor, analyze, and manage capacity usage from a single interface with Amazon EC2 Capacity Manager",
      "description": "Amazon EC2 Capacity Manager is a new centralized solution that consolidates capacity monitoring and management across all AWS accounts and regions, eliminating operational overhead and providing optimization opportunities for EC2 infrastructure at scale.",
      "link": "https://aws.amazon.com/blogs/aws/monitor-analyze-and-manage-capacity-usage-from-a-single-interface-with-amazon-ec2-capacity-manager/",
      "pubDate": "2025-10-16T15:48:12.000Z",
      "source": "newsBlog",
      "services": [
        "ec2"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "ec2"
      ]
    },
    {
      "id": "aws-news-24132007fd0e",
      "title": "Amazon EC2 C8gn instances are now available in additional regions",
      "description": "Starting today, Amazon Elastic Compute Cloud (Amazon EC2) C8gn instances, powered by the latest-generation AWS Graviton4 processors, are available in the AWS Asia Pacific (Malaysia, Sydney, Thailand) Region. The new instances provide up to 30% better compute performance than Graviton3-based Amazon EC2 C7gn instances. Amazon EC2 C8gn instances feature the latest 6th generation AWS Nitro Cards, and offer up to 600 Gbps network bandwidth, the highest network bandwidth among network optimized EC2 instances.\n  Take advantage of the enhanced networking capabilities of C8gn to scale performance and throughput, while optimizing the cost of running network-intensive workloads such as network virtual appliances, data analytics, CPU-based artificial intelligence and machine learning (AI/ML) inference.\n  For increased scalability, C8gn instances offer instance sizes up to 48xlarge, up to 384 GiB of memory, and up to 60 Gbps of bandwidth to Amazon Elastic Block Store (EBS). C8gn instances support Elastic Fabric Adapter (EFA) networking on the 16xlarge, 24xlarge, 48xlarge, metal-24xl, and metal-48xl sizes, which enables lower latency and improved cluster performance for workloads deployed on tightly coupled clusters.\n  C8gn instances are available in the following AWS Regions: US East (N. Virginia), US West (Oregon, N.California), Europe (Frankfurt, Stockholm), Asia Pacific (Singapore, Malaysia, Sydney, Thailand)\n  To learn more, see Amazon C8gn Instances. To begin your Graviton journey, visit the Level up your compute with AWS Graviton page. To get started, see AWS Management Console, AWS Command Line Interface (AWS CLI), and AWS SDKs.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-ec2-c8gn-instances-additional-regions",
      "pubDate": "2025-10-16T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2",
        "rds",
        "graviton"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "rds",
        "graviton",
        "ga",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-600972ff7837",
      "title": "Amazon DocumentDB (with MongoDB compatibility) now supports Internet Protocol Version 6 (IPv6)",
      "description": "Amazon DocumentDB (with MongoDB compatibility) now offers customers the option to use Internet Protocol version 6 (IPv6) addresses on new and existing clusters. Customers moving to IPv6 can simplify their network stack by running their databases on a dual-stack network that supports both IPv4 and IPv6.\n  IPv6 increases the number of available addresses and customers no longer need to manage overlapping IPv4 address spaces in their VPCs (Virtual Private Cloud). Customers can standardize their applications on the new version of Internet Protocol by moving to dual-stack mode (supporting both IPv4 and IPv6) with a few clicks in the AWS Management Console or directly using the AWS CLI.\n  Amazon DocumentDB (with MongoDB compatibility) is a fully managed, native JSON database that makes it simple and cost-effective to operate critical document workloads at virtually any scale without managing infrastructure. Amazon DocumentDB support for IPv6 is generally available on version 4.0 and 5.0 in AWS Regions listed in Dual-stack mode Region and version availability. To learn more about configuring your environment for IPv6, please refer to Amazon VPC and Amazon DocumentDB.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-documentdb-ipv6-support/",
      "pubDate": "2025-10-16T07:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "generally-available",
        "support"
      ]
    },
    {
      "id": "aws-news-9013bb174302",
      "title": "AWS Security Hub CSPM now supports CIS AWS Foundations Benchmark v5.0",
      "description": "AWS Security Hub Cloud Security Posture Management (CSPM) now supports the Center for Internet Security (CIS) AWS Foundations Benchmark v5.0. This industry-standard benchmark provides security configuration best practices for AWS with clear implementation and assessment procedures. The new standard includes 40 controls that perform automated checks against AWS resources to evaluate compliance with the latest version 5.0 requirements.\n  The standard is now available in all AWS Regions where Security Hub CSPM is currently available, including the AWS GovCloud (US) and the China Regions. To quickly enable the standard across your AWS environment, we recommend that you use Security Hub CSPM central configuration. With this approach, you can enable the standard in all or only some of your organization's accounts and across all AWS Regions that are linked to Security Hub CSPM with a single action.\n  To learn more, see CIS v5.0 in the AWS Security Hub CSPM User Guide. To receive notifications about new Security Hub CSPM features and controls, subscribe to the Security Hub CSPM SNS topic. You can also try Security Hub at no cost for 30 days with the AWS Free Tier offering.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-security-hub-cspm-cis-foundations-benchmark-v5/",
      "pubDate": "2025-10-16T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "sns"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "sns",
        "ga",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-4b870ae0925a",
      "title": "Best practices for upgrading from Amazon Redshift DC2 to RA3 and Amazon Redshift Serverless",
      "description": "As analytical demands grow, many customers are upgrading from DC2 to RA3 or Amazon Redshift Serverless, which offer independent compute and storage scaling, along with advanced capabilities such as data sharing, zero-ETL integration, and built-in artificial intelligence and machine learning (AI/ML) support with Amazon Redshift ML. This post provides a practical guide to plan your target architecture and migration strategy, covering upgrade options, key considerations, and best practices to facilitate a successful and seamless transition.",
      "link": "https://aws.amazon.com/blogs/big-data/best-practices-for-upgrading-from-amazon-redshift-dc2-to-ra3-and-amazon-redshift-serverless/",
      "pubDate": "2025-10-15T21:46:41.000Z",
      "source": "bigDataBlog",
      "services": [
        "redshift"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "redshift",
        "integration",
        "support"
      ]
    },
    {
      "id": "aws-news-becb82a21696",
      "title": "Transforming enterprise operations: Four high-impact use cases with Amazon Nova",
      "description": "In this post, we share four high-impact, widely adopted use cases built with Nova in Amazon Bedrock, supported by real-world customers deployments, offerings available from AWS partners, and experiences. These examples are ideal for organizations researching their own AI adoption strategies and use cases across industries.",
      "link": "https://aws.amazon.com/blogs/machine-learning/transforming-enterprise-operations-four-high-impact-use-cases-with-amazon-nova/",
      "pubDate": "2025-10-15T18:26:10.000Z",
      "source": "mlBlog",
      "services": [
        "bedrock",
        "nova",
        "organizations"
      ],
      "categories": [
        "foundation-models"
      ],
      "tags": [
        "bedrock",
        "nova",
        "organizations",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-482772d87e08",
      "title": "Amazon WorkSpaces Core Managed Instances is now available in 5 additional AWS Regions",
      "description": "AWS today announced Amazon WorkSpaces Core Managed Instances availability in US East (Ohio), Asia Pacific (Malaysia), Asia Pacific (Hong Kong), Middle East (UAE), and Europe (Spain), bringing Amazon WorkSpaces capabilities to these AWS Regions for the first time. WorkSpaces Core Managed Instances in these Regions is supported by partners including Citrix, Workspot, Leostream, and Dizzion.\n  Amazon WorkSpaces Core Managed Instances simplifies virtual desktop infrastructure (VDI) migrations with highly customizable instance configurations. WorkSpaces Core Managed Instances provisions resources in your AWS account, handling infrastructure lifecycle management for both persistent and non-persistent workloads. Managed Instances provide flexibility for organizations requiring specific compute, memory, or graphics configurations.\n  With WorkSpaces Core Managed Instances, you can use existing discounts, Savings Plans, and other features like On-Demand Capacity Reservations (ODCRs), with the operational simplicity of WorkSpaces - all within the security and governance boundaries of your AWS account. This solution is ideal for organizations migrating from on-premises VDI environments or existing AWS customers seeking enhanced cost optimization without sacrificing control over their infrastructure configurations. You can use a broad selection of instance types, including accelerated graphics instances, while your Core partner solution handles desktop and application provisioning and session management through familiar administrative tools.\n  Customers will incur standard compute costs along with an hourly fee for WorkSpaces Core. See the WorkSpaces Core pricing page for more information.\n  To learn more about Amazon WorkSpaces Core Managed Instances, visit the product page. For technical documentation and getting started guides, see the Amazon WorkSpaces Core Documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-workspaces-core-managed-instances-additional-regions",
      "pubDate": "2025-10-15T17:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "lex",
        "organizations",
        "ga",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-5bc447bea6ce",
      "title": "Amazon Bedrock simplifies access with automatic enablement of serverless foundation models",
      "description": "Amazon Bedrock now provides immediate access to all serverless foundation models by default for users in all commercial AWS regions. This update eliminates the need for manually activating model access, allowing you to instantly start using these models through the Amazon Bedrock console playground, AWS SDK, and Amazon Bedrock features including Agents, Flows, Guardrails, Knowledge Bases, Prompt Management, and Evaluations.\n  While you can quickly begin using serverless foundation models from most providers, Anthropic models, although enabled by default, still require you to submit a one-time usage form before first use. You can complete this form either through the API or through the Amazon Bedrock console by selecting an Anthropic model from the playground. When completed through the AWS organization management account, the form submission automatically enables Anthropic models across all member accounts in the organization.\n  This simplified access is available across all commercial AWS regions where Amazon Bedrock is supported. Account administrators retain full control over model access through IAM policies and Service Control Policies (SCPs) to restrict access as needed. For implementation guidance and examples on access controls, please refer to our blog.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-bedrock-automatic-enablement-serverless-foundation-models",
      "pubDate": "2025-10-15T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "bedrock",
        "iam"
      ],
      "categories": [
        "foundation-models"
      ],
      "tags": [
        "bedrock",
        "iam",
        "ga",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-a74fa915331e",
      "title": "Amazon Aurora PostgreSQL zero-ETL integration with Amazon SageMaker is now available",
      "description": "Amazon Aurora PostgreSQL-Compatible Edition now supports zero-ETL integration with Amazon SageMaker, enabling near real-time data availability for analytics workloads. This integration automatically extracts and loads data from PostgreSQL tables into your lakehouse where it's immediately accessible through various analytics engines and machine learning tools. The data synced into the lakehouse is compatible with Apache Iceberg open standards, enabling you to use your preferred analytics tools and query engines such as SQL, Apache Spark, BI, and AI/ML tools.\n  Through a simple no-code interface, you can create and maintain an up-to-date replica of your PostgreSQL data in your lakehouse without impacting production workloads. The integration features comprehensive, fine-grained access controls that are consistently enforced across all analytics tools and engines, ensuring secure data sharing throughout your organization. As a complement to the existing zero-ETL integrations with Amazon Redshift, this solution reduces operational complexity while enabling you to derive immediate insights from your operational data.\n  Amazon Aurora PostgreSQL zero-ETL integration with Amazon SageMaker is now available in the US East (N. Virginia), US East (Ohio), US West (Oregon), Canada (Central), South America (Sao Paulo), Asia Pacific (Hong Kong), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Asia Pacific (Seoul), Europe (Frankfurt), Europe (Ireland), Europe (London), and Europe (Stockholm) AWS Regions.\n  To learn more, visit What is zero-ETL. To begin using this new integration, visit the zero-ETL documentation for Aurora PostgreSQL.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-aurora-postgresql-zero-etl-integration-sagemaker",
      "pubDate": "2025-10-15T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "sagemaker",
        "lex",
        "redshift",
        "rds"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "sagemaker",
        "lex",
        "redshift",
        "rds",
        "ga",
        "now-available",
        "integration",
        "support"
      ]
    },
    {
      "id": "aws-news-8b165ea93ef7",
      "title": "DeepSeek, OpenAI, and Qwen models available in Amazon Bedrock in additional Regions",
      "description": "Amazon Bedrock is bringing DeepSeek-V3.1, OpenAI open-weight models, and Qwen3 models to more AWS Regions worldwide, expanding access to cutting-edge AI for customers across the globe. This regional expansion enables organizations in more countries and territories to deploy these powerful foundation models locally, ensuring compliance with data residency requirements, reducing network latency, and delivering faster AI-powered experiences to their users.\n  DeepSeek-V3.1 and Qwen3 Coder-480B are now available in the US East (Ohio) and Asia Pacific (Jakarta) AWS Regions. OpenAI open-weight models (20B, 120B) and Qwen3 models (32B, 235B, Coder-30B) are now available in the US East (Ohio), Europe (Frankfurt), and Asia Pacific (Jakarta) AWS Regions.\n  Check out the full Region list for future updates. To learn more about these models visit the Amazon Bedrock product page. To get started, access the Amazon Bedrock console and view the documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/deepseek-openai-qwen-models-amazon-bedrock-additional-regions",
      "pubDate": "2025-10-15T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "bedrock",
        "organizations"
      ],
      "categories": [
        "foundation-models"
      ],
      "tags": [
        "bedrock",
        "organizations",
        "ga",
        "now-available",
        "update",
        "expansion"
      ]
    },
    {
      "id": "aws-news-cd9bdeebe4b4",
      "title": "Claude 4.5 Haiku by Anthropic now in Amazon Bedrock",
      "description": "Claude Haiku 4.5 is now available in Amazon Bedrock. Claude Haiku 4.5 delivers near-frontier performance matching Claude Sonnet 4's capabilities in coding, computer use, and agent tasks at substantially lower cost and faster speeds, making state-of-the-art AI accessible for scaled deployments and budget-conscious applications.\n  The model's enhanced speed makes it ideal for latency-sensitive applications like real-time customer service agents and chatbots where response time is critical. For computer use tasks, Haiku 4.5 delivers significant performance improvements over previous models, enabling faster and more responsive applications. This model supports vision and unlocks new use cases where customers previously had to choose between performance and cost. It enables economically viable agent experiences, supports multi-agent systems for complex coding projects, and powers large-scale financial analysis and research applications. Haiku 4.5 maintains Claude's unique character while delivering the performance and efficiency needed for production deployments.\n  Claude Haiku 4.5 is now available in Amazon Bedrock via global cross region inference in multiple locations. To view the full list of available regions, refer to the documentation. To get started with Haiku 4.5 in Amazon Bedrock visit the Amazon Bedrock console, Anthropic's Claude in Amazon Bedrock product page, and the Amazon Bedrock pricing page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/claude-4-5-haiku-anthropic-amazon-bedrock",
      "pubDate": "2025-10-15T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "bedrock",
        "lex"
      ],
      "categories": [
        "foundation-models"
      ],
      "tags": [
        "bedrock",
        "lex",
        "now-available",
        "improvement",
        "support"
      ]
    },
    {
      "id": "aws-news-363a8b0536ad",
      "title": "Second-generation AWS Outposts racks now supported in the AWS Europe (Ireland) Region",
      "description": "Second-generation AWS Outposts racks are now supported in the AWS Europe (Ireland) Region. Outposts racks extend AWS infrastructure, AWS services, APIs, and tools to virtually any on-premises data center or colocation space for a truly consistent hybrid experience.\n  Organizations from startups to enterprises and the public sector in and outside of Europe can now order their Outposts racks connected to this new supported region, optimizing for their latency and data residency needs. Outposts allows customers to run workloads that need low latency access to on-premises systems locally while connecting back to their home Region for application management. Customers can also use Outposts and AWS services to manage and process data that needs to remain on-premises to meet data residency requirements. This regional expansion provides additional flexibility in the AWS Regions that customers’ Outposts can connect to.\n  To learn more about second-generation Outposts racks, read this blog post and user guide. For the most updated list of countries and territories and the AWS Regions where second-generation Outposts racks are supported, check out the Outposts rack FAQs page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/second-generation-aws-outposts-racks-europe-ireland-region",
      "pubDate": "2025-10-15T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "organizations",
        "outposts"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "lex",
        "organizations",
        "outposts",
        "ga",
        "update",
        "support",
        "expansion"
      ]
    },
    {
      "id": "aws-news-bf9c63d4d223",
      "title": "AWS Backup enhances backup plan management with schedule preview",
      "description": "AWS Backup now provides schedule preview for backup plans, helping you validate when your backups are scheduled to run. Schedule preview shows the next ten scheduled backup runs, including when continuous backup, indexing, or copy settings take effect.\n \nBackup plan schedule preview consolidates all backup rules into a single timeline, showing how they work together. You can see when each backup occurs across all backup rules, along with settings like lifecycle to cold storage, point-in-time recovery, and indexing. This unified view helps you quickly identify and resolve conflicts or gaps between your backup strategy and actual configuration.\n \nBackup plan schedule preview is available in all AWS Regions where AWS Backup is available. You can start using this feature automatically from the AWS Backup console, API, or CLI without any additional settings. For more information, visit our documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-backup-plan-management/",
      "pubDate": "2025-10-15T14:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "preview",
        "ga"
      ]
    },
    {
      "id": "aws-news-3bd1c75ab661",
      "title": "AWS Step Functions now supports Diagnose with Amazon Q",
      "description": "AWS announces AI-powered troubleshooting capabilities with Amazon Q integration in AWS Step Functions console. AWS Step Functions is a visual workflow service that enables customers to build distributed applications, automate IT and business processes, and build data and machine learning pipelines using AWS services. This integration brings Amazon Q's intelligent error analysis directly into AWS Step Functions console, helping you quickly identify and resolve workflow issues.\n  When errors occur in your AWS Step Functions workflows, you can now click the \"Diagnose with Amazon Q\" button that appears in error alerts and the console error notification area to receive AI-assisted troubleshooting guidance. This feature helps you resolve common types of issues including state machine execution failures as well as Amazon States Language (ASL) syntax errors and warnings. The troubleshooting recommendations appear in a dedicated window with remediation steps tailored to your error context, enabling faster resolution and improved operational efficiency.\n  Diagnose with Amazon Q for AWS Step Functions is available in all commercial AWS Regions where Amazon Q is available. The feature is automatically enabled for customers who have access to Amazon Q in their region.\n  To learn more about Diagnose with Amazon Q, see Diagnosing and troubleshooting console errors with Amazon Q or get started by visiting the AWS Step Functions console.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-step-functions-diagnose-amazon-q",
      "pubDate": "2025-10-15T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "amazon q",
        "step functions"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "amazon q",
        "step functions",
        "integration",
        "support"
      ]
    },
    {
      "id": "aws-news-7d6fdbd109cc",
      "title": "AWS SAM CLI adds Finch support, expanding local development tool options for serverless applications",
      "description": "AWS Serverless Application Model Command Line Interface (SAM CLI) now supports Finch as an alternative to Docker for local development and testing of serverless applications. This gives developers greater flexibility in choosing their preferred local development environment when working with SAM CLI to build and test their serverless applications.\n  Developers building serverless applications spend significant time in their local development environments. SAM CLI is a command-line tool for local development and testing of serverless applications. It allows you to build, test, debug, and package your serverless applications locally before deploying to AWS Cloud. To provide the local development and testing environment for your applications, SAM CLI uses a tool that can run containers on your local device. Previously, SAM CLI only supported Docker as the tool for running containers locally. Starting today, SAM CLI also supports Finch as a container development tool. Finch is an open-source tool, developed and supported by AWS, for local container development. This means you can now choose between Docker and Finch as your preferred container tool for local development when working with SAM CLI.\n  You can use SAM CLI to invoke Lambda functions locally, test API endpoints, and debug your serverless applications with the same experience you would have in the AWS Cloud. With Finch support, SAM CLI now automatically detects and uses Finch as the container development tool when Docker is not available. You can also set Finch as your preferred container tool for SAM CLI. This new feature supports all core SAM CLI commands including sam build, sam local invoke, sam local start-api, and sam local start-lambda.\n  To learn more about using SAM CLI with Finch, visit the SAM CLI developer guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-sam-cli-finch-support",
      "pubDate": "2025-10-15T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "lambda"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "lambda",
        "new-feature",
        "support"
      ]
    },
    {
      "id": "aws-news-4ad3e988928d",
      "title": "Amazon EC2 R8g instances now available in additional regions",
      "description": "Starting today, Amazon Elastic Compute Cloud (Amazon EC2) R8g instances are available in South America (Sao Paulo), Europe (London), and Asia Pacific (Melbourne) regions. These instances are powered by AWS Graviton4 processors and deliver up to 30% better performance compared to AWS Graviton3-based instances. Amazon EC2 R8g instances are ideal for memory-intensive workloads such as databases, in-memory caches, and real-time big data analytics. These instances are built on the AWS Nitro System, which oﬄoads CPU virtualization, storage, and networking functions to dedicated hardware and software to enhance the performance and security of your workloads.\n  AWS Graviton4-based Amazon EC2 instances deliver the best performance and energy efficiency for a broad range of workloads running on Amazon EC2. AWS Graviton4-based R8g instances offer larger instance sizes with up to 3x more vCPU (up to 48xlarge) and memory (up to 1.5TB) than Graviton3-based R7g instances. These instances are up to 30% faster for web applications, 40% faster for databases, and 45% faster for large Java applications compared to AWS Graviton3-based R7g instances. R8g instances are available in 12 different instance sizes, including two bare metal sizes. They offer up to 50 Gbps enhanced networking bandwidth and up to 40 Gbps of bandwidth to the Amazon Elastic Block Store (Amazon EBS).\n  To learn more, see Amazon EC2 R8g Instances. To explore how to migrate your workloads to Graviton-based instances, see AWS Graviton Fast Start program and Porting Advisor for Graviton. To get started, see the AWS Management Console.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-ec2-r8g-instances-additional-regions",
      "pubDate": "2025-10-15T12:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2",
        "graviton"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "ec2",
        "graviton",
        "now-available"
      ]
    },
    {
      "id": "aws-news-6f31d6a0a58c",
      "title": "Amazon ECS supports running Firelens as a non-root user",
      "description": "Amazon Elastic Container Services (Amazon ECS) now allows you to run Firelens containers as a non-root user, by specifying a User ID in your Task Definition.\n  Specifying a non-root user with a specific user ID reduces the potential attack footprint by users who may gain access to such software, a security best practice and a compliance requirement by some industries and security services such as the AWS Security Hub. With this release, Amazon ECS allows you to specify a user ID in the \"user\" field of your Firelens containerDefinition element of your Task Definition, instead of only allowing \"user\": \"0\" (root user).\n  The new capability is supported in all AWS Regions. See the documentation for using Firelens for more details on how to set up your Firelens container to run as non-root.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-ecs-running-firelens-as-nonroot-user/",
      "pubDate": "2025-10-15T12:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ecs"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "ecs",
        "ga",
        "support",
        "new-capability"
      ]
    },
    {
      "id": "aws-news-d2cece3fca91",
      "title": "Amazon Kinesis Data Streams announces new Fault Injection Service (FIS) actions for API errors",
      "description": "Amazon Kinesis Data Streams now supports Fault Injection Service (FIS) actions for Kinesis API errors. Customers can now test their application's error handling capabilities, retry mechanisms (such as exponential backoff patterns), and CloudWatch alarms in a controlled environment. This allows customers to validate their monitoring systems and recovery processes before encountering real-world failures, ultimately improving application resilience and availability. This integration supports Kinesis Data Streams API errors including throttling, internal errors, service unavailable, and expired iterator exceptions for Amazon Kinesis Data Streams.\n  Amazon Kinesis Data Streams is a serverless data streaming service that enables customers to capture, process, and store real-time data streams at any scale. Now customers can create real-world Kinesis Data Stream API errors (including 500, 503, and 400 errors for GET and PUT operations) to test application resilience. This feature eliminates the previous need for custom implementation or to wait for actual production failures to verify error handling mechanisms. To get started, customers can create experiment templates through the FIS console to run tests directly or integrate them into their continuous integration pipeline. For additional safety, FIS experiments include automatic stop mechanisms that trigger when customer-defined thresholds are reached, ensuring controlled testing without risking application stability.\n  These actions are generally available in all AWS Regions where FIS is available, including the AWS GovCloud (US) Regions. To learn more about using these actions, please see the Kinesis Data Streams User Guide and FIS User Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-kinesis-data-streams-fis-actions-api-errors/",
      "pubDate": "2025-10-15T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "kinesis",
        "cloudwatch"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "kinesis",
        "cloudwatch",
        "generally-available",
        "integration",
        "support"
      ]
    },
    {
      "id": "aws-news-4df1a1dcfcf4",
      "title": "Amazon MSK adds support for Apache Kafka version 4.1",
      "description": "Amazon Managed Streaming for Apache Kafka (Amazon MSK) now supports Apache Kafka version 4.1, introducing Queues as a preview feature, a new Streams Rebalance Protocol in early access, and Eligible Leader Replicas (ELR). Along with these features, Apache Kafka version 4.1 includes various bug fixes and improvements. For more details, please refer to the Apache Kafka release notes for version 4.1. \n  A key highlight of Kafka 4.1 is the introduction of Queues as a preview feature. Customers can use multiple consumers to process messages from the same topic partitions, improving parallelism and throughput for workloads that need point-to-point message delivery. The new Streams Rebalance Protocol builds upon Kafka 4.0's consumer rebalance protocol, extending broker coordination capabilities to Kafka Streams for optimized task assignments and rebalancing. Additionally, ELR is now enabled by default to strengthen availability.\n  To start using Apache Kafka 4.1 on Amazon MSK, simply select version 4.1.x when creating a new cluster via the AWS Management Console, AWS CLI, or AWS SDKs. You can also upgrade existing MSK provisioned clusters with an in-place rolling update. Amazon MSK orchestrates broker restarts to maintain availability and protect your data during the upgrade. Kafka version 4.1 support is available today across all AWS regions where Amazon MSK is offered. To learn how to get started, see the Amazon MSK Developer Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-msk-apache-kafka-version-4-1",
      "pubDate": "2025-10-15T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "kafka",
        "msk"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "kafka",
        "msk",
        "preview",
        "early-access",
        "update",
        "improvement",
        "support"
      ]
    },
    {
      "id": "aws-news-3eb898c25f1c",
      "title": "Amazon RDS for Oracle zero-ETL integration with Amazon Redshift is now available in 8 additional AWS regions",
      "description": "Amazon RDS for Oracle zero-ETL integration with Amazon Redshift is now available in the Asia Pacific (Hyderabad), Asia pacific (Jakarta), Asia Pacific (Melbourne), Canada West (Calgary), Europe (Spain), Europe (Zurich), Israel (Tel Aviv), and Middle East(UAE) Regions. Amazon RDS for Oracle zero-ETL integration with Amazon Redshift enables near real-time analytics and machine learning (ML) to analyze petabytes of transactional data in Amazon Redshift without complex data pipelines for extract-transform-load (ETL) operations. Within seconds of data being written to an Amazon RDS for Oracle database instance, the data is replicated to Amazon Redshift. Zero-ETL integrations simplify the process of analyzing data from Amazon RDS for Oracle database instances, enabling you to derive holistic insights across multiple applications with ease. \n  You can use the AWS management console, API, CLI, and AWS CloudFormation to create and manage zero-ETL integrations between RDS for Oracle and Amazon Redshift. If you use Oracle multitenant architecture, you can choose specific pluggable databases (PDBs) to selectively replicate them. In addition, you can choose specific tables and tailor replication to your needs.\n  RDS for Oracle zero-ETL integration with Redshift is available with Oracle Database version 19c. To learn more, refer Amazon RDS and Amazon Redshift documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-rds-oracle-zero-etl-integration-redshift-8-regions/",
      "pubDate": "2025-10-15T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "redshift",
        "rds",
        "cloudformation"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "redshift",
        "rds",
        "cloudformation",
        "ga",
        "now-available",
        "integration"
      ]
    },
    {
      "id": "aws-news-867f914f3036",
      "title": "AWS Application Load Balancer launches URL and Host Header Rewrite",
      "description": "Amazon Web Services (AWS) announces URL and Host Header rewrite capabilities for Application Load Balancer (ALB). This feature enables customers to modify request URLs and Host Headers using regex-based pattern matching before routing requests to targets.\n \nWith URL and Host Header rewrites, you can transform URLs using regex patterns (e.g., rewrite \"/api/v1/users\" to \"/users\"), standardize URL patterns across different applications, modify Host Headers for internal service routing, remove or add URL path prefixes, and redirect legacy URL structures to new formats. This capability eliminates the need for additional proxy layers and simplifies application architectures. The feature is valuable for microservices deployments where maintaining a single external hostname while routing to different internal services is critical.\n \nYou can configure URL and Host Header rewrites through the AWS Management Console, AWS CLI, AWS SDKs, and AWS APIs. There are no additional charges for using URL and Host Header rewrites. You pay only for your use of Application Load Balancer based on Application Load Balancer pricing.\n \nThis feature is now available in all AWS commercial regions.\n \nTo learn more, visit the ALB Documentation, and the AWS Blog post on URL and Host Header rewrites with Application Load Balancer.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/application-load-balancer-url-header-rewrite",
      "pubDate": "2025-10-15T07:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "launch",
        "ga",
        "now-available"
      ]
    },
    {
      "id": "aws-news-daa1c4b5194e",
      "title": "Amazon RDS for MySQL and PostgreSQL zero-ETL integration with Amazon Redshift now available in 8 additional regions",
      "description": "Amazon RDS for MySQL and Amazon RDS for PostgreSQL zero-ETL integration with Amazon Redshift is now available in the Asia Pacific (Hyderabad), Asia Pacific (Jakarta), Asia Pacific (Melbourne), Canada West (Calgary), Europe (Spain), Europe (Zurich), Israel (Tel Aviv), and Middle East (UAE) regions. Zero-ETL integrations enable near real-time analytics and machine learning (ML) on petabytes of transactional data using Amazon Redshift. Within seconds of data being written to Amazon RDS for MySQL or Amazon RDS for PostgreSQL, the data is replicated to Amazon Redshift. \n  You can create multiple zero-ETL integrations from a single Amazon RDS database, and you can apply data filtering for each integration to include or exclude specific databases and tables, tailoring the zero-ETL integration to your needs. You can also use AWS CloudFormation to automate the configuration and deployment of resources needed for zero-ETL integrations. \n  To learn more about zero-ETL and how to get started, visit the documentation for Amazon RDS and Amazon Redshift.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-rds-mysql-postgresql-zero-etl-redshift-8-regions/",
      "pubDate": "2025-10-15T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "redshift",
        "rds",
        "cloudformation"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "redshift",
        "rds",
        "cloudformation",
        "ga",
        "now-available",
        "integration"
      ]
    },
    {
      "id": "aws-news-adb54897be57",
      "title": "AWS Backup expands information in job APIs and Backup Audit Manager reports",
      "description": "AWS Backup now provides more details in backup job API responses and Backup Audit Manager reports to give you better visibility into backup configurations and compliance settings. You can verify your backup policies with a single API call.\n \nList and Describe APIs for backup, copy, and restore jobs now return fields that required multiple API calls before. Delegated administrators can now view backup job details across their organization. Backup jobs APIs include retention settings, vault lock status, encryption details, and backup plan information like plan names, rule names, and schedules. Copy job APIs return destination vault configurations, vault type, lock state, and encryption settings. Restore job APIs show source resource details and vault access policies. Backup Audit Manager reports include new columns with vault type, lock status, encryption details, archive settings, and retention periods. You can use this information to enhance audit trails and verify compliance with data protection policies.\n \nThese expanded information fields are available today in all AWS Regions where AWS Backup and AWS Backup Audit Manager are supported, with no additional charges.\n \nTo learn more about AWS Backup Audit Manager, visit the product page and documentation. To get started, visit the AWS Backup console.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-backup-expands-information-job-api-audit-manager/",
      "pubDate": "2025-10-15T07:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-d39997d80f80",
      "title": "Introducing Amazon EBS Volume Clones: Create instant copies of your EBS volumes",
      "description": "AWS launched Amazon EBS Volume Clones, a new capability that allows users to create instant point-in-time copies of EBS volumes within the same Availability Zone with a single API call, eliminating the previous multi-step process of taking snapshots and creating volumes from them.",
      "link": "https://aws.amazon.com/blogs/aws/introducing-amazon-ebs-volume-clones-create-instant-copies-of-your-ebs-volumes/",
      "pubDate": "2025-10-14T21:35:05.000Z",
      "source": "newsBlog",
      "services": [],
      "categories": [
        "news"
      ],
      "tags": [
        "launch",
        "new-capability"
      ]
    },
    {
      "id": "aws-news-81db890df609",
      "title": "AWS Transfer Family SFTP connectors now support VPC-based connectivity",
      "description": "AWS Transfer Family SFTP connectors now support VPC-based connectivity, allowing secure file transfers between Amazon S3 and remote SFTP servers through your existing VPC infrastructure without exposing endpoints to the internet.",
      "link": "https://aws.amazon.com/blogs/aws/aws-transfer-family-sftp-connectors-now-support-vpc-based-connectivity/",
      "pubDate": "2025-10-14T19:27:31.000Z",
      "source": "newsBlog",
      "services": [
        "s3"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "s3",
        "support"
      ]
    },
    {
      "id": "aws-news-1c61aba3dcd8",
      "title": "Amazon EC2 M7i instances are now available in the Europe (Milan) Region",
      "description": "Starting today, Amazon Elastic Compute Cloud (Amazon EC2) M7i instances powered by custom 4th Gen Intel Xeon Scalable processors (code-named Sapphire Rapids) are available in the Europe (Milan) region. These custom processors, available only on AWS, offer up to 15% better performance over comparable x86-based Intel processors utilized by other cloud providers.\n  M7i deliver up to 15% better price-performance compared to M6i. M7i instances are a great choice for workloads that need the largest instance sizes or continuous high CPU usage, such as gaming servers, CPU-based machine learning (ML), and video-streaming. M7i offer larger instance sizes, up to 48xlarge, and two bare metal sizes (metal-24xl, metal-48xl). These bare-metal sizes support built-in Intel accelerators: Data Streaming Accelerator, In-Memory Analytics Accelerator, and QuickAssist Technology that are used to facilitate efficient offload and acceleration of data operations and optimize performance for workloads.\n  To learn more, visit Amazon EC2 M7i Instances. To get started, see the AWS Management Console.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-ec2-m7i-instances-milan-region/",
      "pubDate": "2025-10-14T16:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "ga",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-af96d7936e65",
      "title": "Amazon AppStream 2.0 announces availability of license included Microsoft applications",
      "description": "Amazon AppStream 2.0 now offers Microsoft applications with licenses included, providing customers with the flexibility to run these applications on AppStream 2.0 fleets. As part of this launch, AppStream 2.0 provides Microsoft Office, Visio, and Project 2021/2024 in both Standard and Professional editions. Each is available in both 32-bit and 64-bit versions for On-Demand and Always-On fleets.\n  Administrators can dynamically control applications availability by adding or removing applications from AppStream 2.0 images and fleets. End users benefit from a seamless experience, accessing Microsoft applications that are fully integrated with their business applications within their AppStream 2.0 sessions. This helps in ensuring that users can work efficiently with both Microsoft and business applications in a unified environment, eliminating the need for switching between different platforms or services.\n  To get started, create an AppStream custom image by launching an image builder with a Windows Server operating system image. Select the desired set of applications to be installed. Then connect to the image builder and complete image creation by following the Amazon AppStream 2.0 Administration Guide. You must use an AppStream 2.0 Image Builder that uses an AppStream 2.0 agent released on or after October 2, 2025 Or, your image must use managed AppStream 2.0 image updates released on or after October 3, 2025.\n  This functionality is generally available in all regions where AppStream 2.0 is offered. Customers are billed per hour for the AppStream streaming resources, and per-user per-month (non-prorated) for Microsoft applications. Please see Amazon AppStream 2.0 Pricing for more information.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-appstream-license-included-apps",
      "pubDate": "2025-10-14T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "launch",
        "generally-available",
        "update"
      ]
    },
    {
      "id": "aws-news-b4f91e644bb4",
      "title": "Announcing AWS for Fluent Bit 3.0.0 based on Fluent Bit 4.1.0",
      "description": "AWS for Fluent Bit announces version 3.0.0, based on Fluent Bit version 4.1.0 and Amazon Linux 2023. Container logging using AWS for Fluent Bit is now more performant and more feature-rich for AWS customers, including those using Amazon Elastic Container Services (Amazon ECS) and Amazon Elastic Kubernetes Service (Amazon EKS).\n  AWS for Fluent Bit enables Amazon ECS and Amazon EKS customers to collect, process, and route container logs to destinations including Amazon CloudWatch Logs, Amazon Data Firehose, Amazon Kinesis Data Streams, and Amazon S3 without changing application code. AWS for Fluent Bit 3.0.0 upgrades the Fluent Bit version to 4.1.0, and upgrades the base image to Amazon Linux 2023. These updates deliver access to the latest Fluent Bit features, significant performance improvements, and enhanced security. New features include native OpenTelemetry (OTel) support for ingesting and forwarding OTLP logs, metrics, and traces with AWS SigV4 authentication—eliminating the need for additional sidecars. Performance improvements include faster JSON parsing, processing more logs per vCPU with lower latency. Security enhancements include TLS min version and cipher controls, which enforce your TLS policy on outputs from AWS for Fluent Bit for stronger protocol posture.\n  You can use AWS for Fluent Bit 3.0.0 on both ECS and EKS. On ECS, update the FireLens log-router container image in your task definition to the 3.0.0 tag from the Amazon ECR Public Gallery. On EKS, upgrade by either updating the Helm release or setting the DaemonSet image to the 3.0.0 version.\n  The AWS for Fluent Bit image is available in the Amazon ECR Public Gallery and in the Amazon ECR repository. You can also find it on GitHub for source code and additional guidance.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-fluent-bit-3-0-0-based-4-1-0",
      "pubDate": "2025-10-14T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "s3",
        "ecs",
        "eks",
        "kinesis",
        "cloudwatch"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "s3",
        "ecs",
        "eks",
        "kinesis",
        "cloudwatch",
        "ga",
        "new-feature",
        "update",
        "improvement",
        "enhancement",
        "support"
      ]
    },
    {
      "id": "aws-news-50d17ac8269d",
      "title": "Amazon EBS now supports Volume Clones for instant volume copies",
      "description": "Today, Amazon Web Services (AWS) announces the general availability of Volume Clones for Amazon Elastic Block Store (Amazon EBS), our high-performance block storage service. This new capability allows you to instantly create and access point-in-time copies of EBS volumes within the same Availability Zone (AZ), accelerating software development workflows and enhancing operational agility.\n  Customers use Amazon EBS volumes as durable block storage attached to Amazon EC2 instances. With Amazon EBS Volume Clones, you can instantly create copies of volumes and access the copied volumes with single-digit millisecond latency. Amazon EBS Volume Clones enables rapid creation of test and development environments from production volumes, eliminating manual copy workflows. Additionally, Volume Clones integrates with the Amazon EBS Container Storage Interface (CSI) driver, simplifying storage management for containerized applications.\n  Amazon EBS Volume Clones is available in all AWS Commercial Regions and AWS GovCloud (US) Regions. You can access Volume Clones through the AWS Console, AWS Command Line Interface (CLI), AWS SDKs, and AWS CloudFormation. This capability supports all EBS volume types and works for volume copies within the same account and AZ.\n  For detailed pricing information, please visit the EBS pricing page. To explore how Volume Clones can accelerate your software development processes and improve operational efficiency, visit the AWS documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-ebs-volume-clones-instant-volume-copies",
      "pubDate": "2025-10-14T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2",
        "cloudformation"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "ec2",
        "cloudformation",
        "support",
        "new-capability"
      ]
    },
    {
      "id": "aws-news-24029d05087c",
      "title": "What’s New in the AWS Deploy Tool for .NET",
      "description": "Version 2.0 of the AWS Deploy Tool for .NET is now available. This new major version introduces several foundational upgrades to improve the deployment experience for .NET applications on AWS. The tool comes with new minimum runtime requirements. We have upgraded it to require .NET 8 because the predecessor, .NET 6, is now out of […]",
      "link": "https://aws.amazon.com/blogs/developer/whats-new-in-the-aws-deploy-tool-for-net/",
      "pubDate": "2025-10-14T13:25:42.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "now-available"
      ]
    },
    {
      "id": "aws-news-b6bc98d95257",
      "title": "Amazon Route 53 Profiles now supports AWS PrivateLink",
      "description": "Amazon Route 53 Profiles now supports AWS PrivateLink. Customers can now access and manage their Profiles privately, without going through the public internet. AWS PrivateLink provides private connectivity between VPCs, AWS services, and on-premises applications, securely over the Amazon network. When Route 53 Profiles is accessed via AWS PrivateLink, all operations, such as creating, deleting, editing, and listing of Profiles, can be handled via the Amazon private network. \n  Route 53 Profiles allows you to define a standard DNS configuration, in the form of a Profile, that may include Route 53 private hosted zone (PHZ) associations, Route 53 Resolver rules, and Route 53 Resolver DNS Firewall rule groups, and apply this configuration to multiple VPCs in your account. Profiles can also be used to enforce DNS settings for your VPCs, with configurations for DNSSEC validations, Resolver reverse DNS lookups, and the DNS Firewall failure mode. You can share Profiles with AWS accounts in your organization using AWS Resource Access Manager (RAM). Customers can use Profiles with AWS PrivateLink in regions where Route 53 Profiles is available today, including the AWS GovCloud (US) Regions. For more information about the AWS Regions where Profiles is available, see here.\n  To learn more about configuring Route 53 Profiles, please refer to the service documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-route-53-profiles-supports-aws-privatelink",
      "pubDate": "2025-10-14T07:19:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-381916b2143a",
      "title": "Amazon EC2 M8g instances now available in additional regions",
      "description": "Starting today, Amazon Elastic Compute Cloud (Amazon EC2) M8g instances are available in AWS Europe (Paris), Asia Pacific (Osaka), AWS Canada (Central), and AWS Middle East (Bahrain) regions. These instances are powered by AWS Graviton4 processors and deliver up to 30% better performance compared to AWS Graviton3-based instances. Amazon EC2 M8g instances are built for general-purpose workloads, such as application servers, microservices, gaming servers, midsize data stores, and caching fleets. These instances are built on the AWS Nitro System, which oﬄoads CPU virtualization, storage, and networking functions to dedicated hardware and software to enhance the performance and security of your workloads.\n  AWS Graviton4-based Amazon EC2 instances deliver the best performance and energy efficiency for a broad range of workloads running on Amazon EC2. These instances offer larger instance sizes with up to 3x more vCPUs and memory compared to Graviton3-based Amazon M7g instances. AWS Graviton4 processors are up to 40% faster for databases, 30% faster for web applications, and 45% faster for large Java applications than AWS Graviton3 processors. M8g instances are available in 12 different instance sizes, including two bare metal sizes. They offer up to 50 Gbps enhanced networking bandwidth and up to 40 Gbps of bandwidth to the Amazon Elastic Block Store (Amazon EBS).\n  To learn more, see Amazon EC2 M8g Instances. To explore how to migrate your workloads to Graviton-based instances, see AWS Graviton Fast Start program and Porting Advisor for Graviton. To get started, see the AWS Management Console.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-ec2-m8g-instances-additional-regions/",
      "pubDate": "2025-10-14T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2",
        "graviton"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "ec2",
        "graviton",
        "ga",
        "now-available"
      ]
    },
    {
      "id": "aws-news-abde2effb621",
      "title": "Amazon Connect now provides configurable thresholds for schedule adherence",
      "description": "Amazon Connect now provides configurable thresholds for schedule adherence, giving you more flexibility in how you track agent performance. You can define thresholds for how early or late agents start or end their shifts, as well as for individual activities. For example, agents can start their shift 5 minutes early and end 10 minutes late, or end their breaks 3 minutes late, without negatively impacting their adherence scores. You can further customize these thresholds for individual teams. For example, teams that handle contacts with long handle times can be given more flexibility in when they start their breaks. This launch enables managers to focus on true adherence violations and eliminates the impact of minor schedule deviations on agent performance, thus improving manager productivity and agent satisfaction.\n  This feature is available in all AWS Regions where Amazon Connect agent scheduling is available. To learn more about Amazon Connect agent scheduling, click here.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-connect-configurable-thresholds-schedule-adherence/",
      "pubDate": "2025-10-14T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "launch",
        "ga"
      ]
    },
    {
      "id": "aws-news-d6476f421108",
      "title": "AWS Transfer Family SFTP connectors now support VPC-based connectivity",
      "description": "AWS Transfer Family SFTP connectors can now connect to remote SFTP servers through your Amazon Virtual Private Cloud (VPC). This enables you to transfer files between Amazon S3 and any SFTP server, whether privately or publicly hosted, while leveraging the security controls and network configurations already defined in your VPC. By utilizing your NAT Gateways' bandwidth for file transfers over SFTP, you can achieve improved transfer performance and ensure compatibility with remote firewalls.\n  AWS Transfer Family provides fully managed file transfers over SFTP, FTP, FTPS, AS2 and web-browser based interfaces. You can now use Transfer Family SFTP connectors to connect with SFTP servers that are only accessible from your VPC, including on-premises systems, external servers shared over private networks, or in-VPC servers. You can present the IP addresses from your VPC’s CIDR range for compatibility with IP controls, and achieve higher bandwidth for large-scale transfers via your NAT gateways when connecting over the internet. All connections are routed through your VPC’s existing networking and security controls, such as AWS Transit Gateway, centralized firewalls and traffic inspection points, helping you meet data security mandates. \n  SFTP connectors support for VPC-based connectivity is available in select AWS Regions. To get started, visit the AWS Transfer Family console, or use AWS CLI/SDK. To learn more, read the AWS News Blog or visit the Transfer Family User Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-transfer-family-sftp-connectors-vpc-based-connectivity/",
      "pubDate": "2025-10-14T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "s3"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "s3",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-548c73eeb720",
      "title": "Amazon MSK Connect is now available in ten additional AWS Regions",
      "description": "Amazon MSK Connect is now available in ten additional AWS Regions: Asia Pacific (Jakarta), Asia Pacific (Hong Kong), Asia Pacific (Osaka), Asia Pacific (Melbourne), Europe (Milan), Europe (Zurich), Middle East (Bahrain), Middle East (UAE), Africa (Cape Town), and Israel (Tel Aviv).\n  MSK Connect enables you to run fully managed Kafka Connect clusters with Amazon Managed Streaming for Apache Kafka (Amazon MSK). With a few clicks, MSK Connect allows you to easily deploy, monitor, and scale connectors that move data in and out of Apache Kafka and Amazon MSK clusters from external systems such as databases, file systems, and search indices. MSK Connect eliminates the need to provision and maintain cluster infrastructure. Connectors scale automatically in response to increases in usage and you pay only for the resources you use. With full compatibility with Kafka Connect, it is easy to migrate workloads without code changes. MSK Connect will support both Amazon MSK-managed and self-managed Apache Kafka clusters.\n  You can get started with MSK Connect from the Amazon MSK console or the Amazon CLI. Visit the AWS Regions page for all the regions where Amazon MSK is available. To get started visit, the MSK Connect product page, pricing page, and the Amazon MSK Developer Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-msk-connect-ten-additional-regions/",
      "pubDate": "2025-10-14T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "kafka",
        "msk"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "kafka",
        "msk",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-cc1315a3715a",
      "title": "Visualize data lineage using Amazon SageMaker Catalog for Amazon EMR, AWS Glue, and Amazon Redshift",
      "description": "Amazon SageMaker offers a comprehensive hub that integrates data, analytics, and AI capabilities, providing a unified experience for users to access and work with their data. Through Amazon SageMaker Unified Studio, a single and unified environment, you can use a wide range of tools and features to support your data and AI development needs, including […]",
      "link": "https://aws.amazon.com/blogs/big-data/visualize-data-lineage-using-amazon-sagemaker-catalog-for-amazon-emr-aws-glue-and-amazon-redshift/",
      "pubDate": "2025-10-13T19:08:49.000Z",
      "source": "bigDataBlog",
      "services": [
        "sagemaker",
        "unified studio",
        "emr",
        "redshift",
        "glue"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "unified studio",
        "emr",
        "redshift",
        "glue",
        "support"
      ]
    },
    {
      "id": "aws-news-5389fe826966",
      "title": "AWS Weekly Roundup: Amazon Quick Suite, Amazon EC2, Amazon EKS, and more (October 13, 2025)",
      "description": "This week I was at the inaugural AWS AI in Practice meetup from the AWS User Group UK. AI-assisted software development and agents were the focus of the evening! Next week I’ll be in Italy for Codemotion (Milan) and an AWS User Group meetup (Rome). My sessions there will be about AI agents and context […]",
      "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-amazon-quick-suite-amazon-ec2-amazon-eks-and-more-october-13-2025/",
      "pubDate": "2025-10-13T16:24:15.000Z",
      "source": "newsBlog",
      "services": [
        "amazon q",
        "ec2",
        "eks"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "amazon q",
        "ec2",
        "eks"
      ]
    },
    {
      "id": "aws-news-234592ddfd8b",
      "title": "Amazon Quick Sight expands font customization for visuals",
      "description": "Amazon Quick Sight now supports font customization for data labels and axes. Authors can now customize fonts for data labels and axes in supported charts, in addition to the previously supported font customization for visual titles, subtitles, and legend, as well as tables and pivot tables headers.\n  Authors can set the font size (in pixels), font family, color, and styling options like bold, italics, and underline across analysis, including dashboards, reports and embedded scenarios. With this update, you can further align your dashboard's fonts with your organization's branding guidelines, creating a more cohesive and visually appealing experience. Additionally, the expanded font customization options help improve readability, especially when viewing visualizations on large screens.\n  This is now available in all supported Amazon Quick Suite regions.\n  To learn more about this, visit Amazon Quick Suite Visual formatting guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-quicksight-expands-font-customization",
      "pubDate": "2025-10-13T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "amazon q",
        "rds"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "amazon q",
        "rds",
        "ga",
        "now-available",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-e3cec7eabef2",
      "title": "Amazon EC2 High Memory U7i instances now available in Asia Pacific (Mumbai) Region",
      "description": "Starting today, Amazon EC2 High Memory U7i instances with 12TB of memory (u7i-12tb.224xlarge) are now available in the Asia Pacific (Mumbai) region. U7i-12tb instances are part of AWS 7th generation and are powered by custom fourth generation Intel Xeon Scalable Processors (Sapphire Rapids). U7i-12tb instances offer 12TiB of DDR5 memory enabling customers to scale transaction processing throughput in a fast-growing data environment.\n  U7i-12tb instances offer 896 vCPUs, support up to 100Gbps Elastic Block Storage (EBS) for faster data loading and backups, deliver up to 100Gbps of network bandwidth, and support ENA Express. U7i instances are ideal for customers using mission-critical in-memory databases like SAP HANA, Oracle, and SQL Server.\n  To learn more about U7i instances, visit the High Memory instances page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-ec2-high-memory-u7i-instances-asia-pacific-mumbai-region",
      "pubDate": "2025-10-13T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "ec2",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-65e8716647ee",
      "title": "Amazon SageMaker AI Projects now supports custom template S3 provisioning",
      "description": "Amazon SageMaker AI Projects now supports provisioning custom machine learning (ML) project templates from Amazon S3. Administrators can now manage ML templates in SageMaker AI studio so data scientists can create standardized ML projects to meet their organizational needs.\n  Data scientists can use Amazon SageMaker AI Projects to create standardized ML projects that meet organizational requirements and automate ML development workflows. Administrators define standardized ML project templates that include end-to-end development patterns. By provisioning custom templates from Amazon S3, administrators can define standardized project templates and provide access to these templates directly in the SageMaker AI studio for data scientists, ensuring all ML projects follow organizational standards.\n  SageMaker AI Projects custom template S3 provisioning is available in all AWS Regions where SageMaker AI Projects is available.\n  To learn more, visit SageMaker AI Projects documentation, and SageMaker AI Studio.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-sagemaker-ai-projects-custom-template-s3-provisioning",
      "pubDate": "2025-10-13T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "sagemaker",
        "s3",
        "rds"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "s3",
        "rds",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-961ec6ffd98f",
      "title": "Amazon Bedrock AgentCore is now generally available",
      "description": "Amazon Bedrock AgentCore is an agentic platform to build, deploy and operate highly capable agents securely at scale using any framework, model, or protocol. AgentCore lets you build agents faster, enable agents to take actions across tools and data, run agents securely with low-latency and extended runtimes, and monitor agents in production - all without any infrastructure management.\n \nWith general availability, all AgentCore services now have support for Virtual Private Cloud (VPC), AWS PrivateLink, AWS CloudFormation, and resource tagging, enabling developers to deploy AI agents with enhanced enterprise security and infrastructure automation capabilities. AgentCore Runtime builds on its preview capabilities of industry-leading eight-hour execution windows and complete session isolation by adding support for the Agent-to-Agent (A2A) protocol, with broader A2A support coming soon across all AgentCore services. AgentCore Memory now offers a self-managed strategy that gives you complete control over your memory extraction and consolidation pipelines. AgentCore Gateway now connects to existing Model Context Protocol (MCP) servers in addition to transforming APIs and Lambda functions into agent-compatible tools. It also supports Identity and Access Management (IAM) authorization enabling customers to leverage IAM in additional to OAuth for secure agent to tool interactions over MCP, and acts as a single, secure endpoint for agents to discover and use tools without the need for custom integrations. AgentCore Identity now offers identity-aware authorization, secure vault storage for refresh tokens, and native integration with additional OAuth-enabled services so agents can securely act on behalf of users or by themselves with enhanced access controls. AgentCore Observability now delivers complete visibility into end-to-end agent execution and operational metrics across all AgentCore services through dashboards powered by Amazon CloudWatch, and it is OTEL compatible, offering seamless integration with Amazon CloudWatch and external observability providers like Dynatrace, Datadog, Arize Phoenix, LangSmith, and Langfuse. AgentCore works with any open source framework (CrewAI, LangGraph, LlamaIndex, Google ADK, OpenAI Agents SDK) and any model in or outside Amazon Bedrock, giving you freedom to use your preferred frameworks and models, and innovate with confidence.\n \nAmazon Bedrock AgentCore is available in nine AWS Regions: US East (N. Virginia), US East (Ohio), US West (Oregon), Asia Pacific (Mumbai), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Europe (Frankfurt), and Europe (Ireland).\n \nLearn more about AgentCore through the blog, deep dive using the AgentCore resources, and get started with the AgentCore Starter Toolkit. AgentCore offers consumption-based pricing with no upfront costs.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-bedrock-agentcore-available/",
      "pubDate": "2025-10-13T13:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "bedrock",
        "agentcore",
        "nova",
        "lambda",
        "rds",
        "cloudformation",
        "iam",
        "cloudwatch"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "bedrock",
        "agentcore",
        "nova",
        "lambda",
        "rds",
        "cloudformation",
        "iam",
        "cloudwatch",
        "preview",
        "generally-available",
        "ga",
        "integration",
        "support",
        "coming-soon"
      ]
    },
    {
      "id": "aws-news-330d04505277",
      "title": "AWS Config now supports 3 new resource types",
      "description": "AWS Config now supports 3 additional AWS resource types. This expansion provides greater coverage over your AWS environment, enabling you to more effectively discover, assess, audit, and remediate an even broader range of resources.\n  With this launch, if you have enabled recording for all resource types, then AWS Config will automatically track these new additions. The newly supported resource types are also available in Config rules and Config aggregators.\n  You can now use AWS Config to monitor the following newly supported resource types in all AWS Regions where the supported resources are available:\n \nResource Types:\n \nAWS::ApiGatewayV2::Integration\n \nAWS::CloudTrail::EventDataStore\n \nAWS::Config::StoredQuery",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-config-new-resource-types",
      "pubDate": "2025-10-13T07:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "launch",
        "ga",
        "integration",
        "support",
        "expansion"
      ]
    },
    {
      "id": "aws-news-dab31e1d7fd7",
      "title": "AWS Service Availability Updates",
      "description": "After careful consideration, we’re announcing availability changes for a select group of AWS services and features. These changes fall into three lifecycle categories:\n  Services and Capabilities moving to Maintenance\n  Services moving to maintenance will no longer be accessible to new customers starting Nov 7, 2025. Current customers can continue using the service or feature while exploring alternative solutions.\n  \n \n \nAmazon Cloud Directory\n \n \nAmazon CodeCatalyst\n \n \nAmazon CodeGuru Reviewer\n \n \nAmazon Fraud Detector\n \n \nAmazon Glacier\n \n \nAmazon S3 Object Lambda\n \n \nAmazon Workspaces Web Access Client for PCoIP (STXHD)\n \n \nAWS Application Discovery Service\n \n \nAWS HealthOmics - Variant and Annotation Store\n \n \nAWS IoT SiteWise Edge Data Processing Pack\n \n \nAWS IoT SiteWise Monitor\n \n \nAWS Mainframe Modernization Service\n \n \nAWS Migration Hub\n \n \nAWS Snowball Edge Compute Optimized\n \n \nAWS Snowball Edge Storage Optimized\n \n \nAWS Systems Manager - Change Manager\n \n \nAWS Systems Manager - Incident Manager\n \n \nAWS Thinkbox Deadline 10\n \n \n.NET Modernization Tools\n \n \n\n Services Entering Sunset\n  The following services are entering sunset, and we are announcing the date upon which we will end operations and support of the service. Customers using these services should click on the links below to understand the sunset timeline (typically 12 months), and begin planning migration to alternatives as recommended in the updated service web pages and documentation.\n  \n \n \nAmazon FinSpace\n \n \nAmazon Lookout for Equipment\n \n \nAWS IoT Greengrass v1\n \n \nAWS Proton\n \n \n\n Services Reaching End of Support\n  The following services have reached end of support and are no longer available as of October 7, 2025.\n  \n \n \n \nAWS Mainframe Modernization App Testing\n \n \n\n For customers affected by these changes, we've prepared comprehensive migration guides and our support teams are ready to assist with your transition. Visit AWS Product Lifecycle Page to learn more. or contact AWS Support.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-service-availability/",
      "pubDate": "2025-10-13T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "codeguru",
        "fraud detector",
        "lookout for equipment",
        "lambda",
        "s3"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "codeguru",
        "fraud detector",
        "lookout for equipment",
        "lambda",
        "s3",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-7f3e5d08a405",
      "title": "Announcing vector search for Amazon ElastiCache",
      "description": "Vector search for Amazon ElastiCache is now generally available. Customers can now use ElastiCache to index, search, and update billions of high-dimensional vector embeddings from popular providers like Amazon Bedrock, Amazon SageMaker, Anthropic, and OpenAI with latency as low as microseconds and up to 99% recall.\n  Key use cases include semantic caching for large language models (LLMs) and multi-turn conversational agents, which significantly reduce latency and cost by caching semantically similar queries. Vector search for ElastiCache also powers agentic AI systems with Retrieval Augmented Generation (RAG) to ensure highly relevant results and consistently low latency across multiple retrieval steps. Additional use cases include recommendation engines, anomaly detection, and other applications that require efficient search across multiple data modalities.\n  Vector search for ElastiCache is available with Valkey version 8.2 on node-based clusters in all AWS Regions at no additional cost. To get started, create a Valkey 8.2 cluster using the AWS Management Console, AWS Software Development Kit (SDK), or AWS Command Line Interface (CLI). You can also use vector search on your existing clusters by upgrading from any version of Valkey or Redis OSS to Valkey 8.2 in a few clicks with no downtime. To learn more about vector search for ElastiCache for Valkey read this blog and for a list of supported commands see the ElastiCache documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-elasticache-vector-search/",
      "pubDate": "2025-10-13T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "bedrock",
        "sagemaker"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "bedrock",
        "sagemaker",
        "generally-available",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-b3e17de0c802",
      "title": "Generative AI observability now generally available for Amazon CloudWatch",
      "description": "Amazon CloudWatch announces the general availability of generative AI observability, helping you monitor all components of AI applications and workloads, including agents deployed and operated with Amazon Bedrock AgentCore. This release expands beyond runtime monitoring to include complete observability across AgentCore's Built-in Tools, Gateways, Memory, and Identity capabilities. DevOps teams and developers can now get an out-of-the-box view into latency, token usage, errors, and performance across all components of their AI workloads, from model invocations to agent operations. This feature is compatible with popular generative AI orchestration frameworks such as Strands Agents, LangChain, and LangGraph, offering flexibility with your choice of framework.\n  With this new feature, CloudWatch enables developers to analyzes telemetry data across components of a generative AI application. Customers can monitor code execution patterns in Built-in Tools, track API transformation success rates through Gateways, analyze memory storage and retrieval patterns, and ensure secure agent behavior through Identity observability. The connected view helps developers quickly identify issues - from gaps in VectorDB to authentication failures - using end-to-end prompt tracing, curated metrics, and logs. Developers can monitor their entire agent fleet through the \"AgentCore\" section in the CloudWatch console, which integrates seamlessly with other CloudWatch capabilities including Application Signals, Alarms, Sensitive Data Protection, and Logs Insights.\n  This feature is now available in US East (N. Virginia), US East (Ohio), US West (Oregon), Europe (Frankfurt), Europe (Ireland), Asia Pacific (Mumbai), Asia Pacific (Tokyo), Asia Pacific (Singapore), and Asia Pacific (Sydney).\n  To learn more, visit documentation. There is no additional pricing for Gen AI Observability, existing CloudWatch pricing for underlying telemetry data applies.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/generative-ai-observability-amazon-cloudwatch/",
      "pubDate": "2025-10-13T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "bedrock",
        "agentcore",
        "lex",
        "cloudwatch"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "bedrock",
        "agentcore",
        "lex",
        "cloudwatch",
        "generally-available",
        "ga",
        "now-available",
        "new-feature"
      ]
    },
    {
      "id": "aws-news-447e7b731c69",
      "title": "Building a real-time ICU patient analytics pipeline with AWS Lambda event source mapping",
      "description": "In this post, we demonstrate how to build a serverless architecture that processes real-time ICU patient monitoring data using Lambda event source mapping for immediate alert generation and data aggregation, followed by persistent storage in Amazon S3 with an Iceberg catalog for comprehensive healthcare analytics.",
      "link": "https://aws.amazon.com/blogs/big-data/building-a-real-time-icu-patient-analytics-pipeline-with-aws-lambda-event-source-mapping/",
      "pubDate": "2025-10-10T21:55:53.000Z",
      "source": "bigDataBlog",
      "services": [
        "lambda",
        "s3"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "lambda",
        "s3",
        "ga"
      ]
    },
    {
      "id": "aws-news-7f665ce82bee",
      "title": "Announcing Amazon Quick Suite: your agentic teammate for answering questions and taking action",
      "description": "Amazon has announced Quick Suite, a new AI-powered workspace that combines research, business intelligence, and automation tools to help users analyze data and streamline workflows all in one place.",
      "link": "https://aws.amazon.com/blogs/aws/reimagine-the-way-you-work-with-ai-agents-in-amazon-quick-suite/",
      "pubDate": "2025-10-09T15:42:04.000Z",
      "source": "newsBlog",
      "services": [
        "amazon q"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "amazon q"
      ]
    },
    {
      "id": "aws-news-f82487644618",
      "title": "New general-purpose Amazon EC2 M8a instances are now available",
      "description": "Amazon EC2 has launched new M8a instances powered by 5th Generation AMD EPYC processors, offering up to 30% better performance and 19% better price performance compared to M7a instances, along with improved memory bandwidth, networking, and storage capabilities for various general-purpose workloads.",
      "link": "https://aws.amazon.com/blogs/aws/new-general-purpose-amazon-ec2-m8a-instances-are-now-available/",
      "pubDate": "2025-10-08T19:03:27.000Z",
      "source": "newsBlog",
      "services": [
        "ec2"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "ec2",
        "launch",
        "now-available"
      ]
    },
    {
      "id": "aws-news-3dda8646e5ea",
      "title": "Best practices for migrating from Apache Airflow 2.x to Apache Airflow 3.x on Amazon MWAA",
      "description": "Apache Airflow 3.x on Amazon MWAA introduces architectural improvements such as API-based task execution that provides enhanced security and isolation. This migration presents an opportunity to embrace next-generation workflow orchestration capabilities while providing business continuity. This post provides best practices and a streamlined approach to successfully navigate this critical migration, providing minimal disruption to your mission-critical data pipelines while maximizing the enhanced capabilities of Airflow 3.",
      "link": "https://aws.amazon.com/blogs/big-data/best-practices-for-migrating-from-apache-airflow-2-x-to-apache-airflow-3-x-on-amazon-mwaa/",
      "pubDate": "2025-10-07T17:31:02.000Z",
      "source": "bigDataBlog",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga",
        "improvement"
      ]
    },
    {
      "id": "aws-news-9e7494f39734",
      "title": "Bridging data silos: cross-bounded context querying with Vanguard’s Operational Read-only Data Store (ORDS) using Amazon Redshift",
      "description": "At Vanguard, we faced significant challenges with our legacy mainframe system that limited our ability to deliver modern, personalized customer experiences. Our centralized database architecture created performance bottlenecks and made it difficult to scale services independently for our millions of personal and institutional investors. In this post, we show you how we modernized our data architecture using Amazon Redshift as our Operational Read-only Data Store (ORDS).",
      "link": "https://aws.amazon.com/blogs/big-data/bridging-data-silos-cross-bounded-context-querying-with-vanguards-operational-read-only-data-store-ords-using-amazon-redshift/",
      "pubDate": "2025-10-06T21:32:33.000Z",
      "source": "bigDataBlog",
      "services": [
        "personalize",
        "redshift",
        "rds"
      ],
      "categories": [
        "ai-services"
      ],
      "tags": [
        "personalize",
        "redshift",
        "rds",
        "ga"
      ]
    },
    {
      "id": "aws-news-c3978789eac6",
      "title": "Seamlessly Integrate Data on Google BigQuery and ClickHouse Cloud with AWS Glue",
      "description": "Migrating from Google Cloud’s BigQuery to ClickHouse Cloud on AWS allows businesses to leverage the speed and efficiency of ClickHouse for real-time analytics while benefiting from AWS’s scalable and secure environment. This article provides a comprehensive guide to executing a direct data migration using AWS Glue ETL, highlighting the advantages and best practices for a […]",
      "link": "https://aws.amazon.com/blogs/big-data/seamlessly-integrate-data-on-google-bigquery-and-clickhouse-cloud-with-aws-glue/",
      "pubDate": "2025-10-06T21:29:33.000Z",
      "source": "bigDataBlog",
      "services": [
        "glue"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "glue"
      ]
    },
    {
      "id": "aws-news-ef90ff9c031a",
      "title": "Introducing new compute-optimized Amazon EC2 C8i and C8i-flex instances",
      "description": "AWS launched compute-optimized C8i and C8i-flex EC2 instances powered by custom Intel Xeon 6 processors available only on AWS to offer up to 15% better price performance, 20% higher performance, and 2.5 times more memory throughput compared to previous generations.",
      "link": "https://aws.amazon.com/blogs/aws/introducing-new-compute-optimized-amazon-ec2-c8i-and-c8i-flex-instances/",
      "pubDate": "2025-10-06T20:33:28.000Z",
      "source": "newsBlog",
      "services": [
        "lex",
        "ec2"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "lex",
        "ec2",
        "launch"
      ]
    },
    {
      "id": "aws-news-d16124a12b63",
      "title": "AWS IAM Identity Center now supports customer-managed KMS keys for encryption at rest",
      "description": "Gain control over encryption and comply with regulations using customer-managed keys for AWS IAM Identity Center's user data and passwords.",
      "link": "https://aws.amazon.com/blogs/aws/aws-iam-identity-center-now-supports-customer-managed-kms-keys-for-encryption-at-rest/",
      "pubDate": "2025-10-06T19:52:06.000Z",
      "source": "newsBlog",
      "services": [
        "rds",
        "iam",
        "iam identity center"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "rds",
        "iam",
        "iam identity center",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-4e23bbfb91df",
      "title": "AWS Weekly Roundup:  Amazon Bedrock, AWS Outposts, Amazon ECS Managed Instances, AWS Builder ID, and more (October 6, 2025)",
      "description": "Last week, Anthropic’s Claude Sonnet 4.5—the world’s best coding model according to SWE-Bench – became available in Amazon Q command line interface (CLI) and Kiro. I’m excited about this for two reasons: First, a few weeks ago I spent 4 intensive days with a global customer delivering an AI-assisted development workshop, where I experienced firsthand […]",
      "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-amazon-bedrock-aws-outposts-amazon-ecs-managed-instances-aws-builder-id-and-more-october-6-2025/",
      "pubDate": "2025-10-06T15:42:39.000Z",
      "source": "newsBlog",
      "services": [
        "bedrock",
        "amazon q",
        "ecs",
        "eks",
        "outposts"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "bedrock",
        "amazon q",
        "ecs",
        "eks",
        "outposts"
      ]
    },
    {
      "id": "aws-news-90ca91bdfa7c",
      "title": "Optimize efficiency with language analyzers using scalable multilingual search in Amazon OpenSearch Service",
      "description": "Organizations manage content across multiple languages as they expand globally. Ecommerce platforms, customer support systems, and knowledge bases require efficient multilingual search capabilities to serve diverse user bases effectively. This unified search approach helps multinational organizations maintain centralized content repositories while making sure users, regardless of their preferred language, can effectively find and access relevant […]",
      "link": "https://aws.amazon.com/blogs/big-data/optimize-efficiency-with-language-analyzers-using-scalable-multilingual-search-in-amazon-opensearch-service/",
      "pubDate": "2025-10-02T22:13:45.000Z",
      "source": "bigDataBlog",
      "services": [
        "opensearch",
        "opensearch service",
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "opensearch",
        "opensearch service",
        "organizations",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-1cf24c6b0f9d",
      "title": "Deploying AI models for inference with AWS Lambda using zip packaging",
      "description": "Users usually package their function code as container images when using machine learning (ML) models that are larger than 250 MB, which is the Lambda deployment package size limit for zip files. In this post, we demonstrate an approach that downloads ML models directly from Amazon S3 into your function’s memory so that you can continue packaging your function code using zip files.",
      "link": "https://aws.amazon.com/blogs/compute/deploying-ai-models-for-inference-with-aws-lambda-using-zip-packaging/",
      "pubDate": "2025-10-02T22:11:33.000Z",
      "source": "computeBlog",
      "services": [
        "lambda",
        "s3"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "lambda",
        "s3"
      ]
    },
    {
      "id": "aws-news-2f3bd8791ed1",
      "title": "Modernization of real-time payment orchestration on AWS",
      "description": "The global real-time payments market is experiencing significant growth. According to Fortune Business Insights, the market was valued at USD 24.91 billion in 2024 and is projected to grow to USD 284.49 billion by 2032, with a CAGR of 35.4%. Similarly, Grand View Research reports that the global mobile payment market, valued at USD 88.50 […]",
      "link": "https://aws.amazon.com/blogs/architecture/modernization-of-real-time-payment-orchestration-on-aws/",
      "pubDate": "2025-10-01T23:34:00.000Z",
      "source": "architectureBlog",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": []
    },
    {
      "id": "aws-news-6dfa064973ba",
      "title": "How Laravel Nightwatch handles billions of observability events in real time with Amazon MSK and ClickHouse Cloud",
      "description": "Laravel, one of the world’s most popular web frameworks, launched its first-party observability platform, Laravel Nightwatch, to provide developers with real-time insights into application performance. Built entirely on AWS managed services and ClickHouse Cloud, the service already processes over one billion events per day while maintaining sub-second query latency, giving developers instant visibility into the health of their applications.",
      "link": "https://aws.amazon.com/blogs/big-data/how-laravel-nightwatch-handles-billions-of-observability-events-in-real-time-with-amazon-msk-and-clickhouse-cloud/",
      "pubDate": "2025-10-01T16:59:49.000Z",
      "source": "bigDataBlog",
      "services": [
        "msk"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "msk",
        "launch"
      ]
    },
    {
      "id": "aws-news-1d55d1ad4c56",
      "title": "How to export to Amazon S3 Tables by using AWS Step Functions Distributed Map",
      "description": "In this post, we show how to use Step Functions Distributed Map to process Amazon S3 objects and export results to Amazon S3 Tables, creating a scalable and maintainable data processing pipeline.",
      "link": "https://aws.amazon.com/blogs/compute/how-to-export-to-amazon-s3-tables-by-using-aws-step-functions-distributed-map/",
      "pubDate": "2025-10-01T16:44:18.000Z",
      "source": "computeBlog",
      "services": [
        "s3",
        "step functions"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "s3",
        "step functions"
      ]
    },
    {
      "id": "aws-news-a9abcdaecc08",
      "title": "Introducing Apache Airflow 3 on Amazon MWAA: New features and capabilities",
      "description": "AWS announced the general availability of Apache Airflow 3 on Amazon Managed Workflows for Apache Airflow (Amazon MWAA). This release transforms how organizations use Apache Airflow to orchestrate data pipelines and business processes in the cloud, bringing enhanced security, improved performance, and modern workflow orchestration capabilities to Amazon MWAA customers. This post explores the features of Airflow 3 on Amazon MWAA and outlines enhancements that improve your workflow orchestration capabilities",
      "link": "https://aws.amazon.com/blogs/big-data/introducing-apache-airflow-3-on-amazon-mwaa-new-features-and-capabilities/",
      "pubDate": "2025-10-01T16:40:57.000Z",
      "source": "bigDataBlog",
      "services": [
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "organizations",
        "ga",
        "new-feature",
        "enhancement"
      ]
    },
    {
      "id": "aws-news-cba0d7e0ebd5",
      "title": "Announcing Amazon ECS Managed Instances for containerized applications",
      "description": "Amazon ECS Managed Instances is a new compute option that eliminates infrastructure management overhead while giving you access to the broad suite of EC2 capabilities including the flexibility to select instance types, access reserved capacity, and advanced security and observability configurations.",
      "link": "https://aws.amazon.com/blogs/aws/announcing-amazon-ecs-managed-instances-for-containerized-applications/",
      "pubDate": "2025-09-30T18:46:47.000Z",
      "source": "newsBlog",
      "services": [
        "lex",
        "ec2",
        "ecs"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "lex",
        "ec2",
        "ecs"
      ]
    },
    {
      "id": "aws-news-9b7993bd80b1",
      "title": "Announcing AWS Outposts third-party storage integration with Dell and HPE",
      "description": "AWS Outposts is now integrated with Dell PowerStore and HPE Alletra MP B10000 systems, enabling customers to seamlessly use their on-premises external storage infrastructure with AWS services while maintaining data residency requirements.",
      "link": "https://aws.amazon.com/blogs/aws/announcing-aws-outposts-third-party-storage-integration-with-dell-and-hpe/",
      "pubDate": "2025-09-30T16:39:54.000Z",
      "source": "newsBlog",
      "services": [
        "outposts"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "outposts",
        "integration"
      ]
    },
    {
      "id": "aws-news-089334445f81",
      "title": "Build resilient generative AI agents",
      "description": "Generative AI agents in production environments demand resilience strategies that go beyond traditional software patterns. AI agents make autonomous decisions, consume substantial computational resources, and interact with external systems in unpredictable ways. These characteristics create failure modes that conventional resilience approaches might not address. This post presents a framework for AI agent resilience risk analysis […]",
      "link": "https://aws.amazon.com/blogs/architecture/build-resilient-generative-ai-agents/",
      "pubDate": "2025-09-30T15:11:51.000Z",
      "source": "architectureBlog",
      "services": [],
      "categories": [
        "generative-ai"
      ],
      "tags": []
    },
    {
      "id": "aws-news-314c736c8703",
      "title": "Introducing Claude Sonnet 4.5 in Amazon Bedrock: Anthropic’s most intelligent model, best for coding and complex agents",
      "description": "Amazon Web Services announces Claude Sonnet 4.5 in Amazon Bedrock, featuring advanced capabilities in coding, tool handling, and long-horizon tasks, with improvements in memory management, context processing, and industry-specific applications across finance, research, and cybersecurity sectors.",
      "link": "https://aws.amazon.com/blogs/aws/introducing-claude-sonnet-4-5-in-amazon-bedrock-anthropics-most-intelligent-model-best-for-coding-and-complex-agents/",
      "pubDate": "2025-09-29T17:56:16.000Z",
      "source": "newsBlog",
      "services": [
        "bedrock",
        "lex"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "bedrock",
        "lex",
        "improvement"
      ]
    },
    {
      "id": "aws-news-893c769634f2",
      "title": "AWS Weekly Roundup: Amazon S3, Amazon Bedrock AgentCore, AWS X-Ray and more (September 29, 2025)",
      "description": "Wow, can you all believe it? We’re nearing the end of the year already. Next thing you know, AWS re:Invent will be here! This is our biggest event that takes place every year in Las Vegas from December 1st to December 5th where we reveal and release many of the things that we’ve been working […]",
      "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-amazon-s3-amazon-bedrock-agentcore-aws-x-ray-and-more-september-29-2025/",
      "pubDate": "2025-09-29T16:42:04.000Z",
      "source": "newsBlog",
      "services": [
        "bedrock",
        "agentcore",
        "s3"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "bedrock",
        "agentcore",
        "s3",
        "ga"
      ]
    },
    {
      "id": "aws-news-4fbb29739c17",
      "title": "General Availability Release of the Migration Tool for the AWS SDK for Java 2.x",
      "description": "The AWS SDK for Java 1.x (v1) entered maintenance mode on July 31, 2024, and will reach end-of-support on December 31, 2025. We recommend that you migrate to the AWS SDK for Java 2.x (v2) to access new features, enhanced performance, and continued support from AWS. To help you migrate efficiently, we’ve created a migration […]",
      "link": "https://aws.amazon.com/blogs/developer/general-availability-release-of-the-migration-tool-for-the-aws-sdk-for-java-2-x/",
      "pubDate": "2025-09-26T16:47:36.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "new-feature",
        "support"
      ]
    },
    {
      "id": "aws-news-b8a7a01ed381",
      "title": "Accelerate AI agent development with the Nova Act IDE extension",
      "description": "The Nova Act extension is a new IDE-integrated tool that enables developers to create browser automation agents using natural language through the Nova Act model, offering features like Builder Mode, chat capabilities, and predefined templates while streamlining the development process without leaving their preferred development environment.",
      "link": "https://aws.amazon.com/blogs/aws/accelerate-ai-agent-development-with-the-nova-act-ide-extension/",
      "pubDate": "2025-09-23T16:01:04.000Z",
      "source": "newsBlog",
      "services": [
        "nova"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "nova"
      ]
    },
    {
      "id": "aws-news-4711328feee4",
      "title": "A scalable, elastic database and search solution for 1B+ vectors built on LanceDB and Amazon S3",
      "description": "In this post, we explore how Metagenomi built a scalable database and search solution for over 1 billion protein vectors using LanceDB and Amazon S3. The solution enables rapid enzyme discovery by transforming proteins into vector embeddings and implementing a serverless architecture that combines AWS Lambda, AWS Step Functions, and Amazon S3 for efficient nearest neighbor searches.",
      "link": "https://aws.amazon.com/blogs/architecture/a-scalable-elastic-database-and-search-solution-for-1b-vectors-built-on-lancedb-and-amazon-s3/",
      "pubDate": "2025-09-22T17:15:44.000Z",
      "source": "architectureBlog",
      "services": [
        "lambda",
        "s3",
        "step functions"
      ],
      "categories": [
        "ai-services"
      ],
      "tags": [
        "lambda",
        "s3",
        "step functions"
      ]
    },
    {
      "id": "aws-news-f6ea4658ae0e",
      "title": "AWS Weekly Roundup: Amazon Q Developer, AWS Step Functions, AWS Cloud Club Captain deadline, and more (September 22, 2025)",
      "description": "Three weeks ago, I published a post about the new AWS Region in New Zealand (ap-southeast-6). This led to an incredible opportunity to visit New Zealand, where I met passionate builders and presented at several events including Serverless and Platform Engineering meetup, AWS Tools and Programming meetup, AWS Cloud Clubs in Auckland, and AWS Community […]",
      "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-amazon-q-developer-aws-step-functions-aws-cloud-club-captain-deadline-and-more-september-22-2025/",
      "pubDate": "2025-09-22T16:21:44.000Z",
      "source": "newsBlog",
      "services": [
        "amazon q",
        "q developer",
        "eks",
        "step functions"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "amazon q",
        "q developer",
        "eks",
        "step functions"
      ]
    },
    {
      "id": "aws-news-3105df2f3e57",
      "title": "Qwen models are now available in Amazon Bedrock",
      "description": "Amazon Bedrock has expanded its model offerings with the addition of Qwen 3 foundation models enabling users to access and deploy them in a fully managed, serverless environment. These models feature both mixture-of-experts (MoE) and dense architectures to support diverse use cases including advanced code generation, multi-tool business automation, and cost-optimized AI reasoning.",
      "link": "https://aws.amazon.com/blogs/aws/qwen-models-are-now-available-in-amazon-bedrock/",
      "pubDate": "2025-09-18T22:02:11.000Z",
      "source": "newsBlog",
      "services": [
        "bedrock"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "bedrock",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-0eb6b4032c21",
      "title": "Enhance the local testing experience for serverless applications with LocalStack",
      "description": "Today, we’re excited to announce new capabilities that further simplify the local testing experience for Lambda functions and serverless applications through integration with LocalStack, an AWS Partner, in the AWS Toolkit for Visual Studio Code. In this post, we will show you how you can enhance your local testing experience for serverless applications with LocalStack using AWS Toolkit.",
      "link": "https://aws.amazon.com/blogs/compute/enhance-the-local-testing-experience-for-serverless-applications-with-localstack/",
      "pubDate": "2025-09-17T17:51:30.000Z",
      "source": "computeBlog",
      "services": [
        "lambda",
        "localstack"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "lambda",
        "localstack",
        "integration"
      ]
    },
    {
      "id": "aws-news-a0c0b8431f73",
      "title": "DISA STIG for Amazon Linux 2023 is now available",
      "description": "Today, we announce the availability of a Security Technical Implementation Guide (STIG) for Amazon Linux 2023 (AL2023), developed through collaboration between Amazon Web Services (AWS) and the Defense Information Systems Agency (DISA). The STIG guidelines are important for U.S Department of Defense (DOD) and Federal customers needing strict security compliance derived from the National Institute […]",
      "link": "https://aws.amazon.com/blogs/compute/disa-stig-for-amazon-linux-2023-is-now-available/",
      "pubDate": "2025-09-10T21:15:43.000Z",
      "source": "computeBlog",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "now-available"
      ]
    },
    {
      "id": "aws-news-cb8062515dfa",
      "title": "Accelerating local serverless development with console to IDE and remote debugging for AWS Lambda",
      "description": "Delightful developer experience is an important part of building serverless applications efficiently, whether you’re creating an automation script or developing a complex enterprise application. While AWS Lambda has transformed modern application development in the cloud with its serverless computing model, developers spend significant time working in their local environments. They rely on familiar IDEs, debugging […]",
      "link": "https://aws.amazon.com/blogs/compute/accelerating-local-serverless-development-with-console-to-ide-and-remote-debugging-for-aws-lambda/",
      "pubDate": "2025-09-09T18:00:39.000Z",
      "source": "computeBlog",
      "services": [
        "lex",
        "lambda"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "lambda"
      ]
    },
    {
      "id": "aws-news-94928335a663",
      "title": "Accessing private Amazon API Gateway endpoints through custom Amazon CloudFront distribution using VPC Origins",
      "description": "This post demonstrates how you can connect CloudFront with a Private REST API in Amazon REST API Gateway using a VPC origin.",
      "link": "https://aws.amazon.com/blogs/compute/accessing-private-amazon-api-gateway-endpoints-through-custom-amazon-cloudfront-distribution-using-vpc-origins/",
      "pubDate": "2025-09-09T17:58:21.000Z",
      "source": "computeBlog",
      "services": [
        "cloudfront",
        "api gateway"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "cloudfront",
        "api gateway",
        "ga"
      ]
    },
    {
      "id": "aws-news-8acfb46eaaa9",
      "title": "Serverless generative AI architectural patterns – Part 2",
      "description": "This post explores two complementary approaches for non-real-time scenarios: buffered asynchronous processing for time-intensive individual requests, and batch processing for scheduled or event-driven workflows.",
      "link": "https://aws.amazon.com/blogs/compute/part-2-serverless-generative-ai-architectural-patterns/",
      "pubDate": "2025-09-04T21:46:26.000Z",
      "source": "computeBlog",
      "services": [],
      "categories": [
        "generative-ai"
      ],
      "tags": []
    },
    {
      "id": "aws-news-a04bdd57b5ee",
      "title": "Serverless generative AI architectural patterns – Part 1",
      "description": "This two-part series explores the different architectural patterns, best practices, code implementations, and design considerations essential for successfully integrating generative AI solutions into both new and existing applications. In this post, we focus on patterns applicable for architecting real-time generative AI applications.",
      "link": "https://aws.amazon.com/blogs/compute/serverless-generative-ai-architectural-patterns/",
      "pubDate": "2025-09-04T21:45:47.000Z",
      "source": "computeBlog",
      "services": [],
      "categories": [
        "generative-ai"
      ],
      "tags": []
    },
    {
      "id": "aws-news-df07ccc46610",
      "title": "Implementing advanced AWS Graviton adoption strategies across AWS Regions",
      "description": "When expanding your Graviton deployment across multiple AWS Regions, careful planning helps you navigate considerations around regional instance type availability and capacity optimization. This post shows how to implement advanced configuration strategies for Graviton-enabled EC2 Auto Scaling groups across multiple Regions, helping you maximize instance availability, reduce costs, and maintain consistent application performance even in AWS Regions with limited Graviton instance type availability.",
      "link": "https://aws.amazon.com/blogs/compute/implementing-advanced-aws-graviton-adoption-strategies-across-aws-regions/",
      "pubDate": "2025-08-26T18:26:26.000Z",
      "source": "computeBlog",
      "services": [
        "ec2",
        "graviton"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "ec2",
        "graviton",
        "ga"
      ]
    },
    {
      "id": "aws-news-7e2f23dd38ac",
      "title": "Simplify multi-tenant encryption with a cost-conscious AWS KMS key strategy",
      "description": "In this post, we explore an efficient approach to managing encryption keys in a multi-tenant SaaS environment through centralization, addressing challenges like key proliferation, rising costs, and operational complexity across multiple AWS accounts and services. We demonstrate how implementing a centralized key management strategy using a single AWS KMS key per tenant can maintain security and compliance while reducing operational overhead as organizations scale.",
      "link": "https://aws.amazon.com/blogs/architecture/simplify-multi-tenant-encryption-with-a-cost-conscious-aws-kms-key-strategy/",
      "pubDate": "2025-08-21T21:54:51.000Z",
      "source": "architectureBlog",
      "services": [
        "lex",
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "lex",
        "organizations",
        "ga"
      ]
    },
    {
      "id": "aws-news-d198537e3000",
      "title": "Under the hood: how AWS Lambda SnapStart optimizes function startup latency",
      "description": "AWS Lambda cold start latency can impact performance for latency-sensitive applications, with function initialization being the primary contributor to startup delays. Lambda SnapStart addresses this challenge by reducing cold start times from several seconds to sub-second performance for Java, Python, and .NET runtimes with minimal code changes. This post explains SnapStart's underlying mechanisms and provides performance optimization recommendations for applications using this feature.",
      "link": "https://aws.amazon.com/blogs/compute/under-the-hood-how-aws-lambda-snapstart-optimizes-function-startup-latency/",
      "pubDate": "2025-08-19T20:01:36.000Z",
      "source": "computeBlog",
      "services": [
        "lambda"
      ],
      "categories": [
        "ai-services"
      ],
      "tags": [
        "lambda"
      ]
    },
    {
      "id": "aws-news-07cadadbf419",
      "title": "Effectively building AI agents on AWS Serverless",
      "description": "Imagine an AI assistant that doesn’t just respond to prompts – it reasons through goals, acts, and integrates with real-time systems. This is the promise of agentic AI. According to Gartner, by 2028 over 33% of enterprise applications will embed agentic capabilities – up from less than 1% today. While early generative AI efforts focused […]",
      "link": "https://aws.amazon.com/blogs/compute/effectively-building-ai-agents-on-aws-serverless/",
      "pubDate": "2025-08-14T22:38:10.000Z",
      "source": "computeBlog",
      "services": [],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "ga"
      ]
    },
    {
      "id": "aws-news-d1d1f77f887e",
      "title": "How Karrot built a feature platform on AWS, Part 1: Motivation and feature serving",
      "description": "This two-part series shows how Karrot developed a new feature platform, which consists of three main components: feature serving, a stream ingestion pipeline, and a batch ingestion pipeline. This post starts by presenting our motivation, our requirements, and the solution architecture, focusing on feature serving.",
      "link": "https://aws.amazon.com/blogs/architecture/how-karrot-built-a-feature-platform-on-aws-part-1-motivation-and-feature-serving/",
      "pubDate": "2025-08-14T15:16:29.000Z",
      "source": "architectureBlog",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "new-feature"
      ]
    },
    {
      "id": "aws-news-40ebd26fef7f",
      "title": "How Karrot built a feature platform on AWS, Part 2: Feature ingestion",
      "description": "This two-part series shows how Karrot developed a new feature platform, which consists of three main components: feature serving, a stream ingestion pipeline, and a batch ingestion pipeline. This post covers the process of collecting features in real-time and batch ingestion into an online store, and the technical approaches for stable operation.",
      "link": "https://aws.amazon.com/blogs/architecture/how-karrot-built-a-feature-platform-on-aws-part-2-feature-ingestion/",
      "pubDate": "2025-08-14T15:16:27.000Z",
      "source": "architectureBlog",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "new-feature"
      ]
    },
    {
      "id": "aws-news-b1018aefba54",
      "title": "Deploy LLMs on Amazon EKS using vLLM Deep Learning Containers",
      "description": "In this post, we demonstrate how to deploy the DeepSeek-R1-Distill-Qwen-32B model using AWS DLCs for vLLMs on Amazon EKS, showcasing how these purpose-built containers simplify deployment of this powerful open source inference engine. This solution can help you solve the complex infrastructure challenges of deploying LLMs while maintaining performance and cost-efficiency.",
      "link": "https://aws.amazon.com/blogs/architecture/deploy-llms-on-amazon-eks-using-vllm-deep-learning-containers/",
      "pubDate": "2025-08-14T15:09:51.000Z",
      "source": "architectureBlog",
      "services": [
        "lex",
        "eks"
      ],
      "categories": [
        "foundation-models"
      ],
      "tags": [
        "lex",
        "eks"
      ]
    },
    {
      "id": "aws-news-8b2281cd8002",
      "title": "Maximizing Business Value Through Strategic Cloud Optimization",
      "description": "As cloud spending continues to surge, organizations must focus on strategic cloud optimization to maximize business value. This blog post explores key insights from MIT Technology Review's publication on cloud optimization, highlighting the importance of viewing optimization as a continuous process that encompasses all six AWS Well-Architected pillars.",
      "link": "https://aws.amazon.com/blogs/architecture/maximizing-business-value-through-strategic-cloud-optimization/",
      "pubDate": "2025-08-01T15:33:28.000Z",
      "source": "architectureBlog",
      "services": [
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "organizations",
        "ga"
      ]
    },
    {
      "id": "aws-news-9e63742dd9e4",
      "title": "How Zapier runs isolated tasks on AWS Lambda and upgrades functions at scale",
      "description": "In this post, you’ll learn how Zapier has built their serverless architecture focusing on three key aspects: using Lambda functions to build isolated Zaps, operating over a hundred thousand Lambda functions through Zapier's control plane infrastructure, and enhancing security posture while reducing maintenance efforts by introducing automated function upgrades and cleanup workflows into their platform architecture.",
      "link": "https://aws.amazon.com/blogs/architecture/how-zapier-runs-isolated-tasks-on-aws-lambda-and-upgrades-functions-at-scale/",
      "pubDate": "2025-07-25T13:30:06.000Z",
      "source": "architectureBlog",
      "services": [
        "lambda"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "lambda"
      ]
    },
    {
      "id": "aws-news-11d98a88cbe1",
      "title": "Implement monitoring for Amazon EKS with managed services",
      "description": "In this post, we show you how to implement comprehensive monitoring for Amazon Elastic Kubernetes Service (Amazon EKS) workloads using AWS managed services. This solution demonstrates building an EKS platform that combines flexible compute options with enterprise-grade observability using AWS native services and OpenTelemetry.",
      "link": "https://aws.amazon.com/blogs/architecture/implement-monitoring-for-amazon-eks-with-managed-services/",
      "pubDate": "2025-07-18T15:47:13.000Z",
      "source": "architectureBlog",
      "services": [
        "lex",
        "eks"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "eks"
      ]
    },
    {
      "id": "aws-news-875544c87826",
      "title": "Preview Release of the AWS SDK Java 2.x HTTP Client built on Apache HttpClient 5.5.x",
      "description": "The AWS SDK for Java 2.x introduces the Apache 5 SDK HTTP client which is built on Apache HttpClient 5.5.x. This new SDK HTTP client is available alongside our existing SDK HTTP clients: Apache HttpClient 4.5.x, Netty, URL Connection, and AWS CRT HttpClient. To differentiate the use of Apache HttpClient 4.5.x and Apache HttpClient 5.5.x, […]",
      "link": "https://aws.amazon.com/blogs/developer/preview-release-of-theaws-sdk-java-2-x-http-client-built-on-apache-httpclient-5-5-x/",
      "pubDate": "2025-07-18T03:36:05.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "preview"
      ]
    },
    {
      "id": "aws-news-9eb0f60de1a7",
      "title": "How Scale to Win uses AWS WAF to block DDoS events",
      "description": "In this post, you'll learn how Scale to Win configured their network topology and AWS WAF to protect against DDoS events that reached peaks of over 2 million requests per second during the 2024 US presidential election campaign season. The post details how they implemented comprehensive DDoS protection by segmenting human and machine traffic, using tiered rate limits with CAPTCHA, and preventing CAPTCHA token reuse through AWS WAF Bot Control.",
      "link": "https://aws.amazon.com/blogs/architecture/how-scale-to-win-uses-aws-waf-to-block-ddos-events/",
      "pubDate": "2025-07-14T19:12:38.000Z",
      "source": "architectureBlog",
      "services": [
        "waf"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "waf",
        "ga"
      ]
    },
    {
      "id": "aws-news-8ab7f94aaf5b",
      "title": "Migrate and modernize VMware workloads with AWS Transform for VMware",
      "description": "AWS Transform for VMware is a service that tackles cloud migration challenges by significantly reducing manual effort and accelerating the migration of critical VMware workloads to AWS Cloud. In this post, we highlight its comprehensive capabilities, including streamlined discovery and assessment, intelligent network conversion, enhanced security and compliance, and orchestrated migration execution.",
      "link": "https://aws.amazon.com/blogs/architecture/migrate-and-modernize-vmware-workloads-with-aws-transform-for-vmware/",
      "pubDate": "2025-07-08T20:37:49.000Z",
      "source": "architectureBlog",
      "services": [
        "transform for vmware"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "transform for vmware"
      ]
    },
    {
      "id": "aws-news-6606f79cd3d5",
      "title": "AWS .NET Distributed Cache Provider for Amazon DynamoDB now Generally Available",
      "description": "Today, we are excited to announce the general availability of the AWS .NET Distributed Cache Provider for Amazon DynamoDB. This is a seamless, serverless caching solution that enables .NET developers to efficiently manage their caching needs across distributed systems. Consistent caching is a difficult problem in distributed architectures, where maintaining data integrity and performance across […]",
      "link": "https://aws.amazon.com/blogs/developer/aws-net-distributed-cache-provider-for-amazon-dynamodb-now-generally-available/",
      "pubDate": "2025-07-03T13:49:25.000Z",
      "source": "developersAndDevOps",
      "services": [
        "dynamodb"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "dynamodb",
        "generally-available"
      ]
    },
    {
      "id": "aws-news-7a855eaafa04",
      "title": "Simplifying sustainability reporting using AWS and generative AI in banking",
      "description": "In this post, you learn how you can use generative AI services on Amazon Web Services (AWS) to automate your sustainability reporting requirements, reduce manual effort, and improve accuracy. You do this by implementing an automated solution for extracting, processing, and validating data from corporate reports.",
      "link": "https://aws.amazon.com/blogs/architecture/simplifying-sustainability-reporting-using-aws-and-generative-ai-in-banking/",
      "pubDate": "2025-06-26T17:54:46.000Z",
      "source": "architectureBlog",
      "services": [],
      "categories": [
        "generative-ai"
      ],
      "tags": []
    },
    {
      "id": "aws-news-ae25b45e1a62",
      "title": "AWS Tools for PowerShell V5 now Generally Available",
      "description": "This blog was co-authored by Afroz Mohammed and Jonathan Nunn, Software Developers on the AWS PowerShell team. We’re excited to announce the general availability of the AWS Tools for PowerShell version 5, a major update that brings new features and improvements in security, along with a few breaking changes. New Features You can now cancel […]",
      "link": "https://aws.amazon.com/blogs/developer/aws-tools-for-powershell-v5-now-generally-available/",
      "pubDate": "2025-06-23T22:59:33.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "generally-available",
        "new-feature",
        "update",
        "improvement"
      ]
    },
    {
      "id": "aws-news-2355834bf9d4",
      "title": "Amazon Bedrock baseline architecture in an AWS landing zone",
      "description": "In this post, we explore the Amazon Bedrock baseline architecture and how you can secure and control network access to your various Amazon Bedrock capabilities within AWS network services and tools. We discuss key design considerations, such as using Amazon VPC Lattice auth policies, Amazon Virtual Private Cloud (Amazon VPC) endpoints, and AWS Identity and Access Management (IAM) to restrict and monitor access to your Amazon Bedrock capabilities.",
      "link": "https://aws.amazon.com/blogs/architecture/amazon-bedrock-baseline-architecture-in-an-aws-landing-zone/",
      "pubDate": "2025-06-23T18:36:51.000Z",
      "source": "architectureBlog",
      "services": [
        "bedrock",
        "iam"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "bedrock",
        "iam"
      ]
    },
    {
      "id": "aws-news-54c273e45b01",
      "title": "Upgrading your AWS SDK for Go from V1 to V2 with Amazon Q Developer",
      "description": "Software development is far more than just writing code. In reality, a developer spends a large amount of time maintaining existing applications and fixing bugs. For example, migrating a Go application from the older AWS SDK for Go v1 to the newer v2 can be a significant undertaking, but it’s a crucial step to future-proof […]",
      "link": "https://aws.amazon.com/blogs/developer/upgrading-your-aws-sdk-for-go-from-v1-to-v2-with-amazon-q-developer/",
      "pubDate": "2025-06-18T06:38:24.000Z",
      "source": "developersAndDevOps",
      "services": [
        "amazon q",
        "q developer"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "amazon q",
        "q developer"
      ]
    },
    {
      "id": "aws-news-8035da78b9bd",
      "title": "Analyze media content using AWS AI services",
      "description": "Organizations managing large audio and video archives face significant challenges in extracting value from their media content. Consider a radio network with thousands of broadcast hours across multiple stations and the challenges they face to efficiently verify ad placements, identify interview segments, and analyze programming patterns. In this post, we demonstrate how you can automatically transform unstructured media files into searchable, analyzable content.",
      "link": "https://aws.amazon.com/blogs/architecture/analyze-media-content-using-aws-ai-services/",
      "pubDate": "2025-06-02T16:25:10.000Z",
      "source": "architectureBlog",
      "services": [
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "organizations",
        "ga"
      ]
    },
    {
      "id": "aws-news-27b43a8f9a42",
      "title": "Deploy to ARM-Based Compute with AWS Deploy Tool for .NET",
      "description": "We’re excited to announce that the AWS Deploy Tool for .NET now supports deploying .NET applications to select ARM-based compute platforms on AWS! Whether you’re deploying from Visual Studio or using the .NET CLI, you can now target cost-effective ARM infrastructure like AWS Graviton with the same streamlined experience you’re used to. Why deploy to […]",
      "link": "https://aws.amazon.com/blogs/developer/deploy-to-arm-based-compute-with-aws-deploy-tool-for-net/",
      "pubDate": "2025-05-08T20:16:40.000Z",
      "source": "developersAndDevOps",
      "services": [
        "graviton"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "graviton",
        "support"
      ]
    },
    {
      "id": "aws-news-4d3126ea3a15",
      "title": "General Availability of AWS SDK for .NET V4.0",
      "description": "Version 4.0 of the AWS SDK for .NET has been released for general availability (GA). V4 has been in development for a little over a year in our SDK’s public GitHub repository with 13 previews being released. This new version contains performance improvements, consistency with other AWS SDKs, and bug and usability fixes that required […]",
      "link": "https://aws.amazon.com/blogs/developer/general-availability-of-aws-sdk-for-net-v4-0/",
      "pubDate": "2025-04-28T20:05:16.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "preview",
        "ga",
        "improvement"
      ]
    },
    {
      "id": "aws-news-49859f1bef68",
      "title": "Introducing the AWS IoT Device SDK for Swift (Developer Preview)",
      "description": "Today, AWS launches the developer preview of the AWS IoT Device SDK for Swift. The IoT Device SDK for Swift empowers Swift developers to create IoT applications for Linux and Apple macOS, iOS, and tvOS platforms using the MQTT 5 protocol. The SDK supports Swift 5.10+ and is designed to help developers easily integrate with […]",
      "link": "https://aws.amazon.com/blogs/developer/introducing-the-aws-iot-device-sdk-for-swift-developer-preview/",
      "pubDate": "2025-03-31T16:26:05.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "launch",
        "preview",
        "support"
      ]
    },
    {
      "id": "aws-news-c4f514e85eef",
      "title": "AWS SDK for Ruby: Deprecating Ruby 2.5 & 2.6 Runtime Supports and Future Compatibility",
      "description": "Effective June 2, 2025, AWS SDK for Ruby Version 3 will no longer support following end-of-life (EOL) Ruby runtime versions: Ruby 2.5 (EOL began on 2021-04-05) Ruby 2.6 (EOL began on 2022-04-12) To ensure your applications and services remain secure, we strongly encourage you to upgrade to Ruby 2.7 or later. Moving forward, AWS SDK […]",
      "link": "https://aws.amazon.com/blogs/developer/aws-sdk-for-ruby-deprecating-ruby-2-5-2-6-runtime-supports-and-future-compatibility/",
      "pubDate": "2025-03-27T15:08:27.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-5cf08af5aca4",
      "title": "Announcing the Developer Preview of Amazon S3 Transfer Manager in Rust",
      "description": "We are excited to announce the Developer Preview of the Amazon S3 Transfer Manager for Rust, a high-level utility that speeds up and simplifies uploads and downloads with Amazon Simple Storage Service (Amazon S3). Using this new library, developers can efficiently transfer data between Amazon S3 and various sources, including files, in-memory buffers, memory streams, […]",
      "link": "https://aws.amazon.com/blogs/developer/announcing-the-developer-preview-of-amazon-s3-transfer-manager-in-rust/",
      "pubDate": "2025-03-26T15:52:22.000Z",
      "source": "developersAndDevOps",
      "services": [
        "s3"
      ],
      "categories": [
        "generative-ai"
      ],
      "tags": [
        "s3",
        "preview"
      ]
    },
    {
      "id": "aws-news-dd08a704e7e9",
      "title": "Building and Debugging .NET Lambda applications with .NET Aspire (Part 2)",
      "description": "In Part 1 of our blog posts for .NET Aspire and AWS Lambda, we showed you how .NET Aspire can be used for running and debugging .NET Lambda functions. In this part, Part 2, we’ll show you how to take advantage of the .NET Aspire programming model for best practices and for connecting dependent resources […]",
      "link": "https://aws.amazon.com/blogs/developer/building-lambda-with-aspire-part-2/",
      "pubDate": "2025-03-04T17:54:04.000Z",
      "source": "developersAndDevOps",
      "services": [
        "lambda"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda"
      ]
    },
    {
      "id": "aws-news-4185fb6b40aa",
      "title": "Building and Debugging .NET Lambda applications with .NET Aspire (Part 1)",
      "description": "In a recent post we gave some background on .NET Aspire and introduced our AWS integrations with .NET Aspire that integrate AWS into the .NET dev inner loop for building applications. The integrations included how to provision application resources with AWS CloudFormation or AWS Cloud Development Kit (AWS CDK) and using Amazon DynamoDB local for […]",
      "link": "https://aws.amazon.com/blogs/developer/building-lambda-with-aspire-part-1/",
      "pubDate": "2025-03-03T21:16:42.000Z",
      "source": "developersAndDevOps",
      "services": [
        "lambda",
        "dynamodb",
        "cloudformation"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda",
        "dynamodb",
        "cloudformation",
        "ga",
        "integration"
      ]
    },
    {
      "id": "aws-news-866c6557a5ec",
      "title": "Integrating AWS with .NET Aspire",
      "description": ".NET Aspire is a new way of building cloud-ready applications. In particular, it provides an orchestration for local environments in which to run, connect, and debug the components of distributed applications. Those components can be .NET projects, databases, containers, or executables. .NET Aspire is designed to have integrations with common components used in distributed applications. […]",
      "link": "https://aws.amazon.com/blogs/developer/integrating-aws-with-net-aspire/",
      "pubDate": "2025-02-11T20:39:27.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "integration"
      ]
    },
    {
      "id": "aws-news-9568575bd4f9",
      "title": "Updating AWS SDK defaults – AWS STS service endpoint and Retry Strategy",
      "description": "AWS announces important configuration updates coming July 31st, 2025, affecting AWS SDKs and CLIs default settings. Two key changes include switching the AWS Security Token Service (STS) endpoint to regional and updating the default retry strategy to standard. These updates aim to improve service availability and reliability by implementing regional endpoints to reduce cross-regional dependencies and introducing token-bucket throttling for standardized retry behavior. Organizations should test their applications before the release date and can opt-in early or temporarily opt-out of these changes. These updates align with AWS best practices for optimal service performance and security.",
      "link": "https://aws.amazon.com/blogs/developer/updating-aws-sdk-defaults-aws-sts-service-endpoint-and-retry-strategy/",
      "pubDate": "2025-02-11T05:37:32.000Z",
      "source": "developersAndDevOps",
      "services": [
        "organizations"
      ],
      "categories": [
        "ai-safety"
      ],
      "tags": [
        "organizations",
        "ga",
        "update"
      ]
    }
  ]
}