{
  "lastUpdated": "2025-09-30T06:15:36.701Z",
  "category": "general",
  "totalItems": 53,
  "items": [
    {
      "id": "aws-news-4fbb29739c17",
      "title": "General Availability Release of the Migration Tool for the AWS SDK for Java 2.x",
      "description": "The AWS SDK for Java 1.x (v1) entered maintenance mode on July 31, 2024, and will reach end-of-support on December 31, 2025. We recommend that you migrate to the AWS SDK for Java 2.x (v2) to access new features, enhanced performance, and continued support from AWS. To help you migrate efficiently, we’ve created a migration […]",
      "link": "https://aws.amazon.com/blogs/developer/general-availability-release-of-the-migration-tool-for-the-aws-sdk-for-java-2-x/",
      "pubDate": "2025-09-26T16:47:36.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "new-feature",
        "support"
      ]
    },
    {
      "id": "aws-news-b047d3ce8058",
      "title": "Amazon MSK Connect is now available in five additional AWS Regions",
      "description": "Amazon MSK Connect is now available in five additional AWS Regions: Asia Pacific (Thailand), Asia Pacific (Taipei), Mexico (Central), Canada West (Calgary), and Europe (Spain). MSK Connect enables you to run fully managed Kafka Connect clusters with Amazon Managed Streaming for Apache Kafka (Amazon MSK). With a few clicks, MSK Connect allows you to easily deploy, monitor, and scale connectors that move data in and out of Apache Kafka and Amazon MSK clusters from external systems such as databases, file systems, and search indices. MSK Connect eliminates the need to provision and maintain cluster infrastructure. Connectors scale automatically in response to increases in usage and you pay only for the resources you use. With full compatibility with Kafka Connect, it is easy to migrate workloads without code changes. MSK Connect will support both Amazon MSK-managed and self-managed Apache Kafka clusters.\n  You can get started with MSK Connect from the Amazon MSK console or the Amazon CLI. Visit the AWS Regions page for all the regions where Amazon MSK is available. To get started visit, the MSK Connect product page, pricing page, and the Amazon MSK Developer Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-msk-connect-five-additional-regions/",
      "pubDate": "2025-09-26T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "kafka",
        "msk"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "kafka",
        "msk",
        "ga",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-ec6506aa03bb",
      "title": "AWS Clean Rooms supports incremental ID mapping with AWS Entity Resolution",
      "description": "AWS Clean Rooms now supports incremental processing of rule-based ID mapping workflows with AWS Entity Resolution. This helps you perform real-time data synchronization across collaborators’ datasets with the privacy-enhancing controls of AWS Clean Rooms. With this launch, you can populate ID mapping tables in a Clean Rooms collaboration with only the new, modified, or deleted records since the last analysis. Data collaborators can enable incremental processing for rule-based ID mapping workflows in AWS Entity Resolution, and then update an existing ID mapping table in a collaboration. For example, a measurement provider can maintain up-to-date offline purchase data in a collaboration with an advertiser and a publisher, enabling always-on measurement of campaign outcomes, reduced costs, and maintained privacy controls for all collaboration members.\n  AWS Entity Resolution is natively integrated within AWS Clean Rooms to help you and your partners more easily prepare and match related customer records. Using rule-based or data service provider-based matching can help you improve data matching for enhanced advertising campaign planning, targeting, and measurement. For more information about the AWS Regions where AWS Clean Rooms is available, see the AWS Regions table. To learn more about AWS Clean Rooms, visit AWS Clean Rooms.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-clean-rooms-incremental-id-mapping-entity-resolution",
      "pubDate": "2025-09-26T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "rds"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "rds",
        "launch",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-00c28150b946",
      "title": "AWS WAF Targeted Bot Control, Fraud & DDoS Prevention Rule Group available in 3 more regions",
      "description": "Starting today, AWS WAF’s Targeted Bot Control, Fraud, and DDoS Prevention Rule Group are available in the AWS Asia Pacific (Taipei), Asia Pacific (Bangkok), and Mexico (Central) regions. These features help customers to stay protected against sophisticated bots, application layer DDoS and account takeover attacks.\n \nAWS WAF is a web application firewall that helps you protect your web application resources against common web exploits and bots that can affect availability, compromise security, or consume excessive resources. \n \nTo see the full list of regions where AWS WAF is currently available, visit the AWS Region Table. For more information about the service, visit the AWS WAF page. For more information about pricing, visit the AWS WAF Pricing page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-waf-targeted-bot-control-fraud-ddos-regions-expansion",
      "pubDate": "2025-09-26T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "waf"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "waf",
        "ga"
      ]
    },
    {
      "id": "aws-news-c79d309fcc1d",
      "title": "Amazon Redshift Concurrency Scaling is now available in 10 additional AWS regions",
      "description": "Amazon Redshift Concurrency Scaling is now available in the AWS Africa (Cape Town), Asia Pacific (Hong Kong), Asia Pacific (Hyderabad), Asia Pacific (Jakarta), Asia Pacific (Osaka), Asia Pacific (Thailand), Europe (Milan), Middle East (Bahrain), Mexico (Central) and AWS GovCloud (US-West) regions. With the Amazon Redshift Concurrency Scaling feature, you can now support thousands of concurrent users and concurrent queries, with consistently fast query performance.\n  Amazon Redshift Concurrency Scaling elastically scales query processing power to provide consistently fast performance for hundreds of concurrent queries. Concurrency Scaling resources are added to your Redshift cluster transparently in seconds, allowing for increased concurrency to process queries with minimal wait time. Amazon Redshift customers with an active Redshift cluster earn up to one hour of free Concurrency Scaling credits, which is sufficient for the concurrency needs of most customers. Concurrency scaling enables you to specify usage control, providing customers with predictable month-to-month costs, even during periods of fluctuating analytical demand.\n  To enable Amazon Redshift Concurrency Scaling, set the Concurrency Scaling Mode to Auto in your Amazon Web Services Management Console. You can allocate Concurrency Scaling usage to specific user groups and workloads, control the number of Concurrency Scaling clusters that can be used, and monitor Amazon CloudWatch performance and usage metrics.\n  To learn more about concurrency scaling including regional-availability, see our documentation and pricing page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-redshift-concurrency-scaling-additional-aws-regions",
      "pubDate": "2025-09-25T17:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "redshift",
        "cloudwatch"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "redshift",
        "cloudwatch",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-8066d2496f40",
      "title": "Amazon EC2 C8gn instances are now available in additional regions",
      "description": "Starting today, Amazon Elastic Compute Cloud (Amazon EC2) C8gn instances, powered by the latest-generation AWS Graviton4 processors, are available in the AWS Region Europe (Frankfurt, Stockholm), Asia Pacific (Singapore). The new instances provide up to 30% better compute performance than Graviton3-based Amazon EC2 C7gn instances. Amazon EC2 C8gn instances feature the latest 6th generation AWS Nitro Cards, and offer up to 600 Gbps network bandwidth, the highest network bandwidth among network optimized EC2 instances.\n  Take advantage of the enhanced networking capabilities of C8gn to scale performance and throughput, while optimizing the cost of running network-intensive workloads such as network virtual appliances, data analytics, CPU-based artificial intelligence and machine learning (AI/ML) inference.\n  For increased scalability, C8gn instances offer instance sizes up to 48xlarge, up to 384 GiB of memory, and up to 60 Gbps of bandwidth to Amazon Elastic Block Store (EBS). C8gn instances support Elastic Fabric Adapter (EFA) networking on the 16xlarge, 24xlarge, 48xlarge, metal-24xl, and metal-48xl sizes, which enables lower latency and improved cluster performance for workloads deployed on tightly coupled clusters.\n  C8gn instances are available in the following AWS Regions: US East (N. Virginia), US West (Oregon, N.California), Europe (Frankfurt, Stockholm), Asia Pacific (Singapore)\n  To learn more, see Amazon C8gn Instances. To begin your Graviton journey, visit the Level up your compute with AWS Graviton page. To get started, see AWS Management Console, AWS Command Line Interface (AWS CLI), and AWS SDKs.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-ec2-c8gn-instances-additional-regions",
      "pubDate": "2025-09-25T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2",
        "rds",
        "graviton"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "rds",
        "graviton",
        "ga",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-4240934578e0",
      "title": "Amazon CloudWatch now supports resource tags when monitoring vended metrics",
      "description": "Today, Amazon CloudWatch announces support for a new tag-based telemetry experience to help customers monitor their metrics and set up their alarms using AWS resources tags. This new capability simplifies monitoring cloud infrastructure at scale by automatically adapting alarms and metrics analysis as resources change. DevOps engineers and cloud administrators can now create dynamic monitoring views that align with their organizational structure using their existing AWS resource tags.\n  Tag-based querying filtering eliminates the manual overhead of updating alarms and dashboards after deployments, freeing teams to focus on innovation rather than maintenance. This provides faster, targeted insights that match how teams organize their systems. Teams can query AWS default metrics using their existing resource tags, making it easier to troubleshoot issues and maintain operational visibility while focusing on core business initiatives.\n  CloudWatch tag-based filtering is available in the following regions: US East (N. Virginia); US East (Ohio); US West (N. California); US West (Oregon); Asia Pacific (Tokyo); Asia Pacific (Seoul); Asia Pacific (Singapore); Asia Pacific (Sydney); Asia Pacific (Mumbai); Asia Pacific (Osaka); Canada (Central); Europe (Frankfurt); Europe (Ireland); Europe (London); Europe (Paris); Europe (Stockholm) and South America (São Paulo).\n  To get started, simply enable tag enriched telemetry with one click in the Amazon CloudWatch Settings, or through the AWS Command Line Interface (AWS CLI), and AWS SDKs to use your existing AWS resource tags to monitor your infrastructure. Learn more on the Amazon CloudWatch documentation page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-cloudwatch-tags-observability",
      "pubDate": "2025-09-25T09:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "nova",
        "rds",
        "cloudwatch"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "nova",
        "rds",
        "cloudwatch",
        "ga",
        "support",
        "new-capability"
      ]
    },
    {
      "id": "aws-news-3abb6c3c190b",
      "title": "AWS X-Ray introduces Adaptive Sampling for automatic optimized error detection",
      "description": "AWS X-Ray, a service that helps developers analyze and debug distributed applications by providing request tracing capabilities, now offers adaptive sampling to solve a common challenge for DevOps teams, Site Reliability Engineers (SREs), and application developers. These customers often face a difficult trade-off: setting sampling rates too low risks missing critical traces during incidents, while setting them too high unnecessarily increases observability costs during normal operations.            \n Today, with adaptive sampling, you can automatically adjust sampling rates within user-defined limits to ensure you capture the most important traces precisely when you need them. This helps development teams reduce mean time to resolution (MTTR) during incidents by providing comprehensive trace data for root cause analysis, while maintaining cost-efficient sampling rates during normal operations. Adaptive sampling supports two approaches, Sampling Boost and Anomaly Span Capture. These can be applied independently or can be combined together. Customers can use Sampling Boost to temporarily increase sampling rates when anomalies are detected to capture complete traces and Anomaly Span Capture to ensures anomaly-related spans are always captured, even when the full trace isn't sampled.\n Adaptive sampling is currently available in all commercial regions where AWS X-Ray is offered. For more information, see the X-Ray documentation. and CloudWatch pricing page for X-ray pricing details.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-x-ray-adaptive-sampling-automatic-error/",
      "pubDate": "2025-09-25T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "cloudwatch"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "cloudwatch",
        "support"
      ]
    },
    {
      "id": "aws-news-797d0a063558",
      "title": "You can now preview Amazon S3 Tables in the S3 console",
      "description": "You can now preview your Amazon S3 Tables directly in the S3 console without having to write a SQL query. You can view the schema and sample rows of your tables stored in S3 Tables to better understand and gather key information about your data quickly, without any setup.\n \nYou can preview tables in the S3 console in all AWS Regions where S3 Tables are available. You only pay for S3 requests to read a portion of your table. See Amazon S3 pricing and the S3 User Guide for pricing details and to learn more.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/preview-amazon-s3-tables-console",
      "pubDate": "2025-09-25T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "s3"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "s3",
        "preview",
        "ga"
      ]
    },
    {
      "id": "aws-news-35af27de83d7",
      "title": "Announcing AWS Lambda Support for Code Signing in GovCloud Regions",
      "description": "AWS Lambda now offers Code Signing in GovCloud Regions (AWS GovCloud (US-West) and AWS GovCloud (US-East)), which allows administrators to ensure that only trusted and verified code is deployed to Lambda functions. This feature uses AWS Signer, a managed code signing service. When code is deployed, Lambda checks the signatures to confirm the code hasn't been altered and is signed by trusted developers.\n  Administrators can create Signing Profiles in AWS Signer and use AWS Identity and Access Management (IAM) to manage user access. Within Lambda, they can specify allowed signing profiles for each function and configure whether to warn or reject deployments if signature checks fail.\n  There is no extra charge for using this feature. For more details, you can refer to the AWS Region table, the AWS blog, the Lambda developer guide, or the Signer developer guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-lambda-code-signing-govcloud",
      "pubDate": "2025-09-24T20:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lambda",
        "iam"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda",
        "iam",
        "support"
      ]
    },
    {
      "id": "aws-news-423caa150f87",
      "title": "Application Recovery Controller Region switch is now available in Asia Pacific (New Zealand)",
      "description": "Region switch in Amazon Application Recovery Controller (ARC) is now available in the Asia Pacific (New Zealand) Region. Region switch allows you to orchestrate the specific steps to operate your cross-AWS account application resources out of another AWS Region. It provides dashboards for real-time visibility into the recovery process and gathers data from across resources and accounts required for reporting to regulators and compliance teams. Region switch supports failover and failback for active/passive multi-Region approaches, and shift-away and return for active/active multi-Region approaches. When you create a Region switch plan, it is replicated to all the Regions your application operates in. This removes dependencies on the Region you are leaving for your recovery.\n  To get started, build a Region switch plan using the ARC console, API, or CLI. To learn more, visit the ARC Region switch documentation and pricing page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/application-recovery-controller-region-switch-new-zealand/",
      "pubDate": "2025-09-24T15:03:00.000Z",
      "source": "whatsNew",
      "services": [
        "rds"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "rds",
        "ga",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-e6de0a2f563d",
      "title": "Amazon Route 53 Resolver Query Logging now available in Asia Pacific (New Zealand)",
      "description": "Today, we are announcing the availability of Route 53 Resolver Query Logging in Asia Pacific (New Zealand), enabling you to log DNS queries that originate in your Amazon Virtual Private Cloud (Amazon VPC). With query logging enabled, you can see which domain names have been queried, the AWS resources from which the queries originated - including source IP and instance ID - and the responses that were received. \n  Route 53 Resolver is the Amazon provided DNS server that is available by default in all Amazon VPCs. Route 53 Resolver responds to DNS queries from AWS resources within a VPC for public DNS records, Amazon VPC-specific DNS names, and Amazon Route 53 private hosted zones. With Route 53 Resolver Query Logging, customers can log DNS queries and responses for queries originating from within their VPCs, whether those queries are answered locally by Route 53 Resolver, or are resolved over the public internet, or are forwarded to on-premises DNS servers via Resolver Endpoints. You can share your query logging configurations across multiple accounts using AWS Resource Access Manager (RAM). You can also choose to send your query logs to Amazon S3, Amazon CloudWatch Logs, or Amazon Data Firehose. \n  There is no additional charge to use Route 53 Resolver Query Logging, although you may incur usage charges from Amazon S3, Amazon CloudWatch, or Amazon Data Firehose. To learn more about Route 53 Resolver Query Logging or to get started, visit the Route 53 Resolver product page or the Route 53 documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-route-53-resolver-query-logging-available-asia-pacific-nz",
      "pubDate": "2025-09-24T07:34:00.000Z",
      "source": "whatsNew",
      "services": [
        "s3",
        "rds",
        "cloudwatch"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "s3",
        "rds",
        "cloudwatch",
        "now-available"
      ]
    },
    {
      "id": "aws-news-81485b9af5b7",
      "title": "Amazon GameLift Servers launches a new Local Zone in Dallas, Texas",
      "description": "Amazon GameLift Servers now supports a new AWS Local Zone in Dallas, Texas (us-east-1-dfw-2). You can use this Local Zone to deploy GameLift Fleets with EC2 C6gn, C6i, C6in, M6g, M6i, M6in, M8g, and R6i instances. Local Zones place AWS services closer to major player population and IT centers where no AWS region exists. From the Amazon GameLift Servers Console, you can enable the Dallas Local Zone and add it to your fleets, just as you would with any other Region or Local Zone.\n  With this launch, game studios can run latency-sensitive workloads such as real-time multiplayer gaming, responsive AR/VR experiences, and competitive tournaments closer to players in the Dallas metro area. Local Zones help deliver single-digit millisecond latency, giving players a smoother, more responsive experience by reducing network distance between your servers and players.\n  For more information on AWS Local Zones, please see here. To see a complete list of supported regions and local zones for Amazon GameLift Servers, visit the Amazon GameLift Servers documentation. For pricing, please visit the Amazon GameLift Servers Instance Pricing page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-gamelift-servers-local-zone-dallas-texas/",
      "pubDate": "2025-09-24T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "launch",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-dfd512c25522",
      "title": "AWS License Manager now supports shared AWS Managed Active Directory",
      "description": "AWS License Manager announces support for shared AWS Managed Active Directory across multiple AWS accounts, simplifying Microsoft license management on AWS. Customers can now centralize user subscriptions of Microsoft Office, Visual Studio, and Remote Desktop Service instances running in their AWS Organization while maintaining clear visibility across AWS accounts.\n  With this launch, customers are no longer required to setup a Managed Active Directory instance for each AWS Account, reducing duplicate directories and IT overhead. Customers can now manage licenses through a single admin account where users subscribe once, and their subscriptions will extend to directory consumer accounts. The new feature is available in all commercial regions where License Manager user subscription is supported.\n  To get started, customers can onboard their shared AWS Managed Active Directory through AWS License Manager console. For more information and to begin using this feature, visit the AWS License Manager page or AWS License Manager User Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-license-manager-shared-managed-active-directory",
      "pubDate": "2025-09-23T14:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "launch",
        "ga",
        "new-feature",
        "support"
      ]
    },
    {
      "id": "aws-news-c72f98e3d935",
      "title": "AWS IAM Identity Center organization instances now support customer-managed KMS keys for encryption at rest",
      "description": "IAM Identity Center now supports customer-managed AWS Key Management Service (KMS) keys for encrypting workforce identity data, including user and group attributes. While AWS-owned keys are used by default, customer-managed keys (CMKs) provide granular control over identity data access, enhancing security and compliance capabilities. IAM Identity Center helps you securely create, or connect, your workforce identities and manage their access centrally across AWS applications and accounts.\n  You create a CMK and manage its lifecycle and usage permissions in AWS KMS. You can configure the CMK in your IAM Identity Center instance either while enabling a new organization instance or on an existing one. You can then use AWS CloudTrail to monitor and audit the usage of your CMK for access to identity data in IAM Identity Center.\n  Support for CMKs in organization instances of IAM Identity Center is now available for access to accounts and select AWS applications in all AWS Regions where IAM Identity Center is available. Standard AWS KMS charges apply to storing and using CMKs. IAM Identity Center is provided at no additional cost.\n  To learn more about IAM Identity Center, visit the product detail page. To get started with using CMKs, please refer to the IAM Identity Center User Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-iam-identity-center-organization-customer-managed-kms-keys-encryption-at-rest/",
      "pubDate": "2025-09-23T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "iam",
        "iam identity center"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "iam",
        "iam identity center",
        "ga",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-e5cdd2c88e7d",
      "title": "Amazon RDS announces cross-Region and cross-account snapshot copy",
      "description": "Amazon RDS now supports cross-Region and cross-account copying of Amazon RDS and Amazon Aurora snapshots. This launch allows you to copy snapshots across Regions and accounts directly without performing it sequentially as two separate copies.\n \nCustomers use cross-Region and cross-account snapshot copies for managing the risk of incidents such as ransomware attacks and region outages affecting their production accounts or primary Regions. Previously, customers that copied snapshots cross-Region and cross-account did so in a two step process that involved first copying the snapshot to a different Region and then to a different account or vice versa. Now, by performing this action in a single step, customers eliminate an intermediate snapshot copy, thereby meeting a high recovery point objective (RPO) as well as saving costs associated with the intermediate copy. Additionally, customers that currently use custom scripts or services such as a Lambda for monitoring the status of the intermediate copy, to then trigger the second copy, can simplify these workflows by eliminating this process.\n \nCross-Region and cross-account snapshot copy is available on all Amazon RDS and Amazon Aurora engines in all AWS Regions, including the AWS China Regions and AWS GovCloud (US) Regions. You can start using this feature today through the AWS Management Console, AWS Command Line Interface (CLI), or AWS SDKs. To get started, refer the Amazon RDS or Amazon Aurora documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-rds-cross-region-cross-account-snapshot-copy/",
      "pubDate": "2025-09-23T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lambda",
        "rds"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda",
        "rds",
        "launch",
        "support"
      ]
    },
    {
      "id": "aws-news-bcbd7977a81b",
      "title": "AWS announces EC2 instance attestation",
      "description": "AWS announces the general availability of EC2 instance attestation to make it easier for customers to validate that only trusted software is running on their EC2 instances, including instances with AI chips and GPUs.\n  Before this, customers could configure their EC2 instances to remove operator access from their own administrators and users, but there was no way for customers to verify that a target EC2 instance had that configuration. With EC2 instance attestation, customers can cryptographically verify that their EC2 instances are running trusted configurations and software.\n  EC2 instance attestation is powered by Nitro Trusted Platform Module (NitroTPM) and Attestable Amazon Machine Images (AMIs). Customers can build an AMI that includes a cryptographic measurement representing all the contents of that AMI. Using NitroTPM, customers can then verify whether a target EC2 instance has the same measurement as the reference measurement generated by the AMI. EC2 instance attestation integrates with AWS Key Management Service (KMS), allowing customers to restrict key operations to instances that pass specific attestation conditions.\n  EC2 instance attestation is available in all AWS Commercial Regions, including the AWS GovCloud (US) Regions.\n  To get started with EC2 instance attestation, see this user guide. To build an Amazon Linux 2023 Attested AMI, see this user guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-announces-ec2-instance-attestation",
      "pubDate": "2025-09-23T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2"
      ]
    },
    {
      "id": "aws-news-5e4ed905e3e5",
      "title": "Amazon Connect now lets you store attributes on specific segments of a contact",
      "description": "Amazon Connect now lets you store attributes on specific segments of a contact, preserving essential business context throughout customer interactions, including transfers and conference calls. Contact center managers can now centrally define and manage attributes such as business unit names, account classifications, or contact reasons. These attributes can be stored as business context on contact segments using flows or the UpdateContact API. For example, a customer engagement that begins with Support and transitions to Sales results in two contact segments. Each segment of this interaction stores information such as precise business unit names, contact reasons, and notes captured by specific agents, creating a detailed and precise record of the customer journey.\n  This feature is available in all AWS regions where Amazon Connect is available. To learn more about contact segment attributes, see the Amazon Connect Administrator Guide. To learn more about Amazon Connect, please visit the Amazon Connect website.\n \nUpdate: 9/29/2025 - This post has been updated to include additional feature details.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-connect-associate-custom-attributes-interaction-segments/",
      "pubDate": "2025-09-23T07:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-53f7d77177d9",
      "title": "Amazon Redshift Serverless is now available in the AWS Asia Paciﬁc (Taipei) region",
      "description": "Amazon Redshift Serverless, which allows you to run and scale analytics without having to provision and manage data warehouse clusters, is now generally available in the AWS Asia Paciﬁc(Taipei) region. With Amazon Redshift Serverless, all users, including data analysts, developers, and data scientists, can use Amazon Redshift to get insights from data in seconds. Amazon Redshift Serverless automatically provisions and intelligently scales data warehouse capacity to deliver high performance for all your analytics. You only pay for the compute used for the duration of the workloads on a per-second basis. You can benefit from this simplicity without making any changes to your existing analytics and business intelligence applications.\n  With a few clicks in the AWS Management Console, you can get started with querying data using the Query Editor V2 or your tool of choice with Amazon Redshift Serverless. There is no need to choose node types, node count, workload management, scaling, and other manual configurations. You can create databases, schemas, and tables, and load your own data from Amazon S3, access data using Amazon Redshift data shares, or restore an existing Amazon Redshift provisioned cluster snapshot. With Amazon Redshift Serverless, you can directly query data in open formats, such as Apache Parquet, in Amazon S3 data lakes. Amazon Redshift Serverless provides unified billing for queries on any of these data sources, helping you efficiently monitor and manage costs.\n  To get started, see the Amazon Redshift Serverless feature page, user documentation, and API Reference.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-redshift-serverless-asia-pacific-taipei/",
      "pubDate": "2025-09-23T04:01:00.000Z",
      "source": "whatsNew",
      "services": [
        "s3",
        "redshift"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "s3",
        "redshift",
        "generally-available",
        "now-available"
      ]
    },
    {
      "id": "aws-news-00935d9b4cf4",
      "title": "Announcing cross-account ingestion for Amazon OpenSearch Service",
      "description": "Amazon OpenSearch Ingestion is a powerful data ingestion pipeline that AWS customers use for many different purposes, such as observability, analytics, and zero-ETL search. Many customers today push logs, traces, and metrics from their applications to OpenSearch Ingestion to store and analyze this data. Today, we are happy to announce that OpenSearch Ingestion pipelines now […]",
      "link": "https://aws.amazon.com/blogs/big-data/announcing-cross-account-ingestion-for-amazon-opensearch-service/",
      "pubDate": "2025-09-19T15:36:59.000Z",
      "source": "bigDataBlog",
      "services": [
        "opensearch",
        "opensearch service",
        "opensearch ingestion"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "opensearch",
        "opensearch service",
        "opensearch ingestion"
      ]
    },
    {
      "id": "aws-news-9c6439e1f1c9",
      "title": "Amazon RDS for MySQL announces Innovation Release 9.4 in Amazon RDS Database Preview Environment",
      "description": "Amazon RDS for MySQL now supports community MySQL Innovation Release 9.4 in the Amazon RDS Database Preview Environment, allowing you to evaluate the latest Innovation Release on Amazon RDS for MySQL. You can deploy MySQL 9.4 in the Amazon RDS Database Preview Environment which provides the benefits of a fully managed database, making it simpler to set up, operate, and monitor databases.\n  MySQL 9.4 is the latest Innovation Release from the MySQL community. MySQL Innovation releases include bug fixes, security patches, as well as new features. MySQL Innovation releases are supported by the community until the next innovation minor, whereas MySQL Long Term Support (LTS) Releases, such as MySQL 8.0 and MySQL 8.4, are supported by the community for up to eight years. Please refer to the MySQL 9.4 release notes and Amazon RDS MySQL release notes for more details.\n  Amazon RDS Database Preview Environment supports both Single-AZ and Multi-AZ deployments on the latest generation of instance classes. Amazon RDS Database Preview Environment database instances are retained for a maximum of 60 days and are automatically deleted after the retention period. Amazon RDS database snapshots created in the Preview Environment can only be used to create or restore database instances within the Preview Environment.\n  Amazon RDS Database Preview Environment database instances are priced the same as production RDS instances created in the US East (Ohio) Region. For further information, see Working with the Database Preview Environment. To get started with the Preview Environment from the RDS console, navigate here.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-rds-mysql-innovation-release-94-database-preview-environment/",
      "pubDate": "2025-09-19T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "nova",
        "rds"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "nova",
        "rds",
        "preview",
        "ga",
        "new-feature",
        "support"
      ]
    },
    {
      "id": "aws-news-9d2a36fc76dc",
      "title": "Amazon Redshift announces the general availability of Multidimensional Data Layouts",
      "description": "Amazon Redshift announces the general availability of Multidimensional Data Layouts (MDDL) that dynamically sort data based on actual query filters, accelerating query performance. Unlike traditional sorting methods that sort data based on fixed columns, MDDL sorts data based on query filters (for example, Sales in US), achieving up to 10x better end-to-end performance compared to using only optimal single-column sort keys for query workloads with repetitive query filters.\n  For each table with an AUTO sort key, which is the default for tables without an explicit sort key, Redshift analyzes the table’s query history and automatically selects either a single-column sort key or MDDL for your table, depending on potential performance improvements for your workload. Redshift with MDDL automatically constructs a multidimensional virtual sort key that co-locates rows typically accessed by the same queries. This virtual column, equivalent to a new sort key for the table, is subsequently used during query execution to skip data blocks and even skip scanning entire predicate columns. Redshift with MDDL provides a more expressive generalization of existing compound and interleaved sort keys that significantly improves the performance of table scans, especially when your query workload contains repetitive query filters. For pre-existing tables with manually defined sort keys, you can take advantage of MDDL by altering the sortkey of the table to AUTO.\n  MDDL is available in all AWS commercial regions where Redshift is available. To get started, read the documentation, blog, and Amazon Science publication to learn more about benchmarks on query performance improvements.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-redshift-multidimensional-data-layouts/",
      "pubDate": "2025-09-19T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "redshift"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "redshift",
        "improvement"
      ]
    },
    {
      "id": "aws-news-88703fe47891",
      "title": "Amazon VPC Reachability Analyzer and Amazon VPC Network Access Analyzer are now available in seven additional AWS Regions",
      "description": "With this launch, Amazon VPC Reachability Analyzer and Amazon VPC Network Access Analyzer are now available in Asia Pacific (New Zealand), Asia Pacific (Hyderabad), Asia Pacific (Melbourne), Asia Pacific (Taipei), Canada West (Calgary), Israel (Tel Aviv) and Mexico (Central).\n  VPC Reachability Analyzer allows you to diagnose network reachability between a source resource and a destination resource in your virtual private clouds (VPCs) by analyzing your network configurations. For example, Reachability Analyzer can help you identify a missing route table entry in your VPC route table that could be blocking network reachability between an EC2 instance in Account A that is not able to connect to another EC2 instance in Account B in your AWS Organization.\n  VPC Network Access Analyzer allows you to identify unintended network access to your AWS resources, helping you meet your security and compliance guidelines. For example, you can create a scope to verify that all paths from your web-applications to the internet, traverse the firewall, and detect any paths that bypass the firewall.\n  For more information, visit documentation for VPC Reachability Analyzer and VPC Network Access Analyzer. For pricing, refer to the Network Analysis tab on the Amazon VPC Pricing Page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-vpc-reachability-network-access-analyzer-seven-regions/",
      "pubDate": "2025-09-18T17:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "launch",
        "ga",
        "now-available"
      ]
    },
    {
      "id": "aws-news-408bebe7fa4b",
      "title": "AWS Step Functions expands data source options and improves observability for Distributed Map",
      "description": "AWS Step Functions now supports additional data sources and new observability metrics for Distributed Map. AWS Step Functions is a visual workflow service capable of orchestrating over 14,000+ API actions from over 220 AWS services to build distributed applications and data processing workloads. Distributed Map is a task state of Step Functions that runs the same process for multiple entries in a data set.\n  With this update, Distributed Map now supports additional data inputs, so you can orchestrate large-scale analytics and ETL workflows. You can now process AWS Athena data manifest and Parquet files directly, iterate over S3 objects under a specified prefix using S3ListObjectsV2, read from JSON objects and natively extract array data from JSON object from Amazon S3 or state input, eliminating the need for custom pre-processing. You also now get visibility into your Distributed Map usage with the following metrics, such as Approximate Open Map Runs Count, Open Map Run Limit, and Approximate Map Runs Backlog Size.\n  New input sources and improved observability for Distributed Map are available in all commercial AWS Regions where AWS Step Functions is available. To get started, you can use the Distributed Map mode today in the AWS Step Functions console. To learn more, visit the Step Functions developer guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-step-functions-data-source-options-observability-distributed-map",
      "pubDate": "2025-09-18T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "s3",
        "athena",
        "step functions"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "s3",
        "athena",
        "step functions",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-3a3a01883567",
      "title": "Unlock the power of Apache Iceberg v3 deletion vectors on Amazon EMR",
      "description": "As modern data architectures expand, Apache Iceberg has become a widely popular open table format, providing ACID transactions, time travel, and schema evolution. In table format v2, Iceberg introduced merge-on-read, improving delete and update handling through positional delete files. These files improve write performance but can slow down reads when not compacted, since Iceberg must […]",
      "link": "https://aws.amazon.com/blogs/big-data/unlock-the-power-of-apache-iceberg-v3-deletion-vectors-on-amazon-emr/",
      "pubDate": "2025-09-17T19:26:40.000Z",
      "source": "bigDataBlog",
      "services": [
        "emr"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "emr",
        "update"
      ]
    },
    {
      "id": "aws-news-6b051fd6522c",
      "title": "AWS Lambda Now Supports Cross-Account Container Images in AWS GovCloud (US) Regions",
      "description": "AWS Lambda now supports creating or updating functions using container images stored in an Amazon Elastic Container Registry (ECR) repository located in a different AWS account than the Lambda function in all AWS GovCloud Regions (US) (AWS GovCloud (US-West) and AWS GovCloud (US-East)). Previously, users could only access container images within the same AWS account as their Lambda function. This often required copying images to a local ECR repository if they were stored in a centralized account.\n  This enhancement streamlines the process by allowing access to container images across different accounts. To achieve this, you need to grant necessary permissions to the Lambda resource and the Lambda service principal. This functionality is available in all AWS Regions where both Lambda and ECR are available. See the AWS Region table for more info. Visit the AWS Lambda documentation for further details on configuring these permissions",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-lambda-cross-account-container-images-govcloud",
      "pubDate": "2025-09-17T18:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lambda"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda",
        "enhancement",
        "support"
      ]
    },
    {
      "id": "aws-news-f07ca5eaf4e9",
      "title": "Announcing availability of second-generation AWS Outposts racks in 52 more countries",
      "description": "Second-generation AWS Outposts racks can now be shipped and installed at your data center and on-premises locations in Australia, Bahrain, Brazil, Brunei, Chile, Costa Rica, Egypt, European Union countries, Iceland, Indonesia, Israel, Japan, Jordan, Kenya, the Kingdom of Saudi Arabia, Kuwait, Malaysia, New Zealand, Peru, the Philippines, Singapore, Trinidad and Tobago, Türkiye, the United Arab Emirates (UAE), the United Kingdom, and Vietnam.\n \nOutposts racks extend AWS infrastructure, AWS services, APIs, and tools to virtually any on-premises data center or colocation space for a truly consistent hybrid experience. Outposts racks are ideal for workloads that require low-latency access to on-premises systems, local data processing, and migration of applications with local system interdependencies. Outposts racks can also help meet data residency requirements. Second-generation Outposts racks support the latest generation of x86-powered Amazon Elastic Compute Cloud (Amazon EC2) instances, starting with C7i, M7i, and R7i instances. These instances provide up to 40% better performance compared to C5, M5, and R5 instances on first-generation Outposts racks. Second-generation Outposts racks also offer simplified network scaling and configuration, and support a new category of accelerated networking Amazon EC2 instances optimized for ultra-low latency and high throughput needs.\n \nWith the availability of second-generation Outposts racks in the above countries, you can use AWS services to run your workloads and data in country in your on-premises facilities and connect to the nearest available AWS Region for management and operations.\n \nTo learn more about second-generation Outposts racks, read this blog post and the user guide. For the most updated list of countries and territories and the AWS Regions where second-generation Outposts racks are supported, check out the Outposts racks FAQs page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/second-generation-aws-outposts-racks-more-countries",
      "pubDate": "2025-09-17T16:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2",
        "outposts"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "outposts",
        "ga",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-6aa4a1e461b7",
      "title": "AWS Network Firewall enhances console, monitoring, and security features",
      "description": "AWS Network Firewall now offers enhancements to its console, monitoring dashboard, and security controls. These improvements include expanded monitoring insights and advanced TLS Inspection features. These updates provide customers with enhanced visibility into their firewall's performance and stronger security measures for outbound connections.\n  The monitoring dashboard now provides deeper insights into traffic going to AWS services such as Amazon S3, Amazon DynamoDB, and AWS Backup, which can be sent over PrivateLink endpoints. The dashboard also gives visibility into top source and destination IP addresses based on packets and bytes processed. Customers can filter the dashboard based on IP addresses and protocol, enabling more targeted analysis of network traffic patterns.\n  To further strengthen security, AWS Network Firewall has introduced session holding for TLS Inspection. This feature prevents any TCP and TLS establishment packets from reaching destination servers until TLS protocol rules matching on Server Name Indication (SNI) have been evaluated. This enhancement provides stronger security controls for outbound traffic and helps protect against connections to potentially malicious targets. These new features are available in all AWS Regions where AWS Network Firewall is offered.\n  To learn more about these new features and other AWS Network Firewall capabilities, visit the AWS Network Firewall product page and the service documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-network-firewall-enhances-console-monitoring-security-features",
      "pubDate": "2025-09-17T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "s3",
        "dynamodb"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "s3",
        "dynamodb",
        "ga",
        "new-feature",
        "update",
        "improvement",
        "enhancement"
      ]
    },
    {
      "id": "aws-news-3ac345bcbf3c",
      "title": "AWS End User Messaging now supports CloudFormation for SMS",
      "description": "Today, AWS End User Messaging SMS announces support for AWS CloudFormation, enabling customers to deploy and manage SMS resources using AWS CloudFormation templates. Using AWS CloudFormation, customers can standardize how they setup and manage their SMS resources along side their other AWS resources in the development environment simplifying deployments and delivery pipelines. SMS resources supported via CloudFormation include phone numbers, sender IDs, configuration sets, protection configurations, opt-out lists, resource policies, and phone pools.\n  AWS End User Messaging provides developers with a scalable and cost-effective messaging infrastructure without compromising the safety, security, or results of their communications. Developers can integrate messaging to support uses cases such as one-time passcodes (OTP) at sign-ups, account updates, appointment reminders, delivery notifications, promotions and more.\n  Support for CloudFormation for SMS resources is available in all AWS Regions where End User Messaging is available, see the AWS Region table.\n  To learn more, see AWS End User Messaging.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-end-user-messaging-cloudformation-sms/",
      "pubDate": "2025-09-17T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "cloudformation"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "cloudformation",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-03c530faae0c",
      "title": "Amazon EKS introduces a new catalog of community add-ons in the AWS GovCloud (US) Regions",
      "description": "Today, Amazon Elastic Kubernetes Service (EKS) announced a new catalog of community add-ons that includes metrics-server, kube-state-metrics, cert-manager, prometheus-node-exporter, fluent-bit, and external-dns. This enables you to easily find, select, configure, and manage popular open-source Kubernetes add-ons directly through EKS. Each add-on has been packaged, scanned, and validated for compatibility by EKS, with container images securely hosted in an EKS-owned private Amazon Elastic Container Registry (ECR) repository.\n  To make Kubernetes clusters production-ready, you need to integrate various operational tools and add-ons. These add-ons can come from various sources including AWS and open-source community repositories. Now, EKS makes it easy for you to access a broader selection of add-ons, providing a unified management experience for AWS and community add-ons. You can view available add-ons, compatible versions, configuration options, and install and manage them directly through the EKS Console, API, CLI, eksctl, or IaC tools like AWS CloudFormation.\n  This feature is available in all AWS GovCloud (US) Regions. To learn more visit the EKS documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-eks-community-addons-govcloud",
      "pubDate": "2025-09-16T17:49:00.000Z",
      "source": "whatsNew",
      "services": [
        "eks",
        "cloudformation"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "eks",
        "cloudformation"
      ]
    },
    {
      "id": "aws-news-acef894cb19a",
      "title": "Amazon Aurora PostgreSQL Limitless Database is now available in the AWS GovCloud (US-East, US-West) Regions",
      "description": "Aurora PostgreSQL Limitless Database, now available in AWS GovCloud (US-East, US-West) Regions, makes it easy for you to scale your relational database workloads by providing a serverless endpoint that automatically distributes data and queries across multiple Amazon Aurora Serverless instances while maintaining the transactional consistency of a single database. Aurora PostgreSQL Limitless Database offers capabilities such as distributed query planning and transaction management, removing the need for you to create custom solutions or manage multiple databases to scale. As your workloads increase, Aurora PostgreSQL Limitless Database adds additional compute resources while staying within your specified budget, so there is no need to provision for peak, and compute automatically scales down when demand is low.\n  Aurora PostgreSQL Limitless Database is available with PostgreSQL 16.6, 16.8, and 16.9 compatibility in these regions.\n  For pricing details and Region availability, visit Amazon Aurora pricing. To learn more, read the Aurora PostgreSQL Limitless Database documentation and get started by creating an Aurora PostgreSQL Limitless Database in only a few steps in the Amazon RDS console.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-aurora-postgresql-limitless-database-aws-govcloud-regions",
      "pubDate": "2025-09-16T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "rds"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "rds",
        "now-available"
      ]
    },
    {
      "id": "aws-news-39443e29330a",
      "title": "Amazon S3 now supports conditional deletes in S3 general purpose buckets",
      "description": "Amazon S3 now supports conditional deletes in S3 general purpose buckets, which verify that an object is unchanged before deleting it. This helps you to prevent accidental deletions in high-concurrency, multiple-writer scenarios.\n  You can now perform conditional deletes using the HTTP if-match header with an ETag value. Amazon S3 will only allow your delete request to succeed if the Etag provided matches that of the object. Additionally, you can use the s3:if-match condition key in your S3 bucket policies to enforce conditional delete operations. For example, you can require clients to use the HTTP if-match header in both S3 DeleteObject and S3 DeleteObjects API requests, helping you to minimize the risk of accidentally deleting objects in your bucket.\n  Conditional deletes are available in S3 general purpose buckets at no additional cost in all AWS Regions. You can use the Amazon S3 API, SDKs, and CLI to perform conditional deletes. To learn more, visit the S3 User guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-s3-conditional-deletes-s3-general-purpose-buckets",
      "pubDate": "2025-09-16T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "s3"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "s3",
        "support"
      ]
    },
    {
      "id": "aws-news-3607daa2668b",
      "title": "Amazon Connect Cases now supports date range filters in the case list view",
      "description": "Amazon Connect Cases now supports filtering by date ranges in the case list view, enabling contact center managers and agents to efficiently manage their case workloads. For example, users can filter cases created in the last 30 days for monthly reporting, view cases modified in the last 24 hours to monitor recent activity, or surface cases with potential SLA breaches in the next 2 days to help prevent violations.\n  Amazon Connect Cases is available in the following AWS regions: US East (N. Virginia), US West (Oregon), Canada (Central), Europe (Frankfurt), Europe (London), Asia Pacific (Seoul), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), and Africa (Cape Town) AWS regions. To learn more and get started, visit the Amazon Connect Cases webpage and documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-connect-cases-date-range-filters/",
      "pubDate": "2025-09-15T15:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-2718e085a0ae",
      "title": "Now generally available: Amazon EC2 R8gn instances",
      "description": "Today, AWS announces the general availability of the new Amazon Elastic Compute Cloud (Amazon EC2) R8gn instances. These instances are powered by AWS Graviton4 processors to deliver up to 30% better compute performance than AWS Graviton3 processors. R8gn instances feature the latest 6th generation AWS Nitro Cards, and offer up to 600 Gbps network bandwidth, the highest network bandwidth among network optimized EC2 instances.\n  Take advantage of the enhanced networking capabilities of R8gn to scale the performance and throughput of network-intensive workloads such as SQL and NoSQL databases, and in-memory databases. For increased scalability, these instances offer instance sizes up to 48xlarge, including two metal sizes, up to 1,536 GiB of memory, and up to 60 Gbps of bandwidth to Amazon Elastic Block Store (EBS). These instances support Elastic Fabric Adapter (EFA) networking on the 16xlarge, 24xlarge, 48xlarge, metal-24xl, and metal-48xl sizes, which enables lower latency and improved cluster performance for workloads deployed on tightly coupled clusters.\n  The new instances are available in the following AWS Regions: US East (N. Virginia), and US West (Oregon). Metal sizes are only available in US East (N. Virginia).\n  To learn more, see Amazon R8gn Instances. To begin your Graviton journey, visit the Level up your compute with AWS Graviton page. To get started, see AWS Management Console, AWS Command Line Interface (AWS CLI), and AWS SDKs.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/generally-available-amazon-ec2-r8gn-instances",
      "pubDate": "2025-09-15T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2",
        "rds",
        "graviton"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "rds",
        "graviton",
        "generally-available",
        "support"
      ]
    },
    {
      "id": "aws-news-a0c0b8431f73",
      "title": "DISA STIG for Amazon Linux 2023 is now available",
      "description": "Today, we announce the availability of a Security Technical Implementation Guide (STIG) for Amazon Linux 2023 (AL2023), developed through collaboration between Amazon Web Services (AWS) and the Defense Information Systems Agency (DISA). The STIG guidelines are important for U.S Department of Defense (DOD) and Federal customers needing strict security compliance derived from the National Institute […]",
      "link": "https://aws.amazon.com/blogs/compute/disa-stig-for-amazon-linux-2023-is-now-available/",
      "pubDate": "2025-09-10T21:15:43.000Z",
      "source": "computeBlog",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "now-available"
      ]
    },
    {
      "id": "aws-news-94928335a663",
      "title": "Accessing private Amazon API Gateway endpoints through custom Amazon CloudFront distribution using VPC Origins",
      "description": "This post demonstrates how you can connect CloudFront with a Private REST API in Amazon REST API Gateway using a VPC origin.",
      "link": "https://aws.amazon.com/blogs/compute/accessing-private-amazon-api-gateway-endpoints-through-custom-amazon-cloudfront-distribution-using-vpc-origins/",
      "pubDate": "2025-09-09T17:58:21.000Z",
      "source": "computeBlog",
      "services": [
        "cloudfront",
        "api gateway"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "cloudfront",
        "api gateway",
        "ga"
      ]
    },
    {
      "id": "aws-news-d1d1f77f887e",
      "title": "How Karrot built a feature platform on AWS, Part 1: Motivation and feature serving",
      "description": "This two-part series shows how Karrot developed a new feature platform, which consists of three main components: feature serving, a stream ingestion pipeline, and a batch ingestion pipeline. This post starts by presenting our motivation, our requirements, and the solution architecture, focusing on feature serving.",
      "link": "https://aws.amazon.com/blogs/architecture/how-karrot-built-a-feature-platform-on-aws-part-1-motivation-and-feature-serving/",
      "pubDate": "2025-08-14T15:16:29.000Z",
      "source": "architectureBlog",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "new-feature"
      ]
    },
    {
      "id": "aws-news-40ebd26fef7f",
      "title": "How Karrot built a feature platform on AWS, Part 2: Feature ingestion",
      "description": "This two-part series shows how Karrot developed a new feature platform, which consists of three main components: feature serving, a stream ingestion pipeline, and a batch ingestion pipeline. This post covers the process of collecting features in real-time and batch ingestion into an online store, and the technical approaches for stable operation.",
      "link": "https://aws.amazon.com/blogs/architecture/how-karrot-built-a-feature-platform-on-aws-part-2-feature-ingestion/",
      "pubDate": "2025-08-14T15:16:27.000Z",
      "source": "architectureBlog",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "new-feature"
      ]
    },
    {
      "id": "aws-news-f9b892079d52",
      "title": "Understanding and Remediating Cold Starts: An AWS Lambda Perspective",
      "description": "Cold starts are an important consideration when building applications on serverless platforms. In AWS Lambda, they refer to the initialization steps that occur when a function is invoked after a period of inactivity or during rapid scale-up. While typically brief and infrequent, cold starts can introduce additional latency, making it essential to understand them, especially […]",
      "link": "https://aws.amazon.com/blogs/compute/understanding-and-remediating-cold-starts-an-aws-lambda-perspective/",
      "pubDate": "2025-08-07T22:19:56.000Z",
      "source": "computeBlog",
      "services": [
        "lambda"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda"
      ]
    },
    {
      "id": "aws-news-111f04013ed3",
      "title": "Introducing v2 of Powertools for AWS Lambda (Java)",
      "description": "Modern applications increasingly rely on Serverless technologies such as Amazon Web Services (AWS) Lambda to provide scalability, cost efficiency, and agility. The Serverless Applications Lens for the AWS Well-Architected Framework focuses on how to design, deploy, and architect your Serverless applications to overcome some of these challenges. Powertools for AWS Lambda is a developer toolkit that […]",
      "link": "https://aws.amazon.com/blogs/compute/introducing-v2-of-powertools-for-aws-lambda-java/",
      "pubDate": "2025-07-31T21:45:50.000Z",
      "source": "computeBlog",
      "services": [
        "lambda"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda"
      ]
    },
    {
      "id": "aws-news-b1d270750b10",
      "title": "Streamlining AWS Serverless workflows: From AWS Lambda orchestration to AWS Step Functions",
      "description": "This blog post discusses the AWS Lambda as orchestrator anti-pattern and how to redesign serverless solutions using AWS Step Functions with native integrations.",
      "link": "https://aws.amazon.com/blogs/compute/streamlining-aws-serverless-workflows-from-aws-lambda-orchestration-to-aws-step-functions/",
      "pubDate": "2025-07-31T21:42:38.000Z",
      "source": "computeBlog",
      "services": [
        "lambda",
        "step functions"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda",
        "step functions",
        "integration"
      ]
    },
    {
      "id": "aws-news-eebb7f3e4d88",
      "title": "Implementing message prioritization with quorum queues on Amazon MQ for RabbitMQ",
      "description": "Quorum queues are now available on Amazon MQ for RabbitMQ from version 3.13. Quorum queues are a replicated First-In, First-Out (FIFO) queue type that uses the Raft consensus algorithm to maintain data consistency. Quorum queues on RabbitMQ version 3.13 lack one key feature compared to classic queues: message prioritization. However, RabbitMQ version 4.0 introduced support […]",
      "link": "https://aws.amazon.com/blogs/compute/implementing-message-prioritization-with-quorum-queues-on-amazon-mq-for-rabbitmq/",
      "pubDate": "2025-07-23T20:24:28.000Z",
      "source": "computeBlog",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-2e5da12b0e1a",
      "title": "Building resilient multi-tenant systems with Amazon SQS fair queues",
      "description": "Today, AWS introduced Amazon Simple Queue Service (Amazon SQS) fair queues, a new feature that mitigates noisy neighbor impact in multi-tenant systems. With fair queues, your applications become more resilient and easier to operate, reducing operational overhead while improving quality of service for your customers. In distributed architectures, message queues have become the backbone of […]",
      "link": "https://aws.amazon.com/blogs/compute/building-resilient-multi-tenant-systems-with-amazon-sqs-fair-queues/",
      "pubDate": "2025-07-21T21:45:45.000Z",
      "source": "computeBlog",
      "services": [
        "sqs"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "sqs",
        "ga",
        "new-feature"
      ]
    },
    {
      "id": "aws-news-875544c87826",
      "title": "Preview Release of the AWS SDK Java 2.x HTTP Client built on Apache HttpClient 5.5.x",
      "description": "The AWS SDK for Java 2.x introduces the Apache 5 SDK HTTP client which is built on Apache HttpClient 5.5.x. This new SDK HTTP client is available alongside our existing SDK HTTP clients: Apache HttpClient 4.5.x, Netty, URL Connection, and AWS CRT HttpClient. To differentiate the use of Apache HttpClient 4.5.x and Apache HttpClient 5.5.x, […]",
      "link": "https://aws.amazon.com/blogs/developer/preview-release-of-theaws-sdk-java-2-x-http-client-built-on-apache-httpclient-5-5-x/",
      "pubDate": "2025-07-18T03:36:05.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "preview"
      ]
    },
    {
      "id": "aws-news-6606f79cd3d5",
      "title": "AWS .NET Distributed Cache Provider for Amazon DynamoDB now Generally Available",
      "description": "Today, we are excited to announce the general availability of the AWS .NET Distributed Cache Provider for Amazon DynamoDB. This is a seamless, serverless caching solution that enables .NET developers to efficiently manage their caching needs across distributed systems. Consistent caching is a difficult problem in distributed architectures, where maintaining data integrity and performance across […]",
      "link": "https://aws.amazon.com/blogs/developer/aws-net-distributed-cache-provider-for-amazon-dynamodb-now-generally-available/",
      "pubDate": "2025-07-03T13:49:25.000Z",
      "source": "developersAndDevOps",
      "services": [
        "dynamodb"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "dynamodb",
        "generally-available"
      ]
    },
    {
      "id": "aws-news-ae25b45e1a62",
      "title": "AWS Tools for PowerShell V5 now Generally Available",
      "description": "This blog was co-authored by Afroz Mohammed and Jonathan Nunn, Software Developers on the AWS PowerShell team. We’re excited to announce the general availability of the AWS Tools for PowerShell version 5, a major update that brings new features and improvements in security, along with a few breaking changes. New Features You can now cancel […]",
      "link": "https://aws.amazon.com/blogs/developer/aws-tools-for-powershell-v5-now-generally-available/",
      "pubDate": "2025-06-23T22:59:33.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "generally-available",
        "new-feature",
        "update",
        "improvement"
      ]
    },
    {
      "id": "aws-news-27b43a8f9a42",
      "title": "Deploy to ARM-Based Compute with AWS Deploy Tool for .NET",
      "description": "We’re excited to announce that the AWS Deploy Tool for .NET now supports deploying .NET applications to select ARM-based compute platforms on AWS! Whether you’re deploying from Visual Studio or using the .NET CLI, you can now target cost-effective ARM infrastructure like AWS Graviton with the same streamlined experience you’re used to. Why deploy to […]",
      "link": "https://aws.amazon.com/blogs/developer/deploy-to-arm-based-compute-with-aws-deploy-tool-for-net/",
      "pubDate": "2025-05-08T20:16:40.000Z",
      "source": "developersAndDevOps",
      "services": [
        "graviton"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "graviton",
        "support"
      ]
    },
    {
      "id": "aws-news-4d3126ea3a15",
      "title": "General Availability of AWS SDK for .NET V4.0",
      "description": "Version 4.0 of the AWS SDK for .NET has been released for general availability (GA). V4 has been in development for a little over a year in our SDK’s public GitHub repository with 13 previews being released. This new version contains performance improvements, consistency with other AWS SDKs, and bug and usability fixes that required […]",
      "link": "https://aws.amazon.com/blogs/developer/general-availability-of-aws-sdk-for-net-v4-0/",
      "pubDate": "2025-04-28T20:05:16.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "preview",
        "ga",
        "improvement"
      ]
    },
    {
      "id": "aws-news-49859f1bef68",
      "title": "Introducing the AWS IoT Device SDK for Swift (Developer Preview)",
      "description": "Today, AWS launches the developer preview of the AWS IoT Device SDK for Swift. The IoT Device SDK for Swift empowers Swift developers to create IoT applications for Linux and Apple macOS, iOS, and tvOS platforms using the MQTT 5 protocol. The SDK supports Swift 5.10+ and is designed to help developers easily integrate with […]",
      "link": "https://aws.amazon.com/blogs/developer/introducing-the-aws-iot-device-sdk-for-swift-developer-preview/",
      "pubDate": "2025-03-31T16:26:05.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "launch",
        "preview",
        "support"
      ]
    },
    {
      "id": "aws-news-dd08a704e7e9",
      "title": "Building and Debugging .NET Lambda applications with .NET Aspire (Part 2)",
      "description": "In Part 1 of our blog posts for .NET Aspire and AWS Lambda, we showed you how .NET Aspire can be used for running and debugging .NET Lambda functions. In this part, Part 2, we’ll show you how to take advantage of the .NET Aspire programming model for best practices and for connecting dependent resources […]",
      "link": "https://aws.amazon.com/blogs/developer/building-lambda-with-aspire-part-2/",
      "pubDate": "2025-03-04T17:54:04.000Z",
      "source": "developersAndDevOps",
      "services": [
        "lambda"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda"
      ]
    },
    {
      "id": "aws-news-4185fb6b40aa",
      "title": "Building and Debugging .NET Lambda applications with .NET Aspire (Part 1)",
      "description": "In a recent post we gave some background on .NET Aspire and introduced our AWS integrations with .NET Aspire that integrate AWS into the .NET dev inner loop for building applications. The integrations included how to provision application resources with AWS CloudFormation or AWS Cloud Development Kit (AWS CDK) and using Amazon DynamoDB local for […]",
      "link": "https://aws.amazon.com/blogs/developer/building-lambda-with-aspire-part-1/",
      "pubDate": "2025-03-03T21:16:42.000Z",
      "source": "developersAndDevOps",
      "services": [
        "lambda",
        "dynamodb",
        "cloudformation"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda",
        "dynamodb",
        "cloudformation",
        "ga",
        "integration"
      ]
    },
    {
      "id": "aws-news-866c6557a5ec",
      "title": "Integrating AWS with .NET Aspire",
      "description": ".NET Aspire is a new way of building cloud-ready applications. In particular, it provides an orchestration for local environments in which to run, connect, and debug the components of distributed applications. Those components can be .NET projects, databases, containers, or executables. .NET Aspire is designed to have integrations with common components used in distributed applications. […]",
      "link": "https://aws.amazon.com/blogs/developer/integrating-aws-with-net-aspire/",
      "pubDate": "2025-02-11T20:39:27.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "integration"
      ]
    },
    {
      "id": "aws-news-a6e612fd0c25",
      "title": "Preview 1 of AWS Tools for PowerShell V5",
      "description": "This blog was co-authored by Afroz Mohammed and Jonathan Nunn, Software Developers on the AWS PowerShell team. In August 2024, the AWS Tools for PowerShell team announced the upcoming release of the AWS Tools for PowerShell V5. The first preview release of V5 is now available. Preview 1 of the AWS Tools for PowerShell V5 […]",
      "link": "https://aws.amazon.com/blogs/developer/preview-1-of-aws-tools-for-powershell-v5/",
      "pubDate": "2024-11-18T16:52:04.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "preview",
        "now-available"
      ]
    }
  ]
}