{
  "lastUpdated": "2025-11-03T06:16:52.118Z",
  "category": "general",
  "totalItems": 48,
  "items": [
    {
      "id": "aws-news-d003f23227bd",
      "title": "Amazon GameLift Streams adds AWS Health notifications for aging resources",
      "description": "Amazon GameLift Streams is now integrated with AWS Health and will provide automated notifications about aging stream groups. Customers are sent regular reminders via AWS Health to re-create their stream groups starting as early as the 45th day to the 335th day from the stream group creation date. Stream groups older than 180 days are restricted from adding new applications and automatically expire after the 365th day.\n  This feature strengthens our customer’s security posture by helping customers manage the lifecycle of stream groups and prevent the use of outdated resources that might be missing updates. While the customer focuses on their game development, the service helps maintain the health of their resources.\n  AWS Health will send a reminder to the linked account on the 45th day and on the 150th day from the stream group creation day, informing customers that the stream group will be restricted from adding new applications after the 180-day. A last reminder to re-create the stream group will be sent on 335th day informing customers that the stream group will expire on the 365th day.\n  This feature is available in all AWS Regions where Amazon GameLift Streams is offered at no additional cost.\n  Maintenance warnings or the expiration date of a stream group can be viewed on the Stream group details page on the service console, or by using the ExpiresAt field in the GetStreamGroup API response. \n  To learn more about managing your stream groups and configuring notifications, visit the Amazon GameLift documentation on Stream group lifecycle.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-gamelift-streams-health-notifications",
      "pubDate": "2025-10-31T20:28:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga",
        "update"
      ]
    },
    {
      "id": "aws-news-67e44e4ac369",
      "title": "Amazon Route 53 Resolver now supports AWS PrivateLink",
      "description": "Amazon Route 53 Resolver now supports AWS PrivateLink. Customers can now access and manage Route 53 Resolver and all the related features (Resolver endpoints, Route 53 Resolver DNS Firewall, Resolver Query Logging, Resolver for AWS Outposts) privately, without going through the public internet. AWS PrivateLink provides private connectivity between VPCs, AWS services, and on-premises applications, securely over the Amazon network. When Route 53 Resolver and its features are accessed via AWS PrivateLink, all operations, such as creating, deleting, editing, and listing, can be handled via the Amazon private network. \n  Amazon Route 53 Resolver responds recursively to DNS queries from AWS resources for public records, Amazon VPC-specific DNS names, and Amazon Route 53 private hosted zones, and is available by default in all VPCs. Route 53 Resolver also offers features (Resolver endpoints, Route 53 Resolver DNS Firewall, Resolver Query Logging, Resolver for AWS Outposts) that you can opt-into. You can use Resolver and its features with AWS PrivateLink in regions where Route 53 Resolver and all its associated features are available today, including the AWS GovCloud (US) Regions. For more information about the AWS Regions where Resolver and its features are available, see here.\n  To learn more about Route 53 Resolver and its features, please refer to the service documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/10/amazon-route53-resolver-supports-aws-privatelink",
      "pubDate": "2025-10-31T18:49:00.000Z",
      "source": "whatsNew",
      "services": [
        "rds",
        "outposts"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "rds",
        "outposts",
        "support"
      ]
    },
    {
      "id": "aws-news-1361270bf235",
      "title": "Amazon DynamoDB Accelerator now supports AWS PrivateLink",
      "description": "Amazon DynamoDB Accelerator (DAX) now supports AWS PrivateLink, enabling you to securely access DAX management APIs such as CreateCluster, DescribeClusters, and DeleteCluster over private IP addresses within your virtual private cloud (VPC). DAX clusters already run inside your VPC, and all data plane operations like GetItem and Query are handled privately within the VPC. With this launch, you can now perform cluster management operations privately, without connecting to the public regional endpoint.\n  With AWS PrivateLink, you can simplify private network connectivity between virtual private clouds (VPCs), DAX, and your on-premises data centers using interface VPC endpoints and private IP addresses. It helps you meet compliance regulations and eliminates the need to use public IP addresses, configure firewall rules, or configure an Internet gateway to access DAX from your on-premises data centers.\n  AWS PrivateLink for DAX is available in all Regions where DAX is available today. For information about DAX Regional availability, see the “Service endpoints” section in Amazon DynamoDB endpoints and quotas. There is an additional cost to use the feature. Please see AWS PrivateLink pricing for more details. To get started with DAX and PrivateLink, see AWS PrivateLink for DAX.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-dynamodb-accelerator-privatelink/",
      "pubDate": "2025-10-31T17:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "dynamodb"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "dynamodb",
        "launch",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-2b1c09fd44a5",
      "title": "Announcing larger instances for Amazon Lightsail",
      "description": "Amazon Lightsail now offers three larger instance bundles with up to 64 vCPUs and 256 GB memory. The new instance bundles are available with Linux operating system (OS) and application blueprints, for both IPv6-only and dual-stack networking types. You can create instances using the new bundles with pre-configured Linux OS and application blueprints including WordPress, cPanel & WHM, Plesk, Drupal, Magento, MEAN, LAMP, Node.js, Amazon Linux, Ubuntu, CentOS, Debian, AlmaLinux, and Windows.\n  The new larger instance bundles enable you to scale your web applications and run more compute and memory intensive workloads in Lightsail. These higher performance instance bundles are ideal for general purpose workloads that require ability to handle large spikes in load. Using this new bundle, you can run web and application servers, large databases, virtual desktops, batch processing, enterprise applications, and more.\n  These new bundles now available in all AWS Regions where Amazon Lightsail is available. For more information on pricing, or to get started with your free account, click here.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/larger-instances-amazon-lightsail",
      "pubDate": "2025-10-31T07:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "now-available"
      ]
    },
    {
      "id": "aws-news-0aa2f2feadf3",
      "title": "Amazon S3 Access Grants are now available in additional AWS Regions",
      "description": "You can now create Amazon S3 Access Grants in the AWS Asia Pacific (Thailand) and AWS Mexico (Central) Regions.\n  Amazon S3 Access Grants map identities in directories such as Microsoft Entra ID, or AWS Identity and Access Management (IAM) principals, to datasets in S3. This helps you manage data permissions at scale by automatically granting S3 access to end users based on their corporate identity.\n  Visit the AWS Region Table for complete regional availability information. To learn more about Amazon S3 Access Grants, visit our product page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-s3-access-grants-additional-regions",
      "pubDate": "2025-10-30T17:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "s3",
        "iam"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "s3",
        "iam",
        "now-available"
      ]
    },
    {
      "id": "aws-news-084a1116597e",
      "title": "Introducing AWS Lambda event source mapping tools in the AWS Serverless MCP Server",
      "description": "Modern serverless applications increasingly rely on event-driven architectures, where AWS Lambda functions process events from various sources like Amazon Kinesis, Amazon DynamoDB Streams, Amazon Simple Queue Service (Amazon SQS), Amazon Managed Streaming for Apache Kafka (Amazon MSK), and self-managed Apache Kafka. Although event source mappings (ESM) offer a powerful mechanism for integrating AWS Lambda with […]",
      "link": "https://aws.amazon.com/blogs/compute/introducing-aws-lambda-event-source-mapping-tools-in-the-aws-serverless-mcp-server/",
      "pubDate": "2025-10-30T16:53:19.000Z",
      "source": "computeBlog",
      "services": [
        "lambda",
        "dynamodb",
        "kinesis",
        "kafka",
        "msk",
        "sqs"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda",
        "dynamodb",
        "kinesis",
        "kafka",
        "msk",
        "sqs"
      ]
    },
    {
      "id": "aws-news-1cd5c4da3fdb",
      "title": "AWS Step Functions announces a new metrics dashboard",
      "description": "AWS Step Functions announces improved observability with a new metrics dashboard, giving you visibility into your workflow operations at both the account and state machine levels. AWS Step Functions is a visual workflow service capable of orchestrating over 14,000+ API actions from over 220 AWS services to build distributed applications and data processing workloads.\n  With this launch, you can now view usage and billing metrics in one dashboard on the AWS Step Functions console. Metrics are available at both account and state-machine level. You can now view these metrics for both standard and express workflows. In addition, existing metrics, such as ApproximateOpenMapRunCount, are available on the metrics dashboard.\n  New dashboard and metrics are available in all AWS Regions where AWS Step Functions is available. To get started, open a dashboard today in the AWS Step Functions console. To learn more, visit the Step Functions developer guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-step-functions-metrics-dashboard",
      "pubDate": "2025-10-30T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "step functions"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "step functions",
        "launch"
      ]
    },
    {
      "id": "aws-news-fde598be9a60",
      "title": "AWS Backup adds single-action database snapshot copy across AWS Regions and accounts",
      "description": "AWS Backup now supports copying database snapshots across AWS Regions and accounts using a single copy action. This feature supports Amazon RDS, Amazon Aurora, Amazon Neptune, and Amazon DocumentDB snapshots. It eliminates the need for sequential copying steps.\n \nYou can use cross-Region and cross-account snapshot copies to protect against incidents like ransomware attacks and Region outages that might affect your production accounts or primary Regions. Previously, you needed to perform this as a two-step process—first copying to a different Region, and then to a different account (or vice versa). Now, by completing this in one step, you can achieve faster recovery point objectives (RPOs) while eliminating costs associated with intermediate copies. This streamlined process also simplifies the workflow by removing the need for custom scripts or Lambda functions that monitor intermediate copy status.\n \nThis feature is available for all Amazon RDS and Amazon Aurora engines, Amazon Neptune and Amazon DocumentDB, in all regions where AWS Backup supports cross-Region and cross-account copying of snapshots in separate steps. You can start using this feature today through the AWS Management Console, AWS Command Line Interface (CLI), or AWS SDKs. To get started, refer the AWS Backup documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-backup-single-action-database-snapshot-copy-regions/",
      "pubDate": "2025-10-30T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lambda",
        "rds"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda",
        "rds",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-9221386adf3e",
      "title": "Amazon Managed Service for Prometheus adds anomaly detection",
      "description": "Amazon Managed Service for Prometheus, a fully managed Prometheus-compatible monitoring service now supports anomaly detection. Anomaly detection applies machine-learning algorithms to continuously analyze time series and surfaces anomalies with minimal user intervention. You can use anomaly detection to isolate and troubleshoot unexpected changes in your metric behavior.\n \nAmazon Managed Service for Prometheus Anomaly Detection currently supports Random Cut Forest (RCF), an unsupervised algorithm for detecting anomalous data points within a time series. Once you create and configure an anomaly detector in an Amazon Managed Service for Prometheus workspace, it will create four new time series to represent resulting anomalies and confidence values along with them. Based on the resulting time series, you can create dynamic alerting rules in the Amazon Managed Service for Prometheus Alert manager, to notify you when anomalies occur, and you can also visualize the resulting time series alongside the input time series either in self-managed Grafana or Amazon Managed Grafana dashboards.\n \nThis feature is now available in all AWS regions where Amazon Managed Service for Prometheus is generally available. To configure anomaly detection use the AWS CLI, SDK, or APIs. Check out the Amazon Managed Service for Prometheus user guide for detailed documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-managed-service-anomaly-detection/",
      "pubDate": "2025-10-30T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "rds",
        "grafana"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "rds",
        "grafana",
        "generally-available",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-af7e8a97b317",
      "title": "Amazon S3 adds conditional write functionality to copy operations",
      "description": "Amazon S3 expands conditional write functionality to copy operations. With conditional copy, you can now verify if the object exists or has been modified in your destination S3 bucket before copying it. This helps you coordinate simultaneous writes to the same object and prevents multiple concurrent writers from unintentionally overwriting the object.\n  You can now perform conditional copy operations through S3 CopyObject by including either the HTTP if-none-match header to verify object existence or the HTTP if-match header with ETag to validate the object’s content. Additionally, you can use the s3:if-match and s3:if-none-match condition keys in your S3 bucket policies to enforce conditional copy operations. S3 then evaluates the condition against the specified object's key or ETag before executing the copy operation in the destination bucket. This eliminates the need for additional client-side coordination mechanisms or API validation requests.\n  Conditional copy is available at no additional charge in all AWS Regions in both S3 general purpose and directory buckets. You can use the AWS SDK, API, or CLI to copy data conditionally to your buckets. To learn more about conditional operations, visit the S3 User Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-s3-conditional-write-functionality-copy-operations",
      "pubDate": "2025-10-29T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "s3"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "s3",
        "ga"
      ]
    },
    {
      "id": "aws-news-f75905f6b25e",
      "title": "AWS Control Tower is now available in AWS Asia Pacific (New Zealand) Region",
      "description": "Starting today, customers can use AWS Control Tower in the AWS Asia Pacific (New Zealand) Region. With this launch, AWS Control Tower is available in 34 AWS Regions and the AWS GovCloud (US) Regions. AWS Control Tower offers the easiest way to set up and govern a secure, multi-account AWS environment. It simplifies AWS experiences by orchestrating multiple AWS services on your behalf while maintaining the security and compliance needs of your organization. You can set up a multi-account AWS environment within 30 minutes or less, govern new or existing account configurations, gain visibility into compliance status, and enforce controls at scale.\n  If you are new to AWS Control Tower, you can launch it today in any of the supported regions and you can use AWS Control Tower to govern your multi-account environment in all supported Regions. If you are already using AWS Control Tower and you want to extend its governance features to the newly supported regions in your accounts, you can go to the settings page in your AWS Control Tower dashboard, select your regions, and update your landing zone. Once you update all your governed accounts, your landing zone, managed accounts, and registered OUs will be under governance in the new region(s).\n  For a full list of Regions where AWS Control Tower is available, see the AWS Region Table. To learn more, visit the AWS Control Tower homepage or see the AWS Control Tower User Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-control-tower-asia-pacific-new-zealand-region/",
      "pubDate": "2025-10-29T07:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "launch",
        "ga",
        "now-available",
        "update",
        "support",
        "new-region"
      ]
    },
    {
      "id": "aws-news-062c835cf136",
      "title": "Amazon Kinesis Data Streams now supports 10x larger record sizes: Simplifying real-time data processing",
      "description": "Today, AWS announced that Amazon Kinesis Data Streams now supports record sizes up to 10MiB – a tenfold increase from the previous limit. In this post, we explore Amazon Kinesis Data Streams large record support, including key use cases, configuration of maximum record sizes, throttling considerations, and best practices for optimal performance.",
      "link": "https://aws.amazon.com/blogs/big-data/amazon-kinesis-data-streams-now-supports-10x-larger-record-sizes-simplifying-real-time-data-processing/",
      "pubDate": "2025-10-28T19:23:30.000Z",
      "source": "bigDataBlog",
      "services": [
        "kinesis"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "kinesis",
        "support"
      ]
    },
    {
      "id": "aws-news-89b837dc6976",
      "title": "Amazon ECS Managed Instances now available in all  commercial AWS Regions",
      "description": "Amazon Elastic Container Service (Amazon ECS) Managed Instances is now available in all commercial AWS Regions. ECS Managed Instances is a fully managed compute option designed to eliminate infrastructure management overhead while giving you access to the full capabilities of Amazon EC2. By offloading infrastructure operations to AWS, you get the application performance you want and the simplicity you need while reducing your total cost of ownership.\n  Managed Instances dynamically scales EC2 instances to match your workload requirements and continuously optimizes task placement to reduce infrastructure costs. It also enhances your security posture through regular security patching initiated every 14 days. You can simply define your task requirements such as the number of vCPUs, memory size, and CPU architecture, and Amazon ECS automatically provisions, configures and operates most optimal EC2 instances within your AWS account using AWS-controlled access. You can also specify desired instance types in Managed Instances Capacity Provider configuration, including GPU-accelerated, network-optimized, and burstable performance, to run your workloads on the instance families you prefer.\n  To get started with ECS Managed Instances, use the AWS Console, Amazon ECS MCP Server, or your favorite infrastructure-as-code tooling to enable it in a new or existing Amazon ECS cluster. You will be charged for the management of compute provisioned, in addition to your regular Amazon EC2 costs. To learn more about ECS Managed Instances, visit the feature page, documentation, and AWS News launch blog.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-ecs-managed-instances-commercial-regions/",
      "pubDate": "2025-10-27T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2",
        "ecs"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "ecs",
        "launch",
        "now-available"
      ]
    },
    {
      "id": "aws-news-78b353d06eec",
      "title": "Amazon Redshift Serverless is now available in the AWS Asia Pacific (Osaka) and Asia Pacific (Malaysia) regions",
      "description": "Amazon Redshift Serverless, which allows you to run and scale analytics without having to provision and manage data warehouse clusters, is now generally available in the AWS Asia Pacific (Osaka) and Asia Pacific (Malaysia) regions. With Amazon Redshift Serverless, all users, including data analysts, developers, and data scientists, can use Amazon Redshift to get insights from data in seconds. Amazon Redshift Serverless automatically provisions and intelligently scales data warehouse capacity to deliver high performance for all your analytics. You only pay for the compute used for the duration of the workloads on a per-second basis. You can benefit from this simplicity without making any changes to your existing analytics and business intelligence applications.\n  With a few clicks in the AWS Management Console, you can get started with querying data using the Query Editor V2 or your tool of choice with Amazon Redshift Serverless. There is no need to choose node types, node count, workload management, scaling, and other manual configurations. You can create databases, schemas, and tables, and load your own data from Amazon S3, access data using Amazon Redshift data shares, or restore an existing Amazon Redshift provisioned cluster snapshot. With Amazon Redshift Serverless, you can directly query data in open formats, such as Apache Parquet, in Amazon S3 data lakes. Amazon Redshift Serverless provides unified billing for queries on any of these data sources, helping you efficiently monitor and manage costs.\n  To get started, see the Amazon Redshift Serverless feature page, user documentation, and API Reference.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-redshift-serverless-osaka-malaysia-regions/",
      "pubDate": "2025-10-27T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "s3",
        "redshift"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "s3",
        "redshift",
        "generally-available",
        "now-available"
      ]
    },
    {
      "id": "aws-news-afb6350472f0",
      "title": "Amazon VPC Reachability Analyzer and Amazon VPC Network Access Analyzer are now available in AWS GovCloud (US) Regions",
      "description": "With this launch, Amazon VPC Reachability Analyzer and Amazon VPC Network Access Analyzer are now available in both AWS GovCloud (US-West) and AWS GovCloud (US-East) Regions.\n  VPC Reachability Analyzer allows you to diagnose network reachability between a source resource and a destination resource in your virtual private clouds (VPCs) by analyzing your network configurations. For example, Reachability Analyzer can help you identify a missing route table entry in your VPC route table that could be blocking network reachability between an EC2 instance in Account A that is not able to connect to another EC2 instance in Account B in your AWS Organization.\n  VPC Network Access Analyzer allows you to identify unintended network access to your AWS resources, helping you meet your security and compliance guidelines. For example, you can create a scope to verify that all paths from your web-applications to the internet, traverse the firewall, and detect any paths that bypass the firewall.\n  For more information, visit documentation for VPC Reachability Analyzer and VPC Network Access Analyzer. For pricing, refer to the Network Analysis tab on the Amazon VPC Pricing Page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-vpc-reachability-network-access-analyzer-govcloud",
      "pubDate": "2025-10-24T17:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "launch",
        "ga",
        "now-available"
      ]
    },
    {
      "id": "aws-news-5f20fa4f076a",
      "title": "New Amazon CloudWatch metrics to monitor EC2 instances exceeding I/O performance",
      "description": "Today, Amazon announced two new Amazon CloudWatch metrics that provide insight into when your application exceeds the I/O performance limits for your EC2 instance with attached EBS volumes. These two metrics, Instance EBS IOPS Exceeded Check and Instance EBS Throughput Exceeded Check, monitor if the driven IOPS or throughput is exceeding the maximum EBS IOPS or throughput that your instance can support.\n  With these two new metrics at the instance level, you can quickly identify and respond to application performance issues stemming from exceeding the EBS-Optimized limits of your instance. These metrics will return a value of 0 (performance not exceeded) or a 1 (performance exceeded) when your workload is exceeding the EBS-Optimized IOPS or throughput limit of the EC2 instance. With Amazon CloudWatch, you can use these new metrics to create customized dashboards and set alarms that notify you or automatically perform actions based on these metrics, such as moving to a larger instance size or a different instance type that supports higher EBS-Optimized limits.\n  The Instance EBS IOPS Exceeded Check and Instance EBS Throughput Exceeded Check metrics are available by default at a 1-minute frequency at no additional charges, for all Nitro-based Amazon EC2 instances with EBS volumes attached. You can access these metrics via the EC2 console, CLI, or CloudWatch API in all Commercial AWS Regions, including the AWS GovCloud (US) Regions and China Regions. To learn more about these CloudWatch metrics, please visit the EC2 CloudWatch Metrics documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-cloudwatch-metrics-monitor-ec2-instances-i-o-performance",
      "pubDate": "2025-10-24T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2",
        "rds",
        "cloudwatch"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "rds",
        "cloudwatch",
        "support"
      ]
    },
    {
      "id": "aws-news-b7276fec0ee1",
      "title": "Unlock real-time data insights with schema evolution using Amazon MSK Serverless, Iceberg, and AWS Glue streaming",
      "description": "This post showcases a solution that businesses can use to access real-time data insights without the traditional delays between data creation and analysis. By combining Amazon MSK Serverless, Debezium MySQL connector, AWS Glue streaming, and Apache Iceberg tables, the architecture captures database changes instantly and makes them immediately available for analytics through Amazon Athena. A standout feature is the system's ability to automatically adapt when database structures change—such as adding new columns—without disrupting operations or requiring manual intervention.",
      "link": "https://aws.amazon.com/blogs/big-data/unlock-real-time-data-insights-with-schema-evolution-using-amazon-msk-serverless-iceberg-and-aws-glue-streaming/",
      "pubDate": "2025-10-23T19:54:50.000Z",
      "source": "bigDataBlog",
      "services": [
        "msk",
        "glue",
        "athena"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "msk",
        "glue",
        "athena"
      ]
    },
    {
      "id": "aws-news-fb17a65bd193",
      "title": "Amazon Aurora DSQL is now available in Europe (Frankfurt)",
      "description": "Starting today, Amazon Aurora DSQL is now available in Europe (Frankfurt). Aurora DSQL is the fastest serverless, distributed SQL database with active-active high availability and multi-Region strong consistency. Aurora DSQL enables you to build always available applications with virtually unlimited scalability, the highest availability, and zero infrastructure management. It is designed to make scaling and resilience effortless for your applications and offers the fastest distributed SQL reads and writes.\n  Aurora DSQL is now available in the following AWS Regions: US East (N. Virginia), US East (Ohio), US West (Oregon), Asia Pacific (Osaka), Asia Pacific (Tokyo), Asia Pacific (Seoul), Europe (Ireland), Europe (London), Europe (Paris), and Europe (Frankfurt).\n  Get started with Aurora DSQL for free with the AWS Free Tier. To learn more, visit the Aurora DSQL webpage and documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-aurora-dsql-available-in-frankfurt",
      "pubDate": "2025-10-23T17:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "now-available"
      ]
    },
    {
      "id": "aws-news-e621226bcfb0",
      "title": "AWS Outposts 2U server is now available in the AWS GovCloud (US) Regions",
      "description": "AWS Outposts 2U server is now supported in the AWS GovCloud (US-East) and AWS GovCloud (US-West) Regions. Outposts 2U server is a fully managed service that extends AWS infrastructure, AWS services, APIs, and tools to on-premises or edge locations with limited space or smaller capacity requirements for a truly consistent hybrid experience. It is delivered in an industry-standard 2U form factor and provides up to 128 vCPUs of compute. It is ideal for applications that need to run on-premises to meet low latency and stringent compliance requirements. You can also use Outposts 2U server to manage your local data processing needs.\n \nWith the availability of Outposts 2U server in the GovCloud (US-East) and GovCloud (US-West) Regions, you can now run Amazon Elastic Compute Cloud (Amazon EC2), Amazon Elastic Container Service (Amazon ECS), and AWS IoT Greengrass locally on Outposts 2U servers, and connect to a broader range of AWS services available in the parent AWS GovCloud (US) Region. For AWS GovCloud (US) Regions customers, this means you can run sensitive and controlled unclassified information (CUI) data on-premises at your facilities and connect to the parent AWS GovCloud (US) Region for management and operations.\n \nTo learn more about Outposts 2U server, visit the product page and read the user guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-outposts-2u-server-govcloud-regions",
      "pubDate": "2025-10-23T16:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2",
        "ecs",
        "outposts"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "ecs",
        "outposts",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-a2db976a9cdf",
      "title": "Amazon Connect now supports threaded views and includes conversation history in agent replies",
      "description": "Amazon Connect now includes the conversation history in agent replies and introduces threaded views of email exchanges, making it easier for both agents and customers to maintain context and continuity across interactions. This enhancement provides a more natural and familiar email experience for both agents and customers.\n  Amazon Connect Email is available in the US East (N. Virginia), US West (Oregon), Africa (Cape Town), Asia Pacific (Seoul), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Canada (Central), Europe (Frankfurt), and Europe (London) regions. To learn more and get started, please refer to the help documentation, pricing page, or visit the Amazon Connect website.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-connect-threaded-views-conversation-history/",
      "pubDate": "2025-10-23T07:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga",
        "enhancement",
        "support"
      ]
    },
    {
      "id": "aws-news-360e834c997a",
      "title": "BASF Digital Farming builds a STAC-based solution on Amazon EKS",
      "description": "This post was co-written with Frederic Haase and Julian Blau with BASF Digital Farming GmbH. At xarvio – BASF Digital Farming, our mission is to empower farmers around the world with cutting-edge digital agronomic decision-making tools. Central to this mission is our crop optimization platform, xarvio FIELD MANAGER, which delivers actionable insights through a range […]",
      "link": "https://aws.amazon.com/blogs/architecture/basf-digital-farming-builds-a-stac-based-solution-on-amazon-eks/",
      "pubDate": "2025-10-22T16:21:09.000Z",
      "source": "architectureBlog",
      "services": [
        "eks"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "eks"
      ]
    },
    {
      "id": "aws-news-f7a499ca3343",
      "title": "Amazon S3 now generates AWS CloudTrail events for S3 Tables maintenance operations",
      "description": "Amazon S3 adds AWS CloudTrail events for table maintenance activities in Amazon S3 Tables. You can now use AWS CloudTrail to track compaction and snapshot expiration operations performed by S3 Tables on your tables.\n  S3 Tables automatically performs maintenance to optimize query performance and lower costs of your tables stored in S3 table buckets. You can monitor and audit S3 Tables maintenance activities such as compaction and snapshot expiration as management events in AWS CloudTrail. To get started with monitoring, create a trail in the AWS CloudTrail console and filter for 'AwsServiceEvents' as the eventType and 'TablesMaintenanceEvent' as the eventName.\n  AWS CloudTrail events for S3 Tables maintenance are now available in all AWS Regions where S3 Tables are available. To learn more, visit Amazon S3 Tables product page and documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-s3-generates-aws-cloudtrail-events",
      "pubDate": "2025-10-22T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "s3"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "s3",
        "now-available"
      ]
    },
    {
      "id": "aws-news-296ede5a4ed7",
      "title": "Amazon Redshift auto-copy is now available in 4 additional AWS regions",
      "description": "Amazon Redshift auto-copy is now available in the AWS Asia Pacific (Malaysia), Asia Pacific (Thailand), Mexico (Central), and Asia Pacific (Taipei) regions. With Auto-Copy, you can set up continuous file ingestion from your Amazon S3 prefix and automatically load new files to tables in your Amazon Redshift data warehouse without the need for additional tools or custom solutions.\n  Previously, Amazon Redshift customers had to build their data pipelines using COPY commands to automate continuous loading of data from S3 to Amazon Redshift tables. With auto-copy, you can now setup an integration which will automatically detect and load new files in a specified S3 prefix to Redshift tables. The auto-copy jobs keep track of previously loaded files and exclude them from the ingestion process. You can monitor auto-copy jobs using system tables.\n  To learn more, see the documentation or check out the AWS Blog.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-redshift-auto-copy-additional-aws-regions",
      "pubDate": "2025-10-22T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "s3",
        "redshift"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "s3",
        "redshift",
        "now-available",
        "integration"
      ]
    },
    {
      "id": "aws-news-cde0df35d350",
      "title": "Amazon CloudWatch Agent adds support for Windows Event Log Filters",
      "description": "Amazon CloudWatch agent has added support for configurable Windows Event log filters. This new feature allows customers to selectively collect and send system and application events to CloudWatch from Windows hosts running on Amazon EC2 or on-premises. The addition of customizable filters helps customers to focus on events that meet specific criteria, streamlining log management and analysis.\n  Using this new functionality of the CloudWatch agent, you can define filter criteria for each Windows Event log stream in the agent configuration file. The filtering options include event levels, event IDs, and regular expressions to either \"include\" or \"exclude\" text within events. The agent evaluates each log event against your defined filter criteria to determine whether it should be sent to CloudWatch. Events that don't match your criteria are discarded. Windows event filters help you to manage your log ingestion by processing only the events you need, such as those containing specific error codes, while excluding verbose or unwanted log entries.\n  Amazon CloudWatch Agent is available in all commercial AWS Regions, and the AWS GovCloud (US) Regions.\n  To get started, see Create or Edit the CloudWatch Agent Configuration File in the Amazon CloudWatch User Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-cloudwatch-agent-windows-event-log-filters",
      "pubDate": "2025-10-22T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2",
        "cloudwatch"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "cloudwatch",
        "ga",
        "new-feature",
        "support"
      ]
    },
    {
      "id": "aws-news-4c75acc2ab71",
      "title": "Amazon RDS for SQL Server now supports retaining CDC configurations when restoring database backups",
      "description": "Amazon Relational Database Service (Amazon RDS) for SQL Server now allows maintaining Change Data Capture (CDC) settings and metadata when restoring native database backups. CDC is a Microsoft SQL Server feature that customers can use to record insert, update, and delete operations occurring in a database table, and make these changes accessible to applications. When a database is restored from a backup, CDC configurations and data are not preserved by default, which can result in gaps in data capture. With this new feature, customers can preserve their database CDC settings when restoring a database backup to a new instance, or a different database name.\n  To retain CDC configurations, customers can specify the KEEP_CDC option when restoring a database backup. This option ensures that the CDC metadata and any captured change data are kept intact. Refer to the Amazon RDS for SQL Server User Guide to learn more about KEEP_CDC. This feature is available in all AWS Regions where Amazon RDS for SQL Server is available.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-rds-sql-server-retaining-cdc/",
      "pubDate": "2025-10-22T07:36:00.000Z",
      "source": "whatsNew",
      "services": [
        "rds"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "rds",
        "ga",
        "new-feature",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-f35c600a1583",
      "title": "AWS Parallel Computing Service (PCS) now supports rotation of cluster secret keys",
      "description": "AWS Parallel Computing Service (PCS) now supports rotation of cluster secret keys using AWS Secrets Manager, enabling you to update the secure credentials used for authentication between Slurm controller and compute nodes without creating a new cluster. Regularly rotating your Slurm cluster secret keys strengthens your security posture by reducing the risk of credential compromise and ensuring compliance with best practices. This helps keep your HPC workloads and accounting data safe from unauthorized access.\n  PCS is a managed service that makes it easier to run and scale high performance computing (HPC) workloads on AWS using Slurm. With the support of cluster secret rotation in PCS, you can strengthen your security controls and maintain operational efficiency. You can now implement secret rotation as part of your security best practices while maintaining cluster continuity.\n  This feature is available in all AWS Regions where PCS is available. You can rotate cluster secrets using either the AWS Secrets Manager console or API after preparing your cluster for the rotation process. Read more about PCS support for cluster secret rotation in the PCS User Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-parallel-computing-service-rotation-cluster-secret-keys/",
      "pubDate": "2025-10-22T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "secrets manager"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "secrets manager",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-61a7491573f9",
      "title": "Amazon MQ is now available in AWS Asia Pacific (New Zealand) Region",
      "description": "Amazon MQ is now available in the AWS Asia Pacific (New Zealand) Region with three Availability Zones and API name ap-southeast-6. With this launch, Amazon MQ is now available in a total of 38 regions.\n  Amazon MQ is a managed message broker service for open-source Apache ActiveMQ and RabbitMQ that makes it easier to set up and operate message brokers on AWS. Amazon MQ reduces your operational responsibilities by managing the provisioning, setup, and maintenance of message brokers for you. Because Amazon MQ connects to your current applications with industry-standard APIs and protocols, you can more easily migrate to AWS without having to rewrite code.\n  For more information, please visit the Amazon MQ product page, and see the AWS Region Table for complete regional availability.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-mq-asia-pacific-new-zealand-region/",
      "pubDate": "2025-10-22T07:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "launch",
        "now-available"
      ]
    },
    {
      "id": "aws-news-b90b0ae9cef4",
      "title": "Amazon Corretto October 2025 Quarterly Updates",
      "description": "On October 21, 2025 Amazon announced quarterly security and critical updates for Amazon Corretto Long-Term Supported (LTS) versions of OpenJDK. Corretto 25.0.1, 21.0.9, 17.0.17, 11.0.29, 8u472 are now available for download. Amazon Corretto is a no-cost, multi-platform, production-ready distribution of OpenJDK.\n  This release of Corretto JDK binaries for Generic Linux, Alpine and macOS will include Async-Profiler, a low overhead sampling profiler for Java supported by the Amazon Corretto team. Async-Profiler is designed to provide profiling data for CPU time, allocations in Java Heap, native memory allocations and leaks, contended locks, hardware and software performance counters like cache misses, page faults, context switches, Java method profiling, and much more.\n  Click on the Corretto home page to download Corretto 25, Corretto 21, Corretto 17, Corretto 11, or Corretto 8. You can also get the updates on your Linux system by configuring a Corretto Apt, Yum, or Apk repo.\n  Feedback is welcomed!",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-corretto-october-2025-quarterly-updates",
      "pubDate": "2025-10-21T14:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "now-available",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-3c84fcba387e",
      "title": "AWS Parallel Computing Service (PCS) now supports Slurm v25.05",
      "description": "AWS Parallel Computing Service (PCS) now supports Slurm v25.05. You can now create AWS PCS clusters running the newer Slurm v25.05.\n  The release of Slurm v25.05 in PCS provides new Slurm functionalities including enhanced multi-cluster sackd configuration and improved requeue behavior for instance launch failures. With this release, login nodes can now control multiple clusters without requiring sackd reconfiguration or restart. This enables administrators to pre-configure access to multiple clusters for their users. The new requeue behavior enables more resilient job scheduling by automatically retrying failed instance launches during capacity shortages, thus increasing overall cluster reliability.\n  AWS PCS is a managed service that makes it easier for you to run and scale your high performance computing (HPC) workloads on AWS using Slurm. To learn more about PCS, refer to the service documentation and AWS Region Table.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-parallel-computing-service-supports-pcs-slurm-v25-05/",
      "pubDate": "2025-10-17T20:37:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "launch",
        "support"
      ]
    },
    {
      "id": "aws-news-b3f58661ceb2",
      "title": "Announcing Amazon EC2 Capacity Manager",
      "description": "Today, AWS is announcing the general availability of Amazon EC2 Capacity Manager, a new capability that enables customers to monitor, analyze, and manage EC2 capacity across all of their accounts and regions. This new capability simplifies resource management using a single interface.\n  EC2 Capacity Manager offers customers a comprehensive view of On-Demand, Spot, and Capacity Reservation usage across their accounts and Regions. The new service features dashboards and charts that present high-level insights while allowing customers to drill down into specific details where needed. These details include historical usage trends to help customers gain a better understanding of their capacity patterns over time, as well as optimization opportunities to guide informed capacity decisions, complete with workflows for implementing these insights. In addition to the updated user interface and APIs, EC2 Capacity Manager allows customers to export data, enabling integration with their existing systems.\n  EC2 Capacity Manager is available in all commercial AWS Regions enabled by default at no additional cost.\n  To learn more, visit the EC2 Capacity Manager user guide, read the AWS News Blog, or get started using EC2 Capacity Manager in the AWS console.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-ec2-capacity-manager",
      "pubDate": "2025-10-17T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2",
        "rds"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "rds",
        "ga",
        "update",
        "integration",
        "new-capability"
      ]
    },
    {
      "id": "aws-news-15c89948dcbc",
      "title": "Amazon OpenSearch Service now supports Graviton4 based (c8g,m8g,r8g and r8gd) instances",
      "description": "Amazon OpenSearch Service now supports latest generation Graviton4-based Amazon EC2 instance families. These new instance types are compute optimized (C8g), general purpose (M8g), and memory optimized (R8g, R8gd) instances. \n  AWS Graviton4 processors provide up to 30% better performance than AWS Graviton3 processors with c8g, m8g and r8g & r8gd offering the best price performance for compute-intensive, general purpose, and memory-intensive workloads respectively. To learn more about Graviton4 improvements, please see the blog on r8g instances and the blog on c8g & m8g instances.\n  Amazon OpenSearch Service Graviton4 instances are supported on all OpenSearch versions, and Elasticsearch (open source) versions 7.9 and 7.10. \n  One or more than one Graviton4 instance types are now available on Amazon OpenSearch Service across 23 regions globally: US East (N. Virginia), US East (Ohio), US West (N. California), US West (Oregon), Asia Pacific (Jakarta), Asia Pacific (Hong Kong), Asia Pacific (Hyderabad), Asia Pacific (Mumbai), Asia Pacific (Malaysia), Asia Pacific (Osaka), Asia Pacific (Seoul), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Asia Pacific (Thailand), Canada (Central), Europe (Frankfurt), Europe (Ireland), Europe (London), Europe (Spain), Europe (Stockholm), South America(Sao Paulo) and AWS GovCloud (US-West).\n  For region specific availability & pricing, visit our pricing page. To learn more about Amazon OpenSearch Service and its capabilities, visit our product page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-opensearch-service-supports-graviton4-based-instances",
      "pubDate": "2025-10-17T11:23:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2",
        "opensearch",
        "opensearch service",
        "graviton"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "opensearch",
        "opensearch service",
        "graviton",
        "ga",
        "now-available",
        "improvement",
        "support"
      ]
    },
    {
      "id": "aws-news-24029d05087c",
      "title": "What’s New in the AWS Deploy Tool for .NET",
      "description": "Version 2.0 of the AWS Deploy Tool for .NET is now available. This new major version introduces several foundational upgrades to improve the deployment experience for .NET applications on AWS. The tool comes with new minimum runtime requirements. We have upgraded it to require .NET 8 because the predecessor, .NET 6, is now out of […]",
      "link": "https://aws.amazon.com/blogs/developer/whats-new-in-the-aws-deploy-tool-for-net/",
      "pubDate": "2025-10-14T13:25:42.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "now-available"
      ]
    },
    {
      "id": "aws-news-3dda8646e5ea",
      "title": "Best practices for migrating from Apache Airflow 2.x to Apache Airflow 3.x on Amazon MWAA",
      "description": "Apache Airflow 3.x on Amazon MWAA introduces architectural improvements such as API-based task execution that provides enhanced security and isolation. This migration presents an opportunity to embrace next-generation workflow orchestration capabilities while providing business continuity. This post provides best practices and a streamlined approach to successfully navigate this critical migration, providing minimal disruption to your mission-critical data pipelines while maximizing the enhanced capabilities of Airflow 3.",
      "link": "https://aws.amazon.com/blogs/big-data/best-practices-for-migrating-from-apache-airflow-2-x-to-apache-airflow-3-x-on-amazon-mwaa/",
      "pubDate": "2025-10-07T17:31:02.000Z",
      "source": "bigDataBlog",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga",
        "improvement"
      ]
    },
    {
      "id": "aws-news-2f3bd8791ed1",
      "title": "Modernization of real-time payment orchestration on AWS",
      "description": "The global real-time payments market is experiencing significant growth. According to Fortune Business Insights, the market was valued at USD 24.91 billion in 2024 and is projected to grow to USD 284.49 billion by 2032, with a CAGR of 35.4%. Similarly, Grand View Research reports that the global mobile payment market, valued at USD 88.50 […]",
      "link": "https://aws.amazon.com/blogs/architecture/modernization-of-real-time-payment-orchestration-on-aws/",
      "pubDate": "2025-10-01T23:34:00.000Z",
      "source": "architectureBlog",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": []
    },
    {
      "id": "aws-news-4fbb29739c17",
      "title": "General Availability Release of the Migration Tool for the AWS SDK for Java 2.x",
      "description": "The AWS SDK for Java 1.x (v1) entered maintenance mode on July 31, 2024, and will reach end-of-support on December 31, 2025. We recommend that you migrate to the AWS SDK for Java 2.x (v2) to access new features, enhanced performance, and continued support from AWS. To help you migrate efficiently, we’ve created a migration […]",
      "link": "https://aws.amazon.com/blogs/developer/general-availability-release-of-the-migration-tool-for-the-aws-sdk-for-java-2-x/",
      "pubDate": "2025-09-26T16:47:36.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "new-feature",
        "support"
      ]
    },
    {
      "id": "aws-news-a0c0b8431f73",
      "title": "DISA STIG for Amazon Linux 2023 is now available",
      "description": "Today, we announce the availability of a Security Technical Implementation Guide (STIG) for Amazon Linux 2023 (AL2023), developed through collaboration between Amazon Web Services (AWS) and the Defense Information Systems Agency (DISA). The STIG guidelines are important for U.S Department of Defense (DOD) and Federal customers needing strict security compliance derived from the National Institute […]",
      "link": "https://aws.amazon.com/blogs/compute/disa-stig-for-amazon-linux-2023-is-now-available/",
      "pubDate": "2025-09-10T21:15:43.000Z",
      "source": "computeBlog",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "now-available"
      ]
    },
    {
      "id": "aws-news-94928335a663",
      "title": "Accessing private Amazon API Gateway endpoints through custom Amazon CloudFront distribution using VPC Origins",
      "description": "This post demonstrates how you can connect CloudFront with a Private REST API in Amazon REST API Gateway using a VPC origin.",
      "link": "https://aws.amazon.com/blogs/compute/accessing-private-amazon-api-gateway-endpoints-through-custom-amazon-cloudfront-distribution-using-vpc-origins/",
      "pubDate": "2025-09-09T17:58:21.000Z",
      "source": "computeBlog",
      "services": [
        "cloudfront",
        "api gateway"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "cloudfront",
        "api gateway",
        "ga"
      ]
    },
    {
      "id": "aws-news-d1d1f77f887e",
      "title": "How Karrot built a feature platform on AWS, Part 1: Motivation and feature serving",
      "description": "This two-part series shows how Karrot developed a new feature platform, which consists of three main components: feature serving, a stream ingestion pipeline, and a batch ingestion pipeline. This post starts by presenting our motivation, our requirements, and the solution architecture, focusing on feature serving.",
      "link": "https://aws.amazon.com/blogs/architecture/how-karrot-built-a-feature-platform-on-aws-part-1-motivation-and-feature-serving/",
      "pubDate": "2025-08-14T15:16:29.000Z",
      "source": "architectureBlog",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "new-feature"
      ]
    },
    {
      "id": "aws-news-40ebd26fef7f",
      "title": "How Karrot built a feature platform on AWS, Part 2: Feature ingestion",
      "description": "This two-part series shows how Karrot developed a new feature platform, which consists of three main components: feature serving, a stream ingestion pipeline, and a batch ingestion pipeline. This post covers the process of collecting features in real-time and batch ingestion into an online store, and the technical approaches for stable operation.",
      "link": "https://aws.amazon.com/blogs/architecture/how-karrot-built-a-feature-platform-on-aws-part-2-feature-ingestion/",
      "pubDate": "2025-08-14T15:16:27.000Z",
      "source": "architectureBlog",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "new-feature"
      ]
    },
    {
      "id": "aws-news-875544c87826",
      "title": "Preview Release of the AWS SDK Java 2.x HTTP Client built on Apache HttpClient 5.5.x",
      "description": "The AWS SDK for Java 2.x introduces the Apache 5 SDK HTTP client which is built on Apache HttpClient 5.5.x. This new SDK HTTP client is available alongside our existing SDK HTTP clients: Apache HttpClient 4.5.x, Netty, URL Connection, and AWS CRT HttpClient. To differentiate the use of Apache HttpClient 4.5.x and Apache HttpClient 5.5.x, […]",
      "link": "https://aws.amazon.com/blogs/developer/preview-release-of-theaws-sdk-java-2-x-http-client-built-on-apache-httpclient-5-5-x/",
      "pubDate": "2025-07-18T03:36:05.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "preview"
      ]
    },
    {
      "id": "aws-news-6606f79cd3d5",
      "title": "AWS .NET Distributed Cache Provider for Amazon DynamoDB now Generally Available",
      "description": "Today, we are excited to announce the general availability of the AWS .NET Distributed Cache Provider for Amazon DynamoDB. This is a seamless, serverless caching solution that enables .NET developers to efficiently manage their caching needs across distributed systems. Consistent caching is a difficult problem in distributed architectures, where maintaining data integrity and performance across […]",
      "link": "https://aws.amazon.com/blogs/developer/aws-net-distributed-cache-provider-for-amazon-dynamodb-now-generally-available/",
      "pubDate": "2025-07-03T13:49:25.000Z",
      "source": "developersAndDevOps",
      "services": [
        "dynamodb"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "dynamodb",
        "generally-available"
      ]
    },
    {
      "id": "aws-news-ae25b45e1a62",
      "title": "AWS Tools for PowerShell V5 now Generally Available",
      "description": "This blog was co-authored by Afroz Mohammed and Jonathan Nunn, Software Developers on the AWS PowerShell team. We’re excited to announce the general availability of the AWS Tools for PowerShell version 5, a major update that brings new features and improvements in security, along with a few breaking changes. New Features You can now cancel […]",
      "link": "https://aws.amazon.com/blogs/developer/aws-tools-for-powershell-v5-now-generally-available/",
      "pubDate": "2025-06-23T22:59:33.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "generally-available",
        "new-feature",
        "update",
        "improvement"
      ]
    },
    {
      "id": "aws-news-27b43a8f9a42",
      "title": "Deploy to ARM-Based Compute with AWS Deploy Tool for .NET",
      "description": "We’re excited to announce that the AWS Deploy Tool for .NET now supports deploying .NET applications to select ARM-based compute platforms on AWS! Whether you’re deploying from Visual Studio or using the .NET CLI, you can now target cost-effective ARM infrastructure like AWS Graviton with the same streamlined experience you’re used to. Why deploy to […]",
      "link": "https://aws.amazon.com/blogs/developer/deploy-to-arm-based-compute-with-aws-deploy-tool-for-net/",
      "pubDate": "2025-05-08T20:16:40.000Z",
      "source": "developersAndDevOps",
      "services": [
        "graviton"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "graviton",
        "support"
      ]
    },
    {
      "id": "aws-news-4d3126ea3a15",
      "title": "General Availability of AWS SDK for .NET V4.0",
      "description": "Version 4.0 of the AWS SDK for .NET has been released for general availability (GA). V4 has been in development for a little over a year in our SDK’s public GitHub repository with 13 previews being released. This new version contains performance improvements, consistency with other AWS SDKs, and bug and usability fixes that required […]",
      "link": "https://aws.amazon.com/blogs/developer/general-availability-of-aws-sdk-for-net-v4-0/",
      "pubDate": "2025-04-28T20:05:16.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "preview",
        "ga",
        "improvement"
      ]
    },
    {
      "id": "aws-news-49859f1bef68",
      "title": "Introducing the AWS IoT Device SDK for Swift (Developer Preview)",
      "description": "Today, AWS launches the developer preview of the AWS IoT Device SDK for Swift. The IoT Device SDK for Swift empowers Swift developers to create IoT applications for Linux and Apple macOS, iOS, and tvOS platforms using the MQTT 5 protocol. The SDK supports Swift 5.10+ and is designed to help developers easily integrate with […]",
      "link": "https://aws.amazon.com/blogs/developer/introducing-the-aws-iot-device-sdk-for-swift-developer-preview/",
      "pubDate": "2025-03-31T16:26:05.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "launch",
        "preview",
        "support"
      ]
    },
    {
      "id": "aws-news-dd08a704e7e9",
      "title": "Building and Debugging .NET Lambda applications with .NET Aspire (Part 2)",
      "description": "In Part 1 of our blog posts for .NET Aspire and AWS Lambda, we showed you how .NET Aspire can be used for running and debugging .NET Lambda functions. In this part, Part 2, we’ll show you how to take advantage of the .NET Aspire programming model for best practices and for connecting dependent resources […]",
      "link": "https://aws.amazon.com/blogs/developer/building-lambda-with-aspire-part-2/",
      "pubDate": "2025-03-04T17:54:04.000Z",
      "source": "developersAndDevOps",
      "services": [
        "lambda"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda"
      ]
    },
    {
      "id": "aws-news-4185fb6b40aa",
      "title": "Building and Debugging .NET Lambda applications with .NET Aspire (Part 1)",
      "description": "In a recent post we gave some background on .NET Aspire and introduced our AWS integrations with .NET Aspire that integrate AWS into the .NET dev inner loop for building applications. The integrations included how to provision application resources with AWS CloudFormation or AWS Cloud Development Kit (AWS CDK) and using Amazon DynamoDB local for […]",
      "link": "https://aws.amazon.com/blogs/developer/building-lambda-with-aspire-part-1/",
      "pubDate": "2025-03-03T21:16:42.000Z",
      "source": "developersAndDevOps",
      "services": [
        "lambda",
        "dynamodb",
        "cloudformation"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda",
        "dynamodb",
        "cloudformation",
        "ga",
        "integration"
      ]
    },
    {
      "id": "aws-news-866c6557a5ec",
      "title": "Integrating AWS with .NET Aspire",
      "description": ".NET Aspire is a new way of building cloud-ready applications. In particular, it provides an orchestration for local environments in which to run, connect, and debug the components of distributed applications. Those components can be .NET projects, databases, containers, or executables. .NET Aspire is designed to have integrations with common components used in distributed applications. […]",
      "link": "https://aws.amazon.com/blogs/developer/integrating-aws-with-net-aspire/",
      "pubDate": "2025-02-11T20:39:27.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "integration"
      ]
    }
  ]
}