{
  "lastUpdated": "2025-09-28T12:48:49.486Z",
  "category": "general",
  "totalItems": 26,
  "items": [
    {
      "id": "aws-news-b047d3ce8058",
      "title": "Amazon MSK Connect is now available in five additional AWS Regions",
      "description": "Amazon MSK Connect is now available in five additional AWS Regions: Asia Pacific (Thailand), Asia Pacific (Taipei), Mexico (Central), Canada West (Calgary), and Europe (Spain). MSK Connect enables you to run fully managed Kafka Connect clusters with Amazon Managed Streaming for Apache Kafka (Amazon MSK). With a few clicks, MSK Connect allows you to easily deploy, monitor, and scale connectors that move data in and out of Apache Kafka and Amazon MSK clusters from external systems such as databases, file systems, and search indices. MSK Connect eliminates the need to provision and maintain cluster infrastructure. Connectors scale automatically in response to increases in usage and you pay only for the resources you use. With full compatibility with Kafka Connect, it is easy to migrate workloads without code changes. MSK Connect will support both Amazon MSK-managed and self-managed Apache Kafka clusters.\n  You can get started with MSK Connect from the Amazon MSK console or the Amazon CLI. Visit the AWS Regions page for all the regions where Amazon MSK is available. To get started visit, the MSK Connect product page, pricing page, and the Amazon MSK Developer Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-msk-connect-five-additional-regions/",
      "pubDate": "2025-09-26T14:00:00.000Z",
      "source": "whats-new",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-00c28150b946",
      "title": "AWS WAF Targeted Bot Control, Fraud & DDoS Prevention Rule Group available in 3 more regions",
      "description": "Starting today, AWS WAF’s Targeted Bot Control, Fraud, and DDoS Prevention Rule Group are available in the AWS Asia Pacific (Taipei), Asia Pacific (Bangkok), and Mexico (Central) regions. These features help customers to stay protected against sophisticated bots, application layer DDoS and account takeover attacks.\n \nAWS WAF is a web application firewall that helps you protect your web application resources against common web exploits and bots that can affect availability, compromise security, or consume excessive resources. \n \nTo see the full list of regions where AWS WAF is currently available, visit the AWS Region Table. For more information about the service, visit the AWS WAF page. For more information about pricing, visit the AWS WAF Pricing page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-waf-targeted-bot-control-fraud-ddos-regions-expansion",
      "pubDate": "2025-09-26T07:00:00.000Z",
      "source": "whats-new",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga"
      ]
    },
    {
      "id": "aws-news-c79d309fcc1d",
      "title": "Amazon Redshift Concurrency Scaling is now available in 10 additional AWS regions",
      "description": "Amazon Redshift Concurrency Scaling is now available in the AWS Africa (Cape Town), Asia Pacific (Hong Kong), Asia Pacific (Hyderabad), Asia Pacific (Jakarta), Asia Pacific (Osaka), Asia Pacific (Thailand), Europe (Milan), Middle East (Bahrain), Mexico (Central) and AWS GovCloud (US-West) regions. With the Amazon Redshift Concurrency Scaling feature, you can now support thousands of concurrent users and concurrent queries, with consistently fast query performance.\n  Amazon Redshift Concurrency Scaling elastically scales query processing power to provide consistently fast performance for hundreds of concurrent queries. Concurrency Scaling resources are added to your Redshift cluster transparently in seconds, allowing for increased concurrency to process queries with minimal wait time. Amazon Redshift customers with an active Redshift cluster earn up to one hour of free Concurrency Scaling credits, which is sufficient for the concurrency needs of most customers. Concurrency scaling enables you to specify usage control, providing customers with predictable month-to-month costs, even during periods of fluctuating analytical demand.\n  To enable Amazon Redshift Concurrency Scaling, set the Concurrency Scaling Mode to Auto in your Amazon Web Services Management Console. You can allocate Concurrency Scaling usage to specific user groups and workloads, control the number of Concurrency Scaling clusters that can be used, and monitor Amazon CloudWatch performance and usage metrics.\n  To learn more about concurrency scaling including regional-availability, see our documentation and pricing page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-redshift-concurrency-scaling-additional-aws-regions",
      "pubDate": "2025-09-25T17:00:00.000Z",
      "source": "whats-new",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-8066d2496f40",
      "title": "Amazon EC2 C8gn instances are now available in additional regions",
      "description": "Starting today, Amazon Elastic Compute Cloud (Amazon EC2) C8gn instances, powered by the latest-generation AWS Graviton4 processors, are available in the AWS Region Europe (Frankfurt, Stockholm), Asia Pacific (Singapore). The new instances provide up to 30% better compute performance than Graviton3-based Amazon EC2 C7gn instances. Amazon EC2 C8gn instances feature the latest 6th generation AWS Nitro Cards, and offer up to 600 Gbps network bandwidth, the highest network bandwidth among network optimized EC2 instances.\n  Take advantage of the enhanced networking capabilities of C8gn to scale performance and throughput, while optimizing the cost of running network-intensive workloads such as network virtual appliances, data analytics, CPU-based artificial intelligence and machine learning (AI/ML) inference.\n  For increased scalability, C8gn instances offer instance sizes up to 48xlarge, up to 384 GiB of memory, and up to 60 Gbps of bandwidth to Amazon Elastic Block Store (EBS). C8gn instances support Elastic Fabric Adapter (EFA) networking on the 16xlarge, 24xlarge, 48xlarge, metal-24xl, and metal-48xl sizes, which enables lower latency and improved cluster performance for workloads deployed on tightly coupled clusters.\n  C8gn instances are available in the following AWS Regions: US East (N. Virginia), US West (Oregon, N.California), Europe (Frankfurt, Stockholm), Asia Pacific (Singapore)\n  To learn more, see Amazon C8gn Instances. To begin your Graviton journey, visit the Level up your compute with AWS Graviton page. To get started, see AWS Management Console, AWS Command Line Interface (AWS CLI), and AWS SDKs.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-ec2-c8gn-instances-additional-regions",
      "pubDate": "2025-09-25T14:00:00.000Z",
      "source": "whats-new",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-4240934578e0",
      "title": "Amazon CloudWatch now supports resource tags when monitoring vended metrics",
      "description": "Today, Amazon CloudWatch announces support for a new tag-based telemetry experience to help customers monitor their metrics and set up their alarms using AWS resources tags. This new capability simplifies monitoring cloud infrastructure at scale by automatically adapting alarms and metrics analysis as resources change. DevOps engineers and cloud administrators can now create dynamic monitoring views that align with their organizational structure using their existing AWS resource tags.\n  Tag-based querying filtering eliminates the manual overhead of updating alarms and dashboards after deployments, freeing teams to focus on innovation rather than maintenance. This provides faster, targeted insights that match how teams organize their systems. Teams can query AWS default metrics using their existing resource tags, making it easier to troubleshoot issues and maintain operational visibility while focusing on core business initiatives.\n  CloudWatch tag-based filtering is available in the following regions: US East (N. Virginia); US East (Ohio); US West (N. California); US West (Oregon); Asia Pacific (Tokyo); Asia Pacific (Seoul); Asia Pacific (Singapore); Asia Pacific (Sydney); Asia Pacific (Mumbai); Asia Pacific (Osaka); Canada (Central); Europe (Frankfurt); Europe (Ireland); Europe (London); Europe (Paris); Europe (Stockholm) and South America (São Paulo).\n  To get started, simply enable tag enriched telemetry with one click in the Amazon CloudWatch Settings, or through the AWS Command Line Interface (AWS CLI), and AWS SDKs to use your existing AWS resource tags to monitor your infrastructure. Learn more on the Amazon CloudWatch documentation page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-cloudwatch-tags-observability",
      "pubDate": "2025-09-25T09:00:00.000Z",
      "source": "whats-new",
      "services": [
        "nova"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "nova",
        "ga",
        "support",
        "new-capability"
      ]
    },
    {
      "id": "aws-news-797d0a063558",
      "title": "You can now preview Amazon S3 Tables in the S3 console",
      "description": "You can now preview your Amazon S3 Tables directly in the S3 console without having to write a SQL query. You can view the schema and sample rows of your tables stored in S3 Tables to better understand and gather key information about your data quickly, without any setup.\n \nYou can preview tables in the S3 console in all AWS Regions where S3 Tables are available. You only pay for S3 requests to read a portion of your table. See Amazon S3 pricing and the S3 User Guide for pricing details and to learn more.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/preview-amazon-s3-tables-console",
      "pubDate": "2025-09-25T07:00:00.000Z",
      "source": "whats-new",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "preview",
        "ga"
      ]
    },
    {
      "id": "aws-news-423caa150f87",
      "title": "Application Recovery Controller Region switch is now available in Asia Pacific (New Zealand)",
      "description": "Region switch in Amazon Application Recovery Controller (ARC) is now available in the Asia Pacific (New Zealand) Region. Region switch allows you to orchestrate the specific steps to operate your cross-AWS account application resources out of another AWS Region. It provides dashboards for real-time visibility into the recovery process and gathers data from across resources and accounts required for reporting to regulators and compliance teams. Region switch supports failover and failback for active/passive multi-Region approaches, and shift-away and return for active/active multi-Region approaches. When you create a Region switch plan, it is replicated to all the Regions your application operates in. This removes dependencies on the Region you are leaving for your recovery.\n  To get started, build a Region switch plan using the ARC console, API, or CLI. To learn more, visit the ARC Region switch documentation and pricing page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/application-recovery-controller-region-switch-new-zealand/",
      "pubDate": "2025-09-24T15:03:00.000Z",
      "source": "whats-new",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-e6de0a2f563d",
      "title": "Amazon Route 53 Resolver Query Logging now available in Asia Pacific (New Zealand)",
      "description": "Today, we are announcing the availability of Route 53 Resolver Query Logging in Asia Pacific (New Zealand), enabling you to log DNS queries that originate in your Amazon Virtual Private Cloud (Amazon VPC). With query logging enabled, you can see which domain names have been queried, the AWS resources from which the queries originated - including source IP and instance ID - and the responses that were received. \n  Route 53 Resolver is the Amazon provided DNS server that is available by default in all Amazon VPCs. Route 53 Resolver responds to DNS queries from AWS resources within a VPC for public DNS records, Amazon VPC-specific DNS names, and Amazon Route 53 private hosted zones. With Route 53 Resolver Query Logging, customers can log DNS queries and responses for queries originating from within their VPCs, whether those queries are answered locally by Route 53 Resolver, or are resolved over the public internet, or are forwarded to on-premises DNS servers via Resolver Endpoints. You can share your query logging configurations across multiple accounts using AWS Resource Access Manager (RAM). You can also choose to send your query logs to Amazon S3, Amazon CloudWatch Logs, or Amazon Data Firehose. \n  There is no additional charge to use Route 53 Resolver Query Logging, although you may incur usage charges from Amazon S3, Amazon CloudWatch, or Amazon Data Firehose. To learn more about Route 53 Resolver Query Logging or to get started, visit the Route 53 Resolver product page or the Route 53 documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-route-53-resolver-query-logging-available-asia-pacific-nz",
      "pubDate": "2025-09-24T07:34:00.000Z",
      "source": "whats-new",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "now-available"
      ]
    },
    {
      "id": "aws-news-81485b9af5b7",
      "title": "Amazon GameLift Servers launches a new Local Zone in Dallas, Texas",
      "description": "Amazon GameLift Servers now supports a new AWS Local Zone in Dallas, Texas (us-east-1-dfw-2). You can use this Local Zone to deploy GameLift Fleets with EC2 C6gn, C6i, C6in, M6g, M6i, M6in, M8g, and R6i instances. Local Zones place AWS services closer to major player population and IT centers where no AWS region exists. From the Amazon GameLift Servers Console, you can enable the Dallas Local Zone and add it to your fleets, just as you would with any other Region or Local Zone.\n  With this launch, game studios can run latency-sensitive workloads such as real-time multiplayer gaming, responsive AR/VR experiences, and competitive tournaments closer to players in the Dallas metro area. Local Zones help deliver single-digit millisecond latency, giving players a smoother, more responsive experience by reducing network distance between your servers and players.\n  For more information on AWS Local Zones, please see here. To see a complete list of supported regions and local zones for Amazon GameLift Servers, visit the Amazon GameLift Servers documentation. For pricing, please visit the Amazon GameLift Servers Instance Pricing page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-gamelift-servers-local-zone-dallas-texas/",
      "pubDate": "2025-09-24T07:00:00.000Z",
      "source": "whats-new",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "launch",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-dfd512c25522",
      "title": "AWS License Manager now supports shared AWS Managed Active Directory",
      "description": "AWS License Manager announces support for shared AWS Managed Active Directory across multiple AWS accounts, simplifying Microsoft license management on AWS. Customers can now centralize user subscriptions of Microsoft Office, Visual Studio, and Remote Desktop Service instances running in their AWS Organization while maintaining clear visibility across AWS accounts.\n  With this launch, customers are no longer required to setup a Managed Active Directory instance for each AWS Account, reducing duplicate directories and IT overhead. Customers can now manage licenses through a single admin account where users subscribe once, and their subscriptions will extend to directory consumer accounts. The new feature is available in all commercial regions where License Manager user subscription is supported.\n  To get started, customers can onboard their shared AWS Managed Active Directory through AWS License Manager console. For more information and to begin using this feature, visit the AWS License Manager page or AWS License Manager User Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-license-manager-shared-managed-active-directory",
      "pubDate": "2025-09-23T14:00:00.000Z",
      "source": "whats-new",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "launch",
        "ga",
        "new-feature",
        "support"
      ]
    },
    {
      "id": "aws-news-c72f98e3d935",
      "title": "AWS IAM Identity Center organization instances now support customer-managed KMS keys for encryption at rest",
      "description": "IAM Identity Center now supports customer-managed AWS Key Management Service (KMS) keys for encrypting workforce identity data, including user and group attributes. While AWS-owned keys are used by default, customer-managed keys (CMKs) provide granular control over identity data access, enhancing security and compliance capabilities. IAM Identity Center helps you securely create, or connect, your workforce identities and manage their access centrally across AWS applications and accounts.\n  You create a CMK and manage its lifecycle and usage permissions in AWS KMS. You can configure the CMK in your IAM Identity Center instance either while enabling a new organization instance or on an existing one. You can then use AWS CloudTrail to monitor and audit the usage of your CMK for access to identity data in IAM Identity Center.\n  Support for CMKs in organization instances of IAM Identity Center is now available for access to accounts and select AWS applications in all AWS Regions where IAM Identity Center is available. Standard AWS KMS charges apply to storing and using CMKs. IAM Identity Center is provided at no additional cost.\n  To learn more about IAM Identity Center, visit the product detail page. To get started with using CMKs, please refer to the IAM Identity Center User Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-iam-identity-center-organization-customer-managed-kms-keys-encryption-at-rest/",
      "pubDate": "2025-09-23T07:00:00.000Z",
      "source": "whats-new",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-6bac89759fe3",
      "title": "Amazon Connect now supports you to associate custom attributes with interaction segments",
      "description": "Amazon Connect now supports you to associate custom attributes with interaction segments, ensuring reporting and analytics always reflect the true customer journey. Attributes such as business unit name, account type, or contact reason can be centrally managed with predetermined values and applied to contact records through flows or the UpdateContact API. This approach preserves accurate business context throughout customer journeys, particularly during transfers and multi-party communications. For example, a customer engagement that originates in the Support business unit and transitions to Sales: each distinct interaction segment maintains its precise business unit name, creating an accurate and comprehensive record of the customer journey.\n  This feature is available in all AWS regions where Amazon Connect is available. To learn more about using predefined attributes as contact segment attributes, see the Amazon Connect Administrator Guide. To learn more about Amazon Connect, the AWS contact center as a service solution on the cloud, please visit the Amazon Connect website.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-connect-associate-custom-attributes-interaction-segments/",
      "pubDate": "2025-09-23T07:00:00.000Z",
      "source": "whats-new",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-53f7d77177d9",
      "title": "Amazon Redshift Serverless is now available in the AWS Asia Paciﬁc (Taipei) region",
      "description": "Amazon Redshift Serverless, which allows you to run and scale analytics without having to provision and manage data warehouse clusters, is now generally available in the AWS Asia Paciﬁc(Taipei) region. With Amazon Redshift Serverless, all users, including data analysts, developers, and data scientists, can use Amazon Redshift to get insights from data in seconds. Amazon Redshift Serverless automatically provisions and intelligently scales data warehouse capacity to deliver high performance for all your analytics. You only pay for the compute used for the duration of the workloads on a per-second basis. You can benefit from this simplicity without making any changes to your existing analytics and business intelligence applications.\n  With a few clicks in the AWS Management Console, you can get started with querying data using the Query Editor V2 or your tool of choice with Amazon Redshift Serverless. There is no need to choose node types, node count, workload management, scaling, and other manual configurations. You can create databases, schemas, and tables, and load your own data from Amazon S3, access data using Amazon Redshift data shares, or restore an existing Amazon Redshift provisioned cluster snapshot. With Amazon Redshift Serverless, you can directly query data in open formats, such as Apache Parquet, in Amazon S3 data lakes. Amazon Redshift Serverless provides unified billing for queries on any of these data sources, helping you efficiently monitor and manage costs.\n  To get started, see the Amazon Redshift Serverless feature page, user documentation, and API Reference.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-redshift-serverless-asia-pacific-taipei/",
      "pubDate": "2025-09-23T04:01:00.000Z",
      "source": "whats-new",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "generally-available",
        "now-available"
      ]
    },
    {
      "id": "aws-news-9c6439e1f1c9",
      "title": "Amazon RDS for MySQL announces Innovation Release 9.4 in Amazon RDS Database Preview Environment",
      "description": "Amazon RDS for MySQL now supports community MySQL Innovation Release 9.4 in the Amazon RDS Database Preview Environment, allowing you to evaluate the latest Innovation Release on Amazon RDS for MySQL. You can deploy MySQL 9.4 in the Amazon RDS Database Preview Environment which provides the benefits of a fully managed database, making it simpler to set up, operate, and monitor databases.\n  MySQL 9.4 is the latest Innovation Release from the MySQL community. MySQL Innovation releases include bug fixes, security patches, as well as new features. MySQL Innovation releases are supported by the community until the next innovation minor, whereas MySQL Long Term Support (LTS) Releases, such as MySQL 8.0 and MySQL 8.4, are supported by the community for up to eight years. Please refer to the MySQL 9.4 release notes and Amazon RDS MySQL release notes for more details.\n  Amazon RDS Database Preview Environment supports both Single-AZ and Multi-AZ deployments on the latest generation of instance classes. Amazon RDS Database Preview Environment database instances are retained for a maximum of 60 days and are automatically deleted after the retention period. Amazon RDS database snapshots created in the Preview Environment can only be used to create or restore database instances within the Preview Environment.\n  Amazon RDS Database Preview Environment database instances are priced the same as production RDS instances created in the US East (Ohio) Region. For further information, see Working with the Database Preview Environment. To get started with the Preview Environment from the RDS console, navigate here.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-rds-mysql-innovation-release-94-database-preview-environment/",
      "pubDate": "2025-09-19T15:00:00.000Z",
      "source": "whats-new",
      "services": [
        "nova"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "nova",
        "preview",
        "ga",
        "new-feature",
        "support"
      ]
    },
    {
      "id": "aws-news-88703fe47891",
      "title": "Amazon VPC Reachability Analyzer and Amazon VPC Network Access Analyzer are now available in seven additional AWS Regions",
      "description": "With this launch, Amazon VPC Reachability Analyzer and Amazon VPC Network Access Analyzer are now available in Asia Pacific (New Zealand), Asia Pacific (Hyderabad), Asia Pacific (Melbourne), Asia Pacific (Taipei), Canada West (Calgary), Israel (Tel Aviv) and Mexico (Central).\n  VPC Reachability Analyzer allows you to diagnose network reachability between a source resource and a destination resource in your virtual private clouds (VPCs) by analyzing your network configurations. For example, Reachability Analyzer can help you identify a missing route table entry in your VPC route table that could be blocking network reachability between an EC2 instance in Account A that is not able to connect to another EC2 instance in Account B in your AWS Organization.\n  VPC Network Access Analyzer allows you to identify unintended network access to your AWS resources, helping you meet your security and compliance guidelines. For example, you can create a scope to verify that all paths from your web-applications to the internet, traverse the firewall, and detect any paths that bypass the firewall.\n  For more information, visit documentation for VPC Reachability Analyzer and VPC Network Access Analyzer. For pricing, refer to the Network Analysis tab on the Amazon VPC Pricing Page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-vpc-reachability-network-access-analyzer-seven-regions/",
      "pubDate": "2025-09-18T17:00:00.000Z",
      "source": "whats-new",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "launch",
        "ga",
        "now-available"
      ]
    },
    {
      "id": "aws-news-d5cfabcbf84e",
      "title": "Amazon CloudWatch launches Cross-Account and Cross-Region Log Centralization",
      "description": "Amazon CloudWatch now offers cross-account and cross-region log centralization, allowing customers to copy log data from multiple AWS accounts and regions into a single destination account. This capability seamlessly integrates with AWS Organizations, enabling efficient aggregation of logs from workloads that span multiple accounts and regions into a single account without the need to manage custom solutions.\n  The log centralization feature provides the ability to scope the centralization rules to copy log data from their entire organization, specific organizational units, or selected accounts into a single account. To maintain source context and data lineage, log events are enriched with new system fields (@aws.account and @aws.region) that identify the original source account and region. Additional capabilities include selective log group copying, automatic merging of same-named log groups in the destination account, and optional backup region setup, simplifying centralized log management.\n  Log centralization is available in US East (Ohio), US East (N. Virginia), US West (N. California), US West (Oregon), Asia Pacific (Mumbai), Asia Pacific (Osaka), Asia Pacific (Seoul), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Canada (Central), Europe (Frankfurt), Europe (Ireland), Europe (London), Europe (Paris), Europe (Stockholm), and South America (São Paulo).\n  To learn more, visit the Amazon CloudWatch documentation. Customers can centralize one copy of logs for free. Additional copies are charged at $0.05/GB of logs centralized (the backup region feature is considered an additional copy). For details, visit the CloudWatch Pricing page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-cloudwatch-cross-account-cross-region-log-centralization",
      "pubDate": "2025-09-17T15:00:00.000Z",
      "source": "whats-new",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "launch",
        "ga"
      ]
    },
    {
      "id": "aws-news-468eb40781e1",
      "title": "Amazon EventBridge extends Customer Managed Key support to rule filter patterns and input transformers",
      "description": "Amazon EventBridge now extends AWS Key Management Service (KMS) customer managed key support to event bus rule filter patterns and input transformers. This capability enables you to use your own encryption keys to protect sensitive information in your event filtering and transformation logic to meet stringent security and compliance requirements while maintaining full control over your encryption keys.\n  Amazon EventBridge is a serverless event router that enables you to create scalable event-driven applications by routing events between your applications, third-party SaaS applications, and AWS services. Filter patterns determine which events match your rules, while input transformers allow you to customize the event data before sending it to targets. By encrypting these components with customer managed keys, you can help meet your organization's compliance and governance requirements and use AWS CloudTrail to audit and track encryption key usage.\n  This feature is available in all commercial AWS Regions. Using this feature incurs no additional cost, but standard AWS KMS pricing applies. To learn more, visit the EventBridge documentation and AWS KMS documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-eventbridge-customer-managed-key-support-filter-patterns-input-transformers",
      "pubDate": "2025-09-17T14:00:00.000Z",
      "source": "whats-new",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-6aa4a1e461b7",
      "title": "AWS Network Firewall enhances console, monitoring, and security features",
      "description": "AWS Network Firewall now offers enhancements to its console, monitoring dashboard, and security controls. These improvements include expanded monitoring insights and advanced TLS Inspection features. These updates provide customers with enhanced visibility into their firewall's performance and stronger security measures for outbound connections.\n  The monitoring dashboard now provides deeper insights into traffic going to AWS services such as Amazon S3, Amazon DynamoDB, and AWS Backup, which can be sent over PrivateLink endpoints. The dashboard also gives visibility into top source and destination IP addresses based on packets and bytes processed. Customers can filter the dashboard based on IP addresses and protocol, enabling more targeted analysis of network traffic patterns.\n  To further strengthen security, AWS Network Firewall has introduced session holding for TLS Inspection. This feature prevents any TCP and TLS establishment packets from reaching destination servers until TLS protocol rules matching on Server Name Indication (SNI) have been evaluated. This enhancement provides stronger security controls for outbound traffic and helps protect against connections to potentially malicious targets. These new features are available in all AWS Regions where AWS Network Firewall is offered.\n  To learn more about these new features and other AWS Network Firewall capabilities, visit the AWS Network Firewall product page and the service documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-network-firewall-enhances-console-monitoring-security-features",
      "pubDate": "2025-09-17T07:00:00.000Z",
      "source": "whats-new",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga",
        "new-feature",
        "update",
        "improvement",
        "enhancement"
      ]
    },
    {
      "id": "aws-news-acef894cb19a",
      "title": "Amazon Aurora PostgreSQL Limitless Database is now available in the AWS GovCloud (US-East, US-West) Regions",
      "description": "Aurora PostgreSQL Limitless Database, now available in AWS GovCloud (US-East, US-West) Regions, makes it easy for you to scale your relational database workloads by providing a serverless endpoint that automatically distributes data and queries across multiple Amazon Aurora Serverless instances while maintaining the transactional consistency of a single database. Aurora PostgreSQL Limitless Database offers capabilities such as distributed query planning and transaction management, removing the need for you to create custom solutions or manage multiple databases to scale. As your workloads increase, Aurora PostgreSQL Limitless Database adds additional compute resources while staying within your specified budget, so there is no need to provision for peak, and compute automatically scales down when demand is low.\n  Aurora PostgreSQL Limitless Database is available with PostgreSQL 16.6, 16.8, and 16.9 compatibility in these regions.\n  For pricing details and Region availability, visit Amazon Aurora pricing. To learn more, read the Aurora PostgreSQL Limitless Database documentation and get started by creating an Aurora PostgreSQL Limitless Database in only a few steps in the Amazon RDS console.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-aurora-postgresql-limitless-database-aws-govcloud-regions",
      "pubDate": "2025-09-16T14:00:00.000Z",
      "source": "whats-new",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "now-available"
      ]
    },
    {
      "id": "aws-news-39443e29330a",
      "title": "Amazon S3 now supports conditional deletes in S3 general purpose buckets",
      "description": "Amazon S3 now supports conditional deletes in S3 general purpose buckets, which verify that an object is unchanged before deleting it. This helps you to prevent accidental deletions in high-concurrency, multiple-writer scenarios.\n  You can now perform conditional deletes using the HTTP if-match header with an ETag value. Amazon S3 will only allow your delete request to succeed if the Etag provided matches that of the object. Additionally, you can use the s3:if-match condition key in your S3 bucket policies to enforce conditional delete operations. For example, you can require clients to use the HTTP if-match header in both S3 DeleteObject and S3 DeleteObjects API requests, helping you to minimize the risk of accidentally deleting objects in your bucket.\n  Conditional deletes are available in S3 general purpose buckets at no additional cost in all AWS Regions. You can use the Amazon S3 API, SDKs, and CLI to perform conditional deletes. To learn more, visit the S3 User guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-s3-conditional-deletes-s3-general-purpose-buckets",
      "pubDate": "2025-09-16T14:00:00.000Z",
      "source": "whats-new",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "support"
      ]
    },
    {
      "id": "aws-news-13e62f3b3518",
      "title": "Amazon OpenSearch Service announces Star-Tree Index",
      "description": "OpenSearch has introduced Star-Tree Index, a new feature that significantly improves aggregation performance for high-cardinality and multi-dimensional queries. This index pre-aggregates data across configured dimensions and metrics at ingestion time, enabling sub-second response times for frequent aggregations like terms, histogram, and range.\n  Star-Tree Index is designed for real-time analytics and requires no changes to query syntax; OpenSearch automatically uses the optimized path when supported queries are detected. Early benchmarks show faster aggregation performance on large datasets. This makes it ideal for use cases such as observability, personalization, and time-series dashboards. It works best with append-only data and builds during segment refresh/merge, with minimal impact on ingestion throughput.\n  Star-Tree Index is available in all regions where OpenSearch 3.1 is supported. The feature is opt-in and can be enabled at index creation time using composite index settings.\n  Please refer to the AWS Regional Services List for more information about Amazon OpenSearch Service availability. To learn more about Star-Tree Index, see the OpenSearch Documentation",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-opensearch-star-tree-index/",
      "pubDate": "2025-09-16T04:30:00.000Z",
      "source": "whats-new",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga",
        "new-feature",
        "support"
      ]
    },
    {
      "id": "aws-news-3607daa2668b",
      "title": "Amazon Connect Cases now supports date range filters in the case list view",
      "description": "Amazon Connect Cases now supports filtering by date ranges in the case list view, enabling contact center managers and agents to efficiently manage their case workloads. For example, users can filter cases created in the last 30 days for monthly reporting, view cases modified in the last 24 hours to monitor recent activity, or surface cases with potential SLA breaches in the next 2 days to help prevent violations.\n  Amazon Connect Cases is available in the following AWS regions: US East (N. Virginia), US West (Oregon), Canada (Central), Europe (Frankfurt), Europe (London), Asia Pacific (Seoul), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), and Africa (Cape Town) AWS regions. To learn more and get started, visit the Amazon Connect Cases webpage and documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-connect-cases-date-range-filters/",
      "pubDate": "2025-09-15T15:00:00.000Z",
      "source": "whats-new",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-2718e085a0ae",
      "title": "Now generally available: Amazon EC2 R8gn instances",
      "description": "Today, AWS announces the general availability of the new Amazon Elastic Compute Cloud (Amazon EC2) R8gn instances. These instances are powered by AWS Graviton4 processors to deliver up to 30% better compute performance than AWS Graviton3 processors. R8gn instances feature the latest 6th generation AWS Nitro Cards, and offer up to 600 Gbps network bandwidth, the highest network bandwidth among network optimized EC2 instances.\n  Take advantage of the enhanced networking capabilities of R8gn to scale the performance and throughput of network-intensive workloads such as SQL and NoSQL databases, and in-memory databases. For increased scalability, these instances offer instance sizes up to 48xlarge, including two metal sizes, up to 1,536 GiB of memory, and up to 60 Gbps of bandwidth to Amazon Elastic Block Store (EBS). These instances support Elastic Fabric Adapter (EFA) networking on the 16xlarge, 24xlarge, 48xlarge, metal-24xl, and metal-48xl sizes, which enables lower latency and improved cluster performance for workloads deployed on tightly coupled clusters.\n  The new instances are available in the following AWS Regions: US East (N. Virginia), and US West (Oregon). Metal sizes are only available in US East (N. Virginia).\n  To learn more, see Amazon R8gn Instances. To begin your Graviton journey, visit the Level up your compute with AWS Graviton page. To get started, see AWS Management Console, AWS Command Line Interface (AWS CLI), and AWS SDKs.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/generally-available-amazon-ec2-r8gn-instances",
      "pubDate": "2025-09-15T14:00:00.000Z",
      "source": "whats-new",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "generally-available",
        "support"
      ]
    },
    {
      "id": "aws-news-9647db854f84",
      "title": "AWS Organizations now provides account state information for member accounts",
      "description": "AWS Organizations provides a new State field in the AWS Organizations Console and APIs (DescribeAccount, ListAccounts, and ListAccountsForParent) to enhance AWS account lifecycle visibility. With this launch, the account state, a new State field replaced the existing account status, Status field in the AWS Organizations Console, however both Status and State fields will remain available in the APIs until September 9, 2026.\n  This launch allows you to have a more granular account state information such as, 'SUSPENDED' for AWS-enforced suspension, 'PENDING_CLOSURE' for in-process closure requests, and 'CLOSED' for accounts in their 90-day reinstatement window, and more. After September, 2026 the Status field will be fully deprecated. Customers using account vending pipelines should update their implementations to reference the State field before the Status field deprecation date. This feature is available in all AWS commercial and AWS GovCloud (US) Regions. To get started managing your accounts, please see the blog post and documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-organizations-provides-account-state-information-member-accounts",
      "pubDate": "2025-09-15T14:00:00.000Z",
      "source": "whats-new",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "launch",
        "ga",
        "update"
      ]
    },
    {
      "id": "aws-news-4e6baf0adce0",
      "title": "Deadline Cloud is now available in Asia Pacific (Seoul) and Europe (London)",
      "description": "We are excited to announce that AWS Deadline Cloud is now available in Asia Pacific (Seoul) and Europe (London). Deadline Cloud is a fully managed service that simplifies render management for teams creating computer-generated graphics and visual effects for films, television, broadcasting, web content, and design. Customers can now use Deadline Cloud to scale their render farms in regions that are close to their creative teams, enabling better integration with existing AWS services and creative pipelines.\n  Deadline Cloud is now available in 10 AWS regions worldwide: US East (N. Virginia and Ohio), US West (Oregon), Asia Pacific (Seoul, Singapore, Sydney and Tokyo), and Europe (Frankfurt, Ireland, and London). For more information about AWS Regions and where Deadline Cloud is available, see the AWS Region table. To learn more about AWS Deadline Cloud and its regional availability, visit the AWS Deadline Cloud product page or refer to the AWS Regional Services List.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/deadline-cloud-in-asia-pacific-seoul-europe-london/",
      "pubDate": "2025-09-12T07:00:00.000Z",
      "source": "whats-new",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga",
        "now-available",
        "integration"
      ]
    },
    {
      "id": "aws-news-e23b7dbed26b",
      "title": "Malware Protection for S3 Expands File Size and Archive Scanning Limits",
      "description": "Today, AWS announces enhanced scanning capabilities for GuardDuty Malware Protection for Amazon S3. This launch increases scanning capabilities by raising the maximum file size limit from 5GB to 100 GB. Additionally, the archive processing capacity has been expanded to handle up to 10,000 files per archive, up from the previous limit of 1,000 files.\n  GuardDuty Malware Protection for S3 is a fully managed threat detection service that automatically scans objects uploaded to S3 buckets and alerts customers of malware, viruses, and other malicious code before they can impact workloads or downstream processes. With this launch, GuardDuty S3 malware scanning now offers customers even better protection for large files and comprehensive archive collections stored in Amazon S3.\n  The enhanced scanning capabilities are automatically enabled in all AWS Regions where GuardDuty Malware Protection for S3 is supported. To learn more about GuardDuty Malware Protection for S3 and its features, please visit the AWS Documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/malware-protection-s3-file-size-archive-scanning-limits/",
      "pubDate": "2025-09-12T07:00:00.000Z",
      "source": "whats-new",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "launch",
        "support"
      ]
    }
  ]
}