{
  "lastUpdated": "2025-10-13T06:16:40.561Z",
  "category": "general",
  "totalItems": 57,
  "items": [
    {
      "id": "aws-news-a1f4a0bc27e1",
      "title": "Amazon Aurora PostgreSQL now supports R8g database instances in additional AWS regions",
      "description": "AWS Graviton4-based R8g database instances are now generally available for Amazon Aurora with PostgreSQL compatibility in the AWS Canada (Central), AWS Asia Pacific (Singapore) and AWS Asia Pacific (Seoul) regions. R8g instances offer larger instance sizes, up to 48xlarge and features an 8:1 ratio of memory to vCPU, and the latest DDR5 memory. Graviton4-based instances provide up to a 40% performance improvement and up to 29% price/performance improvement for on-demand pricing over Graviton3-based instances of equivalent sizes on Amazon Aurora PostgreSQL databases, depending on database engine, version, and workload.\n  AWS Graviton4 processors are the latest generation of custom-designed AWS Graviton processors built on the AWS Nitro System. R8g DB instances are available with new 24xlarge and 48xlarge sizes. With these new sizes, R8g DB instances offer up to 192 vCPU, up to 50Gbps enhanced networking bandwidth, and up to 40Gbps of bandwidth to the Amazon Elastic Block Store (Amazon EBS).\n  You can launch Graviton4 R8g database instances in the Amazon RDS Management Console or using the AWS CLI. Upgrading a database instance to Graviton4 requires a simple instance type modification. For more details, refer to the Aurora documentation.\n  Amazon Aurora is designed for unparalleled high performance and availability at global scale with full PostgreSQL compatibility. It provides built-in security, continuous backups, serverless compute, up to 15 read replicas, automated multi-Region replication, and integrations with other AWS services. To get started with Amazon Aurora, take a look at our getting started page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-aurora-postgresql-r8g-database-instances-additional-aws-regions/",
      "pubDate": "2025-10-10T16:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "rds",
        "graviton"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "rds",
        "graviton",
        "launch",
        "generally-available",
        "ga",
        "improvement",
        "integration",
        "support"
      ]
    },
    {
      "id": "aws-news-9bd59cda2e40",
      "title": "Amazon Connect now supports agent schedule adherence notifications",
      "description": "Amazon Connect now supports agent schedule adherence notifications, making it easier for you to proactively identify when agents aren't adhering to their scheduled activities. You can define rules to automatically send email or text notifications (via EventBridge) to supervisors when agents exceed adherence thresholds. For example, if agent adherence drops below 85% in a trailing 15-minute window, supervisors can receive an email alert. These automated notifications eliminate the need for continuous dashboard monitoring and enable proactive intervention before service levels decline, improving both supervisor productivity and customer satisfaction.\n  This feature is available in all AWS Regions where Amazon Connect agent scheduling is available. To learn more about Amazon Connect agent scheduling, click here.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-connect-agent-adherence-notifications/",
      "pubDate": "2025-10-10T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "eventbridge"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "eventbridge",
        "support"
      ]
    },
    {
      "id": "aws-news-4776823fd735",
      "title": "AWS Direct Connect announces 100G expansion in Kansas City, MO",
      "description": "Today, AWS announced the expansion of 10 Gbps and 100 Gbps dedicated connections with MACsec encryption capabilities at the existing AWS Direct Connect location in the Netrality KC1 data center near Kansas City, MO. You can now establish private, direct network access to all public AWS Regions (except those in China), AWS GovCloud Regions, and AWS Local Zones from this location.\n  The Direct Connect service enables you to establish a private, physical network connection between AWS and your data center, office, or colocation environment. These private connections can provide a more consistent network experience than those made over the public internet. \n  For more information on the over 146 Direct Connect locations worldwide, visit the locations section of the Direct Connect product detail pages. Or, visit our getting started page to learn more about how to purchase and deploy Direct Connect.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-direct-connect-100g-expansion-kansas-city/",
      "pubDate": "2025-10-09T16:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "expansion"
      ]
    },
    {
      "id": "aws-news-a0b9bf22ad59",
      "title": "Amazon EC2 C6in instances are now available in Mexico (Central) Region",
      "description": "Starting today, Amazon Elastic Compute Cloud (Amazon EC2) C6in instances are available in AWS Region Mexico (Central). These sixth-generation network optimized instances, powered by 3rd Generation Intel Xeon Scalable processors and built on the AWS Nitro System, deliver up to 200Gbps network bandwidth, for 2x more network bandwidth over comparable fifth-generation instances.\n  Customers can use C6in instances to scale the performance of applications such as network virtual appliances (firewalls, virtual routers, load balancers), Telco 5G User Plane Function (UPF), data analytics, high performance computing (HPC), and CPU based AI/ML workloads. C6in instances are available in 10 different sizes with up to 128 vCPUs, including bare metal size. Amazon EC2 sixth-generation x86-based network optimized EC2 instances deliver up to 100Gbps of Amazon Elastic Block Store (Amazon EBS) bandwidth, and up to 400K IOPS. C6in instances offer Elastic Fabric Adapter (EFA) networking support on 32xlarge and metal sizes.\n  C6in instances are available in these AWS Regions: US East (Ohio, N. Virginia), US West (N. California, Oregon), Europe (Frankfurt, Ireland, London, Milan, Paris, Spain, Stockholm, Zurich), Middle East (Bahrain, UAE), Israel (Tel Aviv), Asia Pacific (Hong Kong, Hyderabad, Jakarta, Malaysia, Melbourne, Mumbai, Osaka, Seoul, Singapore, Sydney, Tokyo, Thailand), Africa (Cape Town), South America (Sao Paulo), Canada (Central), Canada West (Calgary), AWS GovCloud (US-West, US-East), and Mexico (Central). To learn more, see the Amazon EC2 C6in instances. To get started, see the AWS Management Console, AWS Command Line Interface (AWS CLI), and AWS SDKs.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-ec2-c6in-instances-mexico-central-region",
      "pubDate": "2025-10-09T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "ga",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-0987601e7773",
      "title": "Amazon DynamoDB now supports Internet Protocol version 6 (IPv6)",
      "description": "Amazon DynamoDB now offers customers the option to use Internet Protocol version 6 (IPv6) addresses in their Amazon Virtual Private Cloud (VPC) when connecting to DynamoDB tables, streams, and DynamoDB Accelerator (DAX), including with AWS PrivateLink Gateway and Interface endpoints. Customers moving to IPv6 can simplify their network stack and meet compliance requirements by using a network that supports both IPv4 and IPv6.\n \nThe continued growth of the internet is exhausting available Internet Protocol version 4 (IPv4) addresses. IPv6 increases the number of available addresses by several orders of magnitude and customers no longer need to manage overlapping address spaces in their VPCs. Customers can standardize their applications on the new version of Internet Protocol by moving to IPv6 with a few clicks in the AWS Management Console.\n \nSupport for IPv6 in Amazon DynamoDB is now available in all commercial AWS Regions in the United States and the AWS GovCloud (US) Regions. It will deploy to the remaining global AWS Regions where Amazon DynamoDB is available over the next few weeks.\n \nTo connect to DynamoDB using IPv6 addresses and check regional availability, please see the DynamoDB developer guide and the DynamoDB Accelerator user guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-dynamodb-ipv6/",
      "pubDate": "2025-10-09T13:58:00.000Z",
      "source": "whatsNew",
      "services": [
        "dynamodb",
        "eks"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "dynamodb",
        "eks",
        "ga",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-0520673886aa",
      "title": "New General Purpose Amazon EC2 M8a Instances",
      "description": "AWS announces the general availability of new general-purpose Amazon EC2 M8a instances. M8a instances are powered by 5th Gen AMD EPYC processors (formerly code named Turin) with a maximum frequency of 4.5 GHz, deliver up to 30% higher performance, and up to 19% better price-performance compared to M7a instances.\n \n\n M8a instances deliver 45% more memory bandwidth compared to M7a instances, making these instances ideal for even latency sensitive workloads. M8a instances deliver even higher performance gains for specific workloads. M8a instances are 60% faster for GroovyJVM benchmark, and up to 39% faster for Cassandra benchmark compared to Amazon EC2 M7a instances. M8a instances are SAP-certified and offer 12 sizes including 2 bare metal sizes. This range of instance sizes allows customers to precisely match their workload requirements.\n \n\n M8a instances are built on the AWS Nitro System and ideal for applications that benefit from high performance and high throughput such as financial applications, gaming, rendering, application servers, simulation modeling, mid-size data stores, application development environments, and caching fleets.\n \n\n M8a instances are available in the following AWS Regions: US East (Ohio), US West (Oregon), and Europe (Spain). To get started, sign in to the AWS Management Console. Customers can purchase these instances via Savings Plans, On-Demand instances, and Spot instances. For more information visit the Amazon EC2 M8a instance page or the AWS News blog.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/general-purpose-amazon-ec2-m8a-instances/",
      "pubDate": "2025-10-08T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "ga"
      ]
    },
    {
      "id": "aws-news-3dda8646e5ea",
      "title": "Best practices for migrating from Apache Airflow 2.x to Apache Airflow 3.x on Amazon MWAA",
      "description": "Apache Airflow 3.x on Amazon MWAA introduces architectural improvements such as API-based task execution that provides enhanced security and isolation. This migration presents an opportunity to embrace next-generation workflow orchestration capabilities while providing business continuity. This post provides best practices and a streamlined approach to successfully navigate this critical migration, providing minimal disruption to your mission-critical data pipelines while maximizing the enhanced capabilities of Airflow 3.",
      "link": "https://aws.amazon.com/blogs/big-data/best-practices-for-migrating-from-apache-airflow-2-x-to-apache-airflow-3-x-on-amazon-mwaa/",
      "pubDate": "2025-10-07T17:31:02.000Z",
      "source": "bigDataBlog",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga",
        "improvement"
      ]
    },
    {
      "id": "aws-news-f4c38a5d81a1",
      "title": "Amazon VPC Lattice now supports configurable IP addresses for Resource Gateways",
      "description": "Starting today, Amazon VPC Lattice lets you configure the number of IPv4 addresses assigned to resource gateway elastic network interfaces (ENIs). This enhancement builds on VPC Lattice's capability of providing access to resources on Layer-4 such as databases, clusters, domain names, etc. across multiple VPCs and accounts.\n  When configuring a resource gateway, you can now specify the number of IPv4 addresses per ENI, which becomes immutable after setting. The IPv4 addresses are used for network address translation and determine the maximum number of concurrent IPv4 connections to a resource. You should consider your expected connection volume when configuring the IPv4 address count. By default, VPC Lattice assigns 16 IPv4 addresses per ENI. For IPv6, VPC Lattice always assigns a /80 CIDR per ENI.\n  This feature is available at no additional cost in all AWS Regions where VPC Lattice is offered. For more information, visit the Amazon VPC Lattice product detail page and Amazon VPC Lattice documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-vpc-lattice-configurable-ip-resource-gateway/",
      "pubDate": "2025-10-07T17:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga",
        "enhancement",
        "support"
      ]
    },
    {
      "id": "aws-news-82628527a6af",
      "title": "Automatic quota management is now generally available for AWS Service Quotas",
      "description": "Today, AWS announces the general availability of a new capability of AWS Service Quotas called automatic quota management. AWS Service Quotas helps you view and manage your quotas from a central location. This new feature monitors quota usage, and notifies customers before they run out of their allocated quotas supported on AWS Service Quotas. This helps customers with better visibility and proactive awareness about their quota usage, enabling them to scale their applications without interruptions.\n  AWS customers can get notified of their quota usage with automatic quota management. Customers can configure their preferred notifications channels, such as email, SMS, or Slack, through Service Quotas console or API. Notifications are also available in AWS Health, and customers can subscribe to related AWS Cloudtrail events for automation workflows.\n  This new capability is now available at no additional cost in all AWS commercial regions. To explore this feature and for details, please visit Service Quotas console and AWS Service Quotas documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/automatic-quota-management-service-quotas/",
      "pubDate": "2025-10-07T07:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "generally-available",
        "now-available",
        "new-feature",
        "support",
        "new-capability"
      ]
    },
    {
      "id": "aws-news-b756e660733a",
      "title": "Amazon EKS and Amazon EKS Distro now supports Kubernetes version 1.34",
      "description": "Kubernetes version 1.34 introduced several new features and bug fixes, and AWS is excited to announce that you can now use Amazon Elastic Kubernetes Service (EKS) and Amazon EKS Distro to run Kubernetes version 1.34. Starting today, you can create new EKS clusters using version 1.34 and upgrade existing clusters to version 1.34 using the EKS console, the eksctl command line interface, or through an infrastructure-as-code tool.\n  Kubernetes version 1.34 introduces several key improvements, including projected service account tokens for kubelet image credential providers helping improve security for container image pulls, and Pod-level resource requests and limits for simplified multi-container resource management. The release also introduces Dynamic Resource Allocation (DRA) prioritized alternatives, enabling workloads to define prioritized device requirements for improved resource scheduling. To learn more about the changes in Kubernetes version 1.34, see our documentation and the Kubernetes project release notes.\n  EKS now supports Kubernetes version 1.34 in all the AWS Regions where EKS is available, including the AWS GovCloud (US) Regions.\n  You can learn more about the Kubernetes versions available on EKS and instructions to update your cluster to version 1.34 by visiting EKS documentation. You can use EKS cluster insights to check if there any issues that can impact your Kubernetes cluster upgrades. EKS Distro builds of Kubernetes version 1.34 are available through ECR Public Gallery and GitHub. Learn more about the EKS version lifecycle policies in the documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-eks-distro-kubernetes-version-1-34",
      "pubDate": "2025-10-06T17:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "eks"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "eks",
        "ga",
        "new-feature",
        "update",
        "improvement",
        "support"
      ]
    },
    {
      "id": "aws-news-4edce0ab1759",
      "title": "AWS Incident Detection and Response is now available in the AWS GovCloud (US) Regions",
      "description": "AWS Incident Detection and Response is now available in both AWS GovCloud (US-West) and AWS GovCloud (US-East) Regions.\n  AWS Incident Detection and Response offers eligible AWS Enterprise Support customers proactive incident engagement to reduce the potential for failure and accelerate recovery of critical workloads from disruption. Incident Detection and Response facilitates your collaboration with AWS to develop runbooks and response plans customized to each onboarded workload.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-incident-detection-now-available-govcloud-regions",
      "pubDate": "2025-10-06T16:59:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-86f21d29807b",
      "title": "Amazon Connect launches new case APIs to link related cases, add custom related items, and search across them",
      "description": "Amazon Connect now allows you to programmatically enrich case data by linking related cases, attaching custom related items, and searching across them, so agents have the full context they need to resolve issues faster. For example, an airline can link all customer cases tied to a single flight cancellation to coordinate rebookings and send proactive updates, while a retailer can attach order and shipment details to a refund request to deliver faster resolutions and keep customers informed.\n  Amazon Connect Cases is available in the following AWS regions: US East (N. Virginia), US West (Oregon), Canada (Central), Europe (Frankfurt), Europe (London), Asia Pacific (Seoul), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), and Africa (Cape Town) AWS regions. To learn more and get started, visit the Amazon Connect Cases webpage and documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-connect-cases-api-link-search/",
      "pubDate": "2025-10-06T15:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "launch",
        "ga",
        "update"
      ]
    },
    {
      "id": "aws-news-54ed1f7ec3e9",
      "title": "Amazon Connect now enables you to customize service level calculations",
      "description": "Amazon Connect now enables you to customize service level calculations to your specific needs. Supervisors and managers can define time thresholds for when a contact is considered to meet service level standards and select which contact outcomes to include in the calculation. For example, managers can choose to count callback contacts, exclude contacts transferred out while waiting in queue, and exclude short abandons using a configurable time threshold. Customization of service level calculation is available from the metric configuration section on the analytics dashboards.\n  With this feature supervisors and managers can now create a service level metric calculation that better aligns with their business operations. With a customized view of service level performance, operations managers can assess how effectively they have met their service standards.\n  This new feature is available in all AWS regions where Amazon Connect is offered. To learn more about customizing your service level calculation, visit the Admin Guide. To learn more about Amazon Connect, the easy-to-use cloud contact center, visit the Amazon Connect website.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-connect-enables-service-level-calculation-configuration",
      "pubDate": "2025-10-06T13:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "rds"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "rds",
        "new-feature"
      ]
    },
    {
      "id": "aws-news-c3e3ed51704c",
      "title": "AWS Glue adds write operations for SAP OData, Adobe Marketo Engage, Salesforce Marketing Cloud, and HubSpot connectors",
      "description": "AWS Glue adds write operations support for SAP OData, Adobe Marketo Engage, Salesforce Marketing Cloud, and HubSpot connectors. This allows you to not only extract data from those applications, but also write data to them directly from your AWS Glue ETL jobs.\n  With the new write functionality you can create and update records in SAP systems; sync leads into Adobe Marketo Engage; updating subscriber and campaign data in Salesforce Marketing Cloud; manage contacts, companies, and deals in HubSpot; and more.\n  This feature simplifies building end-to-end ETL pipelines that both extract data from and write processed results back to target applications, eliminating the need for custom scripts or intermediate systems.\n  Write operations support for SAP OData, Adobe Marketo Engage, Salesforce Marketing Cloud, and HubSpot connectors is available in all Regions where AWS Glue is available. To learn more and see the list of supported entities, visit AWS Glue documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-glue-write-operations-connectors",
      "pubDate": "2025-10-03T20:31:00.000Z",
      "source": "whatsNew",
      "services": [
        "rds",
        "glue"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "rds",
        "glue",
        "ga",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-a054ac93d7cf",
      "title": "AWS Introduces self-service invoice correction feature",
      "description": "Today, AWS announces the general availability of a self-service Invoice correction feature to update AWS invoices. This launch enables all AWS customers to correct key invoice attributes—including purchase order numbers, business legal name, and addresses — on their AWS invoices and get corrected invoices instantaneously.\n  AWS customers can now access the new self-service Invoice correction feature directly from the AWS Billing and Cost Management console. This feature offers AWS customers a guided self-service workflow to update invoice attributes in their account settings and on select invoices. This feature gives AWS customers direct control over invoice corrections while reducing wait times and improving efficiency in managing their AWS accounts.\n  AWS self-service Invoice Correction feature is generally available in all AWS Regions, excluding GovCloud (US) Regions and China (Beijing) and China (Ningxia) Regions.\n  To get started with AWS self-service invoice correction feature, please visit the product details page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/self-service-invoice-correction-feature/",
      "pubDate": "2025-10-03T07:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "launch",
        "generally-available",
        "ga",
        "update"
      ]
    },
    {
      "id": "aws-news-7aab380b0872",
      "title": "EC2 Image Builder now provides enhanced capabilities for managing image pipelines",
      "description": "EC2 Image Builder now automatically disables pipelines after consecutive failures and allows customers to configure custom log groups for image pipelines. These capabilities address common operational needs including improved control over pipeline execution, enhanced customization options for logging requirements, and better visibility.\n  Image Builder pipelines are used to automate the creation, testing, and distribution of custom images across your AWS infrastructure. With the new automatic disablement feature, you can configure pipelines to stop execution after a specified number of consecutive failures, preventing creation of unnecessary resources and reducing costs from repeatedly failed builds. Additionally, you can also configure custom log groups for pipelines with specific log retention periods and encryption settings that align with your organizational policies, providing you enhanced customization options for logging and better visibility. These enhancements collectively provide greater control and efficiency in managing your image building processes.\n  These capabilities are available to all customers at no additional costs, in all AWS commercial regions including AWS China (Beijing) Region, operated by Sinnet, AWS China (Ningxia) Region, operated by NWCD, and AWS GovCloud (US) Regions.\n  You can get started from the EC2 Image Builder Console, CLI, API, CloudFormation, or CDK, and learn more in the EC2 Image Builder documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/ec2-image-builder-capabilities-managing-image-pipelines/",
      "pubDate": "2025-10-03T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2",
        "cloudformation"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "cloudformation",
        "ga",
        "enhancement"
      ]
    },
    {
      "id": "aws-news-e6288adb7214",
      "title": "Amazon Connect now supports agent screen recording for ChromeOS",
      "description": "Amazon Connect now provides screen recording for agents using ChromeOS devices making it easier for you to help improve their performance. With screen recording, you can identify areas for agent coaching (e.g., long contact handle duration or non-compliance with business processes) by not only listening to customer calls or reviewing chat transcripts, but also watching agents’ actions while handling a contact (i.e., a voice call, chat, or task).\n  Screen recording on ChromeOS is available in all the AWS Regions where Amazon Connect is already available. To learn more about screen recording, please visit the documentation and webpage. For information about screen recording pricing, visit the Amazon Connect pricing page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-connect-agent-screen-recording-chromeos/",
      "pubDate": "2025-10-02T17:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "support"
      ]
    },
    {
      "id": "aws-news-d68c776bbac9",
      "title": "AWS Direct Connect announces 100G expansion in Makati City, Philippines",
      "description": "Today, AWS announced the expansion of 10 Gbps and 100 Gbps dedicated connections with MACsec encryption capabilities at the existing AWS Direct Connect location in the ePLDT data center near Makati City, Philippines. You can now establish private, direct network access to all public AWS Regions (except those in China), AWS GovCloud Regions, and AWS Local Zones from this location.\n  The Direct Connect service enables you to establish a private, physical network connection between AWS and your data center, office, or colocation environment. These private connections can provide a more consistent network experience than those made over the public internet. \n  For more information on the over 146 Direct Connect locations worldwide, visit the locations section of the Direct Connect product detail pages. Or, visit our getting started page to learn more about how to purchase and deploy Direct Connect.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-direct-connect-100g-makati-city/",
      "pubDate": "2025-10-02T16:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "expansion"
      ]
    },
    {
      "id": "aws-news-ae2140db7f46",
      "title": "Amazon Connect now provides agent time-off balance data in analytics data lake",
      "description": "Amazon Connect now provides agent time-off balance data in analytics data lake, making it easier for you to generate reports and insights from this data. With this launch, you can now access latest and historical agent time-off balances across different time-off categories (paid time-off, sick leave, leave of absence, etc.) in the analytics data lake. In addition to balances, you can also view a chronological list of all transactions that impacted the balance. For example, if an agent starts with 80 hours of paid time-off on January 1, submits a 20-hour request on January 3, and later cancels it, you can see each transaction's impact on the final 80-hour balance. This launch makes time-off management easier by eliminating the need for managers to manually reconcile balances and time-off transactions, thus improving manager productivity and making it easier for them to respond to agent inquiries.\n  This feature is available in all AWS Regions where Amazon Connect agent scheduling is available. To learn more about Amazon Connect agent scheduling, click here.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-connect-agent-time-off-balance-data/",
      "pubDate": "2025-10-02T15:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "launch"
      ]
    },
    {
      "id": "aws-news-fa68fe21d637",
      "title": "AWS Config advanced query and aggregator now available in Asia Pacific (New Zealand) Region",
      "description": "AWS Config advanced queries and aggregators are now available in Asia Pacific (New Zealand) region. You can use advanced queries to query the current configuration and compliance state of your AWS resources. Aggregators enable centralized visibility and analysis by aggregating configuration and compliance data from multiple accounts and regions, or across an AWS Organization.\n  Advanced queries provide a single query endpoint and a query language to get current resource configuration and compliance state without performing service-specific describe API calls. You can use configuration aggregators to run the same queries from a central account across multiple accounts and AWS Regions.\n  Advanced queries can be used from AWS console and AWS CLI. To learn more about aggregators, please refer to our documentation. With this expansion, AWS Config advanced queries and aggregators are now available in all supported regions.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-config-advanced-query-aggregator-new-zealand-region",
      "pubDate": "2025-10-02T14:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga",
        "now-available",
        "support",
        "expansion"
      ]
    },
    {
      "id": "aws-news-09fe0587fe17",
      "title": "AWS Secrets Manager expands AWS PrivateLink support to FIPS endpoints",
      "description": "AWS Secrets Manager now supports AWS PrivateLink with all Secrets Manager Federal Information Processing Standard (FIPS) endpoints that are available in commercial AWS Regions and the AWS GovCloud (US) Regions.\n  With this launch, you can establish a private connection between your virtual private cloud (VPC) and Secrets Manager FIPS endpoints instead of connecting over the public internet, helping you meet your organization's business, compliance, and regulatory requirements to limit public internet connectivity.\n  To learn more about AWS Secrets Manager support for AWS PrivateLink, visit the AWS Secrets Manager documentation. For more information about AWS PrivateLink and its benefits, visit the AWS PrivateLink product page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-secrets-manager-privatelink-fips-endpoints",
      "pubDate": "2025-10-02T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "secrets manager"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "secrets manager",
        "launch",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-aebddc1b39d5",
      "title": "Amazon GameLift Servers adds ability to view and connect to instances in the console",
      "description": "Today, Amazon GameLift Servers launched new console capabilities that let you view and connect to individual fleet instances. The EC2 and Container Fleet Detail pages have a new Instances tab to see a list of instances associated with a fleet. For each instance, there is an instance details page that displays metadata in a human-readable format (data also available via Amazon GameLift Server APIs). From the list and detail views, you can invoke the connect button, open a modal, and launch AWS CloudShell to start an SSM session directly into that instance.\n  These console improvements give hands-on tools to debug, inspect, and resolve issues faster. Instead of relying on external tooling or guesswork, directly investigate host performance, pull recent game server logs, or diagnose issues such as network configuration and instance health - all from within the Amazon GameLift Servers Console. This reduces turnaround time when troubleshooting and enhances visibility into what’s happening “under the hood” of a game server fleet.\n  SSM in Console is available in Amazon GameLift Servers supported regions, except AWS China. For more information, visit the Amazon GameLift Servers documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-gamelift-servers-view-connect-instances-console",
      "pubDate": "2025-10-02T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "launch",
        "ga",
        "improvement",
        "support"
      ]
    },
    {
      "id": "aws-news-0b42074a1ad2",
      "title": "AWS Clean Rooms now supports data access budgets",
      "description": "AWS Clean Rooms now supports data access budgets for tables associated to a collaboration. This new privacy control allows you to limit the number of times your data can be analyzed when training or running inference on a custom ML model or in a SQL query or Pyspark job. With data access budgets, you can establish per-period budgets that refresh daily, weekly, or monthly, lifetime budgets for overall usage, or both types simultaneously. When you spend a budget, the system prevents additional analyses until the budget refreshes, but you can reset or edit a budget at anytime as your needs change.\n  AWS Clean Rooms helps companies and their partners easily analyze and collaborate on their collective datasets without revealing or copying one another’s underlying data. For more information about the AWS Regions where AWS Clean Rooms is available, see the AWS Regions table. To learn more about collaborating with AWS Clean Rooms, visit AWS Clean Rooms.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-clean-rooms-data-access-budgets/",
      "pubDate": "2025-10-02T07:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "support"
      ]
    },
    {
      "id": "aws-news-5e48afa2098b",
      "title": "Amazon ECS now supports one-click event capture and event history querying in the AWS Management Console",
      "description": "Amazon Elastic Container Services (Amazon ECS), a fully managed container orchestration service, now provides one-click event capture and event history querying directly in the AWS Management Console.\n  ECS lifecycle events, including service action events and task state changes, provide visibility into your ECS environment for monitoring and troubleshooting. The ECS console now enables you to set up event capture with a single click, and access an intuitive query interface without leaving the ECS console. The ECS console automatically creates and manages the underlying EventBridge rules and CloudWatch log groups, while providing pre-built query templates and filters for common troubleshooting scenarios. Event capture through the ECS console is a great way to retain data for stopped tasks and recent events beyond the default limits.\n  To enable event capture, on the ECS console, navigate to the Cluster details page, locate the Configuration tab, and click the “Turn on event capture” button. Once enabled, navigate to the Event history tab on your cluster or service details page to query and analyze historical events. The console provides commonly used query parameters such as time range, task ID, and deployment ID, along with filters for stop codes and container exit codes. You can view detailed task lifecycle events such as task state changes and service action events without needing to navigate to another console, or use query languages.\n  ECS console event capture is available in all AWS Commercial Regions and AWS GovCloud (US) Regions. To learn more, visit the ECS developer guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-ecs-one-click-event-capture-history-querying-console/",
      "pubDate": "2025-10-02T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ecs",
        "eventbridge",
        "cloudwatch"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ecs",
        "eventbridge",
        "cloudwatch",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-818272de66f3",
      "title": "AWS Parallel Computing Service (PCS) now supports node reboot via Slurm",
      "description": "AWS Parallel Computing Service (PCS) now allows you to reboot compute nodes using Slurm commands without triggering instance replacement. With this feature, you can reboot nodes for operational reasons such as troubleshooting, resource cleanup, and recovery from degraded states before requiring full node replacement, enabling you to efficiently maintain cluster health at lower costs.\n  This feature is available in all AWS Regions where PCS is available. You can use the 'scontrol reboot' command with options to schedule immediate or deferred reboots, while reboots through other methods will continue to trigger instance replacement. To learn more, refer to Rebooting compute nodes with Slurm in AWS PCS.\n  PCS is a managed service that simplifies running and scaling high performance computing (HPC) workloads on AWS using Slurm. To learn more about PCS, refer to the service documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-pcs-slurm-node-reboot/",
      "pubDate": "2025-10-02T07:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "support"
      ]
    },
    {
      "id": "aws-news-2f3bd8791ed1",
      "title": "Modernization of real-time payment orchestration on AWS",
      "description": "The global real-time payments market is experiencing significant growth. According to Fortune Business Insights, the market was valued at USD 24.91 billion in 2024 and is projected to grow to USD 284.49 billion by 2032, with a CAGR of 35.4%. Similarly, Grand View Research reports that the global mobile payment market, valued at USD 88.50 […]",
      "link": "https://aws.amazon.com/blogs/architecture/modernization-of-real-time-payment-orchestration-on-aws/",
      "pubDate": "2025-10-01T23:34:00.000Z",
      "source": "architectureBlog",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": []
    },
    {
      "id": "aws-news-6dfa064973ba",
      "title": "How Laravel Nightwatch handles billions of observability events in real time with Amazon MSK and ClickHouse Cloud",
      "description": "Laravel, one of the world’s most popular web frameworks, launched its first-party observability platform, Laravel Nightwatch, to provide developers with real-time insights into application performance. Built entirely on AWS managed services and ClickHouse Cloud, the service already processes over one billion events per day while maintaining sub-second query latency, giving developers instant visibility into the health of their applications.",
      "link": "https://aws.amazon.com/blogs/big-data/how-laravel-nightwatch-handles-billions-of-observability-events-in-real-time-with-amazon-msk-and-clickhouse-cloud/",
      "pubDate": "2025-10-01T16:59:49.000Z",
      "source": "bigDataBlog",
      "services": [
        "msk"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "msk",
        "launch"
      ]
    },
    {
      "id": "aws-news-d0093249e894",
      "title": "Application map is now generally available for Amazon CloudWatch",
      "description": "Amazon CloudWatch now helps you monitor large-scale distributed applications by automatically discovering and organizing services into groups based on configurations and their relationships. SREs and DevOps teams can identify critical dependencies and blast radius impacts to remediate issues faster. You get an always-on, out-of-the-box catalog and map that visualizes services and dependencies across AWS accounts and regions, organizing them into logical groups that align with how customers think about their systems—without manual configurations. You can also apply dynamic grouping based on how you organize applications—by teams, business units, criticality tiers, or other attributes.\n  With this new application performance monitoring (APM) capability, customers can quickly visualize which applications and dependencies to focus on while troubleshooting their distributed applications. For example, SRE and DevOps teams can now accelerate root cause analysis and reduce mean-time-to-resolution (MTTR) through high-level operational signals such as SLOs, health indicators, changes, and top observations. The application map integrates with a contextual troubleshooting drawer that surfaces relevant metrics and actionable insights to accelerate triage. When deeper investigation is needed, teams can pivot to an application-specific dashboard tailored for troubleshooting. The map, drawer, and dashboard dynamically update as new services are discovered or as customers adjust how their environments are grouped—ensuring the view is always accurate and aligned with how teams operate.\n  This new capability is now available in all AWS commercial regions where Application Signals have launched , at no additional cost. To learn more, please visit CloudWatch Application Signals documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/application-map-generally-available-amazon-cloudwatch",
      "pubDate": "2025-10-01T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "cloudwatch"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "cloudwatch",
        "launch",
        "generally-available",
        "ga",
        "now-available",
        "update",
        "new-capability"
      ]
    },
    {
      "id": "aws-news-9b53fd38560d",
      "title": "Amazon Detective now supports AWS PrivateLink for private API access",
      "description": "Amazon Detective now supports Amazon Virtual Private Cloud (VPC) endpoints via AWS PrivateLink, enabling you to securely initiate API calls to Detective from within your VPC without requiring Internet traversal. AWS PrivateLink support for Detective is available in all AWS Regions where Detective is available (see the AWS Region table). To try the new feature, you can create a VPC endpoint for Detective through the VPC console, API, or SDK. This creates an elastic network interface in your specified subnets. The interface has a private IP address that serves as an entry point for traffic destined for Detective. You can read more about Detective's integration with PrivateLink here.\n  Amazon Detective automatically collects log data from your AWS resources and uses machine learning, statistical analysis, and graph theory to build interactive visualizations that enable you to conduct faster and more efficient security investigations. Detective analyzes trillions of events from multiple data sources like Amazon Virtual Private Cloud (Amazon VPC) Flow Logs, AWS CloudTrail logs, Amazon Elastic Kubernetes Service (Amazon EKS) audit logs, and findings from multiple AWS security services to create a unified, interactive view of security events. Detective also automatically groups related findings from Amazon GuardDuty, AWS Security Hub and Amazon Inspector to show you combined threats and vulnerabilities to help security analysts identify and prioritize potential high-severity security risks.\n  To get started, see the Amazon Detective User Guide",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-detective-aws-privatelink-private-api-access",
      "pubDate": "2025-10-01T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "eks"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "eks",
        "ga",
        "new-feature",
        "integration",
        "support"
      ]
    },
    {
      "id": "aws-news-748a547fa652",
      "title": "AWS Cloud WAN is now available in AWS GovCloud (US) Regions",
      "description": "Starting today, AWS Cloud WAN is available in the AWS GovCloud (US-West) and AWS GovCloud (US-East) regions.\n  With AWS Cloud WAN, you can use a central dashboard and network policies to create a global network that spans multiple locations and networks, removing the need to configure and manage different networks using different technologies. You can use network policies to specify the Amazon Virtual Private Clouds, AWS Transit Gateways, and on-premises locations you want to connect to using an AWS Site-to-Site VPN, AWS Direct Connect, or third-party software-defined WAN (SD-WAN) products. The AWS Cloud WAN central dashboard generates a comprehensive view of the network to help you monitor network health, security, and performance. In addition, AWS Cloud WAN automatically creates a global network across AWS Regions by using Border Gateway Protocol (BGP) so that you can easily exchange routes worldwide.\n  To learn more, please visit the AWS Cloud WAN product detail page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-cloud-wan-govcloud/",
      "pubDate": "2025-10-01T07:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga",
        "now-available"
      ]
    },
    {
      "id": "aws-news-50b7f3ba2915",
      "title": "Amazon CloudWatch and OpenSearch Service expand region support for integrated analytics experience",
      "description": "Amazon CloudWatch and OpenSearch Service integrated analytics experience is now available in 5 additional commercial regions: Asia Pacific (Osaka), Asia Pacific (Seoul), Europe (Milan), Europe (Spain), and US West (N. California).\n  With this integration, CloudWatch Logs customers have two more query languages for log analytics, in addition to CloudWatch Logs Insights QL. Customers can use SQL to analyze data, correlate logs using JOIN, sub-queries, and use SQL functions, namely, JSON, mathematical, datetime, and string functions for intuitive log analytics. They can also use the OpenSearch PPL to filter, aggregate and analyze their data. With a few clicks, CloudWatch Logs customers can create OpenSearch dashboards for VPC, WAF, and CloudTrail logs to monitor, analyze, and troubleshoot using visualizations derived from the logs. OpenSearch customers no longer have to copy logs from CloudWatch for analysis, or create ETL pipelines. Now, they can use OpenSearch Discover to analyze CloudWatch logs in-place, and build indexes and dashboards on CloudWatch Logs.\n  With this launch the integrated experience is now generally available in Asia Pacific (Osaka), Asia Pacific (Seoul), Europe (Milan), Europe (Spain), and US West (N. California) along with regions where OpenSearch Service direct query is available. Please read pricing and free tier details on Amazon CloudWatch Pricing, and OpenSearch Service Pricing. To get started, please refer to Amazon CloudWatch Logs vended dashboard and Amazon OpenSearch Service Developer Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-cloudwatch-opensearch-service-region-integrated-analytics-experience/",
      "pubDate": "2025-09-30T17:42:00.000Z",
      "source": "whatsNew",
      "services": [
        "opensearch",
        "opensearch service",
        "rds",
        "cloudwatch",
        "waf"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "opensearch",
        "opensearch service",
        "rds",
        "cloudwatch",
        "waf",
        "launch",
        "generally-available",
        "ga",
        "now-available",
        "integration",
        "support"
      ]
    },
    {
      "id": "aws-news-cd6a2dff356b",
      "title": "AWS Direct Connect announces 100G expansion in Bogota, Colombia",
      "description": "Today, AWS announced the expansion of 10 Gbps and 100 Gbps dedicated connections with MACsec encryption capabilities at the existing AWS Direct Connect location in the Equinix BG1 data center near Bogota, Colombia. You can now establish private, direct network access to all public AWS Regions (except those in China), AWS GovCloud Regions, and AWS Local Zones from this location.\n  The Direct Connect service enables you to establish a private, physical network connection between AWS and your data center, office, or colocation environment. These private connections can provide a more consistent network experience than those made over the public internet. \n  For more information on the over 146 Direct Connect locations worldwide, visit the locations section of the Direct Connect product detail pages. Or, visit our getting started page to learn more about how to purchase and deploy Direct Connect.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-direct-connect-100g-expansion-bogota/",
      "pubDate": "2025-09-30T16:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "expansion"
      ]
    },
    {
      "id": "aws-news-123753e27023",
      "title": "Amazon SNS expands IPv6 support to the AWS GovCloud (US) Regions",
      "description": "Amazon Simple Notification Service (Amazon SNS) now allows customers to make API requests over Internet Protocol version 6 (IPv6) in the AWS GovCloud (US) Regions. The new endpoints have also been validated under the Federal Information Processing Standard (FIPS) 140-3 program.\n  Amazon SNS is a fully managed messaging service that enables publish/subscribe messaging between distributed systems, microservices, and event-driven serverless applications. With this update, customers have the option of using either IPv6 or IPv4 when sending requests over dual-stack public or VPC endpoints. \n  SNS now supports IPv6 in all Regions where the service is available, including AWS Commercial, AWS GovCloud (US), and China Regions. For more information on using IPv6 with Amazon SNS, please refer to our developer guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-sns-ipv6-aws-govcloud/",
      "pubDate": "2025-09-30T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "sns"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "sns",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-d13b699b979e",
      "title": "AWS Firewall Manager launches in AWS Asia Pacific (Taipei) Region",
      "description": "AWS Firewall Manager announces that it is now available in AWS Asia Pacific (Taipei) Region. AWS Firewall Manager helps cloud security administrators and site reliability engineers protect applications while reducing the operational overhead of manually configuring and managing rules.\n  Working with AWS Firewall Manager, customers can provide defense in depth policies to address the full range of AWS security services for customers hosting their applications and workloads in AWS Taipei. Customers wishing to establish secured assets using AWS WAF can create and maintain security policies with AWS Firewall Manager.\n  To learn more about how AWS Firewall Manager works, see the AWS Firewall Manager documentation for more details and the AWS Region Table for the list of regions where AWS Firewall Manager is currently available. To learn more about AWS Firewall Manager, its features, and its pricing, visit the AWS Firewall Manager website.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-firewall-manager-aws-asia-pacific-taipei-region",
      "pubDate": "2025-09-30T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "waf"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "waf",
        "launch",
        "now-available"
      ]
    },
    {
      "id": "aws-news-ed2ea5d9811c",
      "title": "Announcing Amazon ECS Managed Instances",
      "description": "Today, AWS announces the launch of Amazon Elastic Container Service (Amazon ECS) Managed Instances, a new fully managed compute option designed to eliminate infrastructure management overhead while giving you access to the full capabilities of Amazon EC2. By offloading infrastructure operations to AWS, ECS Managed Instances helps you quickly launch and scale your workloads, while enhancing performance and reducing your total cost of ownership.\n  With ECS Managed Instances, you get the application performance you want and the simplicity you need. Simply define your task requirements such as the number of vCPUs, memory size, and CPU architecture, and Amazon ECS automatically provisions, configures and operates most optimal EC2 instances within your AWS account using AWS-controlled access. You can also specify desired instance types in Managed Instances Capacity Provider configuration, including GPU-accelerated, network-optimized, and burstable performance, to run your workloads on the instance families you prefer.\n  ECS Managed Instances dynamically scales EC2 instances to match your workload requirements and continuously optimizes task placement to reduce infrastructure costs. It also enhances your security posture through regular security patching initiated every 14 days. You can use EC2 event windows to schedule patching to occur within weekly maintenance windows, minimizing the risk of interruptions during critical hours.\n  ECS Managed Instances is now available in six AWS regions: US East (North Virginia), US West (Oregon), Europe (Ireland), Africa (Cape Town), Asia Pacific (Singapore), and Asia Pacific (Tokyo). To get started with ECS Managed Instances, use the AWS Console, Amazon ECS MCP Server, or your favorite infrastructure-as-code tooling to enable it in a new or existing Amazon ECS cluster. You will be charged for the management of compute provisioned, in addition to your regular Amazon EC2 costs. To learn more about ECS Managed Instances, visit the feature page, documentation, and AWS News launch blog.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-ecs-managed-instances",
      "pubDate": "2025-09-30T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2",
        "ecs"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "ecs",
        "launch",
        "ga",
        "now-available"
      ]
    },
    {
      "id": "aws-news-374aa89e2c1a",
      "title": "AWS ParallelCluster 3.14 adds P6e-GB200 and P6-B200 instance types",
      "description": "AWS ParallelCluster 3.14 is now generally available. This release includes P6e-GB200 and P6-B200 instance types, prioritized allocation strategies for optimized instance placement, and NICE DCV support for Amazon Linux 2023. Other features included in this release are support for chef-client log visibility in instance console inside the instance's system log and Amazon Linux 2023 with kernel 6.12. To get started using P6e-GB200 instances with ParallelCluster, follow the tutorial in the ParallelCluster User Guide - Using Amazon EC2 P6e-GB200 UltraServers in AWS ParallelCluster.\n  For more details on the release, review the AWS ParallelCluster 3.14.0 release notes.\n  ParallelCluster is a fully-supported and maintained open-source cluster management tool that enables R&D customers and their IT administrators to operate high-performance computing (HPC) clusters on AWS. ParallelCluster is designed to automatically and securely provision cloud resources into elastically-scaling HPC clusters capable of running scientific and engineering workloads at scale on AWS.\n  ParallelCluster is available at no additional charge in the AWS Regions listed here, and you pay only for the AWS resources needed to run your applications. To learn more about launching HPC clusters on AWS, visit the ParallelCluster User Guide. To start using ParallelCluster, see the installation instructions for ParallelCluster UI and CLI.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-parallelcluster-p6e-p6/",
      "pubDate": "2025-09-30T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "launch",
        "generally-available",
        "support"
      ]
    },
    {
      "id": "aws-news-4fbb29739c17",
      "title": "General Availability Release of the Migration Tool for the AWS SDK for Java 2.x",
      "description": "The AWS SDK for Java 1.x (v1) entered maintenance mode on July 31, 2024, and will reach end-of-support on December 31, 2025. We recommend that you migrate to the AWS SDK for Java 2.x (v2) to access new features, enhanced performance, and continued support from AWS. To help you migrate efficiently, we’ve created a migration […]",
      "link": "https://aws.amazon.com/blogs/developer/general-availability-release-of-the-migration-tool-for-the-aws-sdk-for-java-2-x/",
      "pubDate": "2025-09-26T16:47:36.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "new-feature",
        "support"
      ]
    },
    {
      "id": "aws-news-00935d9b4cf4",
      "title": "Announcing cross-account ingestion for Amazon OpenSearch Service",
      "description": "Amazon OpenSearch Ingestion is a powerful data ingestion pipeline that AWS customers use for many different purposes, such as observability, analytics, and zero-ETL search. Many customers today push logs, traces, and metrics from their applications to OpenSearch Ingestion to store and analyze this data. Today, we are happy to announce that OpenSearch Ingestion pipelines now […]",
      "link": "https://aws.amazon.com/blogs/big-data/announcing-cross-account-ingestion-for-amazon-opensearch-service/",
      "pubDate": "2025-09-19T15:36:59.000Z",
      "source": "bigDataBlog",
      "services": [
        "opensearch",
        "opensearch service",
        "opensearch ingestion"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "opensearch",
        "opensearch service",
        "opensearch ingestion"
      ]
    },
    {
      "id": "aws-news-3a3a01883567",
      "title": "Unlock the power of Apache Iceberg v3 deletion vectors on Amazon EMR",
      "description": "As modern data architectures expand, Apache Iceberg has become a widely popular open table format, providing ACID transactions, time travel, and schema evolution. In table format v2, Iceberg introduced merge-on-read, improving delete and update handling through positional delete files. These files improve write performance but can slow down reads when not compacted, since Iceberg must […]",
      "link": "https://aws.amazon.com/blogs/big-data/unlock-the-power-of-apache-iceberg-v3-deletion-vectors-on-amazon-emr/",
      "pubDate": "2025-09-17T19:26:40.000Z",
      "source": "bigDataBlog",
      "services": [
        "emr"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "emr",
        "update"
      ]
    },
    {
      "id": "aws-news-a0c0b8431f73",
      "title": "DISA STIG for Amazon Linux 2023 is now available",
      "description": "Today, we announce the availability of a Security Technical Implementation Guide (STIG) for Amazon Linux 2023 (AL2023), developed through collaboration between Amazon Web Services (AWS) and the Defense Information Systems Agency (DISA). The STIG guidelines are important for U.S Department of Defense (DOD) and Federal customers needing strict security compliance derived from the National Institute […]",
      "link": "https://aws.amazon.com/blogs/compute/disa-stig-for-amazon-linux-2023-is-now-available/",
      "pubDate": "2025-09-10T21:15:43.000Z",
      "source": "computeBlog",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "now-available"
      ]
    },
    {
      "id": "aws-news-94928335a663",
      "title": "Accessing private Amazon API Gateway endpoints through custom Amazon CloudFront distribution using VPC Origins",
      "description": "This post demonstrates how you can connect CloudFront with a Private REST API in Amazon REST API Gateway using a VPC origin.",
      "link": "https://aws.amazon.com/blogs/compute/accessing-private-amazon-api-gateway-endpoints-through-custom-amazon-cloudfront-distribution-using-vpc-origins/",
      "pubDate": "2025-09-09T17:58:21.000Z",
      "source": "computeBlog",
      "services": [
        "cloudfront",
        "api gateway"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "cloudfront",
        "api gateway",
        "ga"
      ]
    },
    {
      "id": "aws-news-d1d1f77f887e",
      "title": "How Karrot built a feature platform on AWS, Part 1: Motivation and feature serving",
      "description": "This two-part series shows how Karrot developed a new feature platform, which consists of three main components: feature serving, a stream ingestion pipeline, and a batch ingestion pipeline. This post starts by presenting our motivation, our requirements, and the solution architecture, focusing on feature serving.",
      "link": "https://aws.amazon.com/blogs/architecture/how-karrot-built-a-feature-platform-on-aws-part-1-motivation-and-feature-serving/",
      "pubDate": "2025-08-14T15:16:29.000Z",
      "source": "architectureBlog",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "new-feature"
      ]
    },
    {
      "id": "aws-news-40ebd26fef7f",
      "title": "How Karrot built a feature platform on AWS, Part 2: Feature ingestion",
      "description": "This two-part series shows how Karrot developed a new feature platform, which consists of three main components: feature serving, a stream ingestion pipeline, and a batch ingestion pipeline. This post covers the process of collecting features in real-time and batch ingestion into an online store, and the technical approaches for stable operation.",
      "link": "https://aws.amazon.com/blogs/architecture/how-karrot-built-a-feature-platform-on-aws-part-2-feature-ingestion/",
      "pubDate": "2025-08-14T15:16:27.000Z",
      "source": "architectureBlog",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "new-feature"
      ]
    },
    {
      "id": "aws-news-f9b892079d52",
      "title": "Understanding and Remediating Cold Starts: An AWS Lambda Perspective",
      "description": "Cold starts are an important consideration when building applications on serverless platforms. In AWS Lambda, they refer to the initialization steps that occur when a function is invoked after a period of inactivity or during rapid scale-up. While typically brief and infrequent, cold starts can introduce additional latency, making it essential to understand them, especially […]",
      "link": "https://aws.amazon.com/blogs/compute/understanding-and-remediating-cold-starts-an-aws-lambda-perspective/",
      "pubDate": "2025-08-07T22:19:56.000Z",
      "source": "computeBlog",
      "services": [
        "lambda"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda"
      ]
    },
    {
      "id": "aws-news-111f04013ed3",
      "title": "Introducing v2 of Powertools for AWS Lambda (Java)",
      "description": "Modern applications increasingly rely on Serverless technologies such as Amazon Web Services (AWS) Lambda to provide scalability, cost efficiency, and agility. The Serverless Applications Lens for the AWS Well-Architected Framework focuses on how to design, deploy, and architect your Serverless applications to overcome some of these challenges. Powertools for AWS Lambda is a developer toolkit that […]",
      "link": "https://aws.amazon.com/blogs/compute/introducing-v2-of-powertools-for-aws-lambda-java/",
      "pubDate": "2025-07-31T21:45:50.000Z",
      "source": "computeBlog",
      "services": [
        "lambda"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda"
      ]
    },
    {
      "id": "aws-news-b1d270750b10",
      "title": "Streamlining AWS Serverless workflows: From AWS Lambda orchestration to AWS Step Functions",
      "description": "This blog post discusses the AWS Lambda as orchestrator anti-pattern and how to redesign serverless solutions using AWS Step Functions with native integrations.",
      "link": "https://aws.amazon.com/blogs/compute/streamlining-aws-serverless-workflows-from-aws-lambda-orchestration-to-aws-step-functions/",
      "pubDate": "2025-07-31T21:42:38.000Z",
      "source": "computeBlog",
      "services": [
        "lambda",
        "step functions"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda",
        "step functions",
        "integration"
      ]
    },
    {
      "id": "aws-news-eebb7f3e4d88",
      "title": "Implementing message prioritization with quorum queues on Amazon MQ for RabbitMQ",
      "description": "Quorum queues are now available on Amazon MQ for RabbitMQ from version 3.13. Quorum queues are a replicated First-In, First-Out (FIFO) queue type that uses the Raft consensus algorithm to maintain data consistency. Quorum queues on RabbitMQ version 3.13 lack one key feature compared to classic queues: message prioritization. However, RabbitMQ version 4.0 introduced support […]",
      "link": "https://aws.amazon.com/blogs/compute/implementing-message-prioritization-with-quorum-queues-on-amazon-mq-for-rabbitmq/",
      "pubDate": "2025-07-23T20:24:28.000Z",
      "source": "computeBlog",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-875544c87826",
      "title": "Preview Release of the AWS SDK Java 2.x HTTP Client built on Apache HttpClient 5.5.x",
      "description": "The AWS SDK for Java 2.x introduces the Apache 5 SDK HTTP client which is built on Apache HttpClient 5.5.x. This new SDK HTTP client is available alongside our existing SDK HTTP clients: Apache HttpClient 4.5.x, Netty, URL Connection, and AWS CRT HttpClient. To differentiate the use of Apache HttpClient 4.5.x and Apache HttpClient 5.5.x, […]",
      "link": "https://aws.amazon.com/blogs/developer/preview-release-of-theaws-sdk-java-2-x-http-client-built-on-apache-httpclient-5-5-x/",
      "pubDate": "2025-07-18T03:36:05.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "preview"
      ]
    },
    {
      "id": "aws-news-6606f79cd3d5",
      "title": "AWS .NET Distributed Cache Provider for Amazon DynamoDB now Generally Available",
      "description": "Today, we are excited to announce the general availability of the AWS .NET Distributed Cache Provider for Amazon DynamoDB. This is a seamless, serverless caching solution that enables .NET developers to efficiently manage their caching needs across distributed systems. Consistent caching is a difficult problem in distributed architectures, where maintaining data integrity and performance across […]",
      "link": "https://aws.amazon.com/blogs/developer/aws-net-distributed-cache-provider-for-amazon-dynamodb-now-generally-available/",
      "pubDate": "2025-07-03T13:49:25.000Z",
      "source": "developersAndDevOps",
      "services": [
        "dynamodb"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "dynamodb",
        "generally-available"
      ]
    },
    {
      "id": "aws-news-ae25b45e1a62",
      "title": "AWS Tools for PowerShell V5 now Generally Available",
      "description": "This blog was co-authored by Afroz Mohammed and Jonathan Nunn, Software Developers on the AWS PowerShell team. We’re excited to announce the general availability of the AWS Tools for PowerShell version 5, a major update that brings new features and improvements in security, along with a few breaking changes. New Features You can now cancel […]",
      "link": "https://aws.amazon.com/blogs/developer/aws-tools-for-powershell-v5-now-generally-available/",
      "pubDate": "2025-06-23T22:59:33.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "generally-available",
        "new-feature",
        "update",
        "improvement"
      ]
    },
    {
      "id": "aws-news-27b43a8f9a42",
      "title": "Deploy to ARM-Based Compute with AWS Deploy Tool for .NET",
      "description": "We’re excited to announce that the AWS Deploy Tool for .NET now supports deploying .NET applications to select ARM-based compute platforms on AWS! Whether you’re deploying from Visual Studio or using the .NET CLI, you can now target cost-effective ARM infrastructure like AWS Graviton with the same streamlined experience you’re used to. Why deploy to […]",
      "link": "https://aws.amazon.com/blogs/developer/deploy-to-arm-based-compute-with-aws-deploy-tool-for-net/",
      "pubDate": "2025-05-08T20:16:40.000Z",
      "source": "developersAndDevOps",
      "services": [
        "graviton"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "graviton",
        "support"
      ]
    },
    {
      "id": "aws-news-4d3126ea3a15",
      "title": "General Availability of AWS SDK for .NET V4.0",
      "description": "Version 4.0 of the AWS SDK for .NET has been released for general availability (GA). V4 has been in development for a little over a year in our SDK’s public GitHub repository with 13 previews being released. This new version contains performance improvements, consistency with other AWS SDKs, and bug and usability fixes that required […]",
      "link": "https://aws.amazon.com/blogs/developer/general-availability-of-aws-sdk-for-net-v4-0/",
      "pubDate": "2025-04-28T20:05:16.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "preview",
        "ga",
        "improvement"
      ]
    },
    {
      "id": "aws-news-49859f1bef68",
      "title": "Introducing the AWS IoT Device SDK for Swift (Developer Preview)",
      "description": "Today, AWS launches the developer preview of the AWS IoT Device SDK for Swift. The IoT Device SDK for Swift empowers Swift developers to create IoT applications for Linux and Apple macOS, iOS, and tvOS platforms using the MQTT 5 protocol. The SDK supports Swift 5.10+ and is designed to help developers easily integrate with […]",
      "link": "https://aws.amazon.com/blogs/developer/introducing-the-aws-iot-device-sdk-for-swift-developer-preview/",
      "pubDate": "2025-03-31T16:26:05.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "launch",
        "preview",
        "support"
      ]
    },
    {
      "id": "aws-news-dd08a704e7e9",
      "title": "Building and Debugging .NET Lambda applications with .NET Aspire (Part 2)",
      "description": "In Part 1 of our blog posts for .NET Aspire and AWS Lambda, we showed you how .NET Aspire can be used for running and debugging .NET Lambda functions. In this part, Part 2, we’ll show you how to take advantage of the .NET Aspire programming model for best practices and for connecting dependent resources […]",
      "link": "https://aws.amazon.com/blogs/developer/building-lambda-with-aspire-part-2/",
      "pubDate": "2025-03-04T17:54:04.000Z",
      "source": "developersAndDevOps",
      "services": [
        "lambda"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda"
      ]
    },
    {
      "id": "aws-news-4185fb6b40aa",
      "title": "Building and Debugging .NET Lambda applications with .NET Aspire (Part 1)",
      "description": "In a recent post we gave some background on .NET Aspire and introduced our AWS integrations with .NET Aspire that integrate AWS into the .NET dev inner loop for building applications. The integrations included how to provision application resources with AWS CloudFormation or AWS Cloud Development Kit (AWS CDK) and using Amazon DynamoDB local for […]",
      "link": "https://aws.amazon.com/blogs/developer/building-lambda-with-aspire-part-1/",
      "pubDate": "2025-03-03T21:16:42.000Z",
      "source": "developersAndDevOps",
      "services": [
        "lambda",
        "dynamodb",
        "cloudformation"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda",
        "dynamodb",
        "cloudformation",
        "ga",
        "integration"
      ]
    },
    {
      "id": "aws-news-866c6557a5ec",
      "title": "Integrating AWS with .NET Aspire",
      "description": ".NET Aspire is a new way of building cloud-ready applications. In particular, it provides an orchestration for local environments in which to run, connect, and debug the components of distributed applications. Those components can be .NET projects, databases, containers, or executables. .NET Aspire is designed to have integrations with common components used in distributed applications. […]",
      "link": "https://aws.amazon.com/blogs/developer/integrating-aws-with-net-aspire/",
      "pubDate": "2025-02-11T20:39:27.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "integration"
      ]
    },
    {
      "id": "aws-news-a6e612fd0c25",
      "title": "Preview 1 of AWS Tools for PowerShell V5",
      "description": "This blog was co-authored by Afroz Mohammed and Jonathan Nunn, Software Developers on the AWS PowerShell team. In August 2024, the AWS Tools for PowerShell team announced the upcoming release of the AWS Tools for PowerShell V5. The first preview release of V5 is now available. Preview 1 of the AWS Tools for PowerShell V5 […]",
      "link": "https://aws.amazon.com/blogs/developer/preview-1-of-aws-tools-for-powershell-v5/",
      "pubDate": "2024-11-18T16:52:04.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "preview",
        "now-available"
      ]
    }
  ]
}