{
  "lastUpdated": "2025-11-20T06:15:26.439Z",
  "category": "general",
  "totalItems": 54,
  "items": [
    {
      "id": "aws-news-5044b6bc98c4",
      "title": "Announcing the updated AWS Well-Architected Machine Learning Lens",
      "description": "We are excited to announce the updated AWS Well-Architected Machine Learning Lens, now enhanced with the latest capabilities and best practices for building machine learning (ML) workloads on AWS.",
      "link": "https://aws.amazon.com/blogs/architecture/announcing-the-updated-aws-well-architected-machine-learning-lens/",
      "pubDate": "2025-11-19T19:36:25.000Z",
      "source": "architectureBlog",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "update"
      ]
    },
    {
      "id": "aws-news-0412fb5010e7",
      "title": "Amazon Connect outbound campaigns supports ring time configuration for unanswered calls",
      "description": "Amazon Connect outbound campaigns now offers campaign managers the ability to configure how long voice calls should ring—between a range of 15 and 60 seconds—before marking a call as “no answer” and moving to the next contact. Each contact also records when ringing began and ended for precise reporting and traceability.\n  When ring duration is static, businesses struggle to balance calling efficiency and customer reach. Calls that ring too briefly may miss customers who take longer to answer, while excessive ring times delay overall campaign pacing. This lack of control leads to inconsistent contact rates and reduced agent productivity.\n  With configurable ring time, campaign managers can tune dialing behavior to their audience for each campaign, use analytics to see exactly how long each call rang, and understand where connections were missed. This visibility helps identify patterns, refine calling strategies, and continuously improve campaign effectiveness.\n  With Amazon Connect outbound campaigns, companies pay-as-they-go for campaign processing and channel usage. This feature is available in AWS regions, including US East (N. Virginia), US West (Oregon), Africa (Cape Town), Asia Pacific (Seoul), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Canada (Central), Europe (Frankfurt), and Europe (London).\n  To learn more about configuring ring time for campaigns, visit our webpage.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-connect-outbound-campaigns-ring-time-configuration",
      "pubDate": "2025-11-19T18:30:00.000Z",
      "source": "whatsNew",
      "services": [
        "rds"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "rds",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-364e7eb697ef",
      "title": "Get Invoice PDF API is now generally available.",
      "description": "Today, AWS announces the general availability of the Get Invoice PDF API, enabling customers to programmatically download AWS invoices via SDK calls.\n  Customers can retrieve individual invoice PDF artifacts by invoking API calls with AWS Invoice ID as input and receives pre-signed Amazon S3 URL for immediate download of AWS invoice and supplemental documents in PDF format. For bulk invoice retrieval, customers can first call the List Invoice Summaries API to get Invoice IDs for a specific billing period, then use the Invoice IDs as input to Get Invoice API to download each Invoice PDF artifact.\n  The Get Invoice PDF API is available in the US East (N. Virginia) Region. Customers from any commercial regions (except China Regions) can use the service. To get started with Get Invoice PDF API please visit the API Documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/get-invoice-pdf-api/",
      "pubDate": "2025-11-19T17:18:00.000Z",
      "source": "whatsNew",
      "services": [
        "s3"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "s3",
        "generally-available"
      ]
    },
    {
      "id": "aws-news-67ca4b52c1ce",
      "title": "AWS NAT Gateway now supports regional availability",
      "description": "Amazon Web Services (AWS) announces regional availability mode for NAT Gateways. With this launch, you can create a single NAT Gateway that automatically expands and contracts across availability zones (AZs) in your Virtual Private Cloud (VPC) based on your workload presence, to maintain high availability while offering simplified setup and management.\n  A NAT Gateway enables instances in a private subnet to connect to services outside your VPC using the NAT Gateway's IP address. With this launch, you can create a NAT Gateway and set its availability to regional. You do not need a public subnet to host a regional NAT Gateway. You also do not have to create and delete NAT Gateways, and edit your route tables every time your workloads expand to new availability zones. You simply create a NAT Gateway with regional mode, choose your VPC, and it automatically expands and contracts across all availability zones based on your workload's presence, maintaining high availability. You can use this feature with Amazon provided IP addresses or bring your own IP addresses.\n  \n This feature is available in all commercial AWS Regions, except for AWS GovCloud (US) Regions and China Regions via CLIs and SDKs. To learn more about VPC NAT Gateway and this feature, please visit our documentation",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/aws-nat-gateway-regional-availability",
      "pubDate": "2025-11-19T17:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "launch",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-6f8b387b8c1d",
      "title": "AWS Secrets Manager announces managed external secrets",
      "description": "Today, AWS Secrets Manager announces the launch of managed external secrets, a feature that offers default enabled automatic rotation for your third party Software-as-a-service (SaaS) secrets. You also get an option to choose from multiple different rotation strategies that are supported by your SaaS provider, without the overhead of rotation Lambda function creation, or management. With this launch, you can secure your SaaS secrets with AWS Secrets Manager with a pre-defined secret format, as prescribed by your SaaS provider.\n  This launch also includes an onboarding guide, for any SaaS provider to be listed as a partner. This would allow partners to offer their customers prescriptive guidance around managing their secrets, reducing the customer overhead for managing secrets. At launch, managed external secrets feature is available for 3 listed partners — Salesforce, BigID and Snowflake.\n  To get started with the feature, refer to the technical documentation. The feature is available in all AWS Regions where AWS Secrets Manager is available. For a list of regions where Secrets Manager is available, see the AWS Region table.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/aws-secrets-manager-managed-external-secrets",
      "pubDate": "2025-11-19T16:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lambda",
        "secrets manager"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda",
        "secrets manager",
        "launch",
        "support"
      ]
    },
    {
      "id": "aws-news-bcdbf878ead0",
      "title": "AWS Network Firewall Now Supports Managed Rules from AWS Partners available in AWS Marketplace",
      "description": "AWS Network Firewall now supports managed rules from AWS Partners, enabling you to deploy expert-curated, automatically updated security rules from AWS Partners directly within your network firewall policies. This new capability allows you to integrate pre-configured rule groups into your AWS Network Firewall with just a few clicks through the AWS Network Firewall console. Managed rules are maintained by AWS Partners who continuously update them to address emerging threats, providing comprehensive protection without the operational overhead of managing custom rules.\n  You can subscribe to managed rules from AWS Partners either from the AWS Network Firewall console, or from the AWS Marketplace website. Subscriptions to these rules will provide you the same benefits as any other product in AWS Marketplace, including consolidated billing and lower pricing for long-term contracts. You can simplify security operations by deploying specialized rule groups tailored to different industry needs, compliance requirements, and threat landscapes. This reduces the time your security teams spend researching, creating, and maintaining custom security rules, while ensuring your protections stay current against evolving threats.\n  Managed rules for AWS Network Firewall are available from AWS Marketplace sellers of Check Point, Fortinet, Infoblox, Lumen, Rapid7, ThreatSTOP, and Trend Micro, in all AWS commercial regions where AWS Network Firewall and AWS Marketplace is available.\n  To get started, visit the AWS Network Firewall console or browse available managed rules in AWS Marketplace. For more information, see the AWS Network Firewall product page and the service documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/network-firewall-managed-rules-partners-marketplace/",
      "pubDate": "2025-11-19T15:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga",
        "update",
        "support",
        "new-capability"
      ]
    },
    {
      "id": "aws-news-3419bb8392d4",
      "title": "Amazon ECS Managed Instances adds configurable scale-in delay",
      "description": "Amazon ECS Managed Instances (ECS Managed Instances) now gives you greater control over infrastructure optimization with configurable scale-in delay. This enhancement allows you to fine-tune instance management based on your specific workload patterns and business requirements, helping you better balance cost optimization with operational needs.\n  ECS Managed Instances is a fully managed compute option that automatically provisions right-sized Amazon EC2 instances based on your workload requirements. Over time, your compute resources may drift from workload requirements due to changing traffic patterns or dynamic scaling. ECS Managed Instances continuously monitors and proactively optimizes costs by terminating idle Amazon EC2 instances not running any tasks, and consolidating tasks from underutilized instances onto other, right-sized instances, provisioning new instances if required. ECS uses a heuristic based delay for scaling-in your instances to deliver a balance of high availability and cost optimization. However, your workloads or business may have unique requirements. For example, you might need to retain instances for a longer time period to accommodate incoming batch jobs and minimize instance churn. Starting today, you can set the scaleInAfter configuration parameter to up to 60 minutes to align with your specific infrastructure optimization needs. You can also set the scaleInAfter to -1 to disable infrastructure optimization workflows, which will allow your instances to run until they are patched after 14 days.\n  You can use ECS API, console, SDK, CDK, CloudFormation to configure scaleInAfter parameter when creating or updating an ECS Managed Instances capacity provider. This feature is available in all commercial AWS Regions. To learn more, review documentation and deep dive blog post.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-ecs-managed-instances-configurable-scale-in-delay",
      "pubDate": "2025-11-19T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2",
        "ecs",
        "cloudformation"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "ecs",
        "cloudformation",
        "enhancement"
      ]
    },
    {
      "id": "aws-news-adc922c420c8",
      "title": "AWS Introduces E-Invoice delivery for AWS customers using SAP Ariba and Coupa procurement portals",
      "description": "Today, AWS announces the general availability of AWS E-Invoice delivery, a new capability that enables AWS customers to connect their SAP Ariba and Coupa procurement portal accounts with AWS and retrieve POs. AWS customers can also use AWS E-Invoice delivery to deliver PO-matched AWS invoices back to their procurement portal on the same day.\n  AWS customers can now onboard to the AWS E-Invoice delivery feature through the AWS Billing and Cost Management console. After onboarding onto the AWS E-Invoice delivery feature, AWS customers can track AWS Invoice delivery status in both the AWS Billing and Cost Management console and their procurement portal. AWS E-Invoice delivery enables AWS customers to streamline the invoice processing workflow.\n  AWS E-Invoice delivery feature is generally available in all AWS Regions, excluding GovCloud (US) Regions and China (Beijing) and China (Ningxia) Regions.\n  To get started with AWS self-service invoice correction feature, please visit the user guide and blog.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/e-invoice-delivery-sap-ariba-coupa-procurement-portals/",
      "pubDate": "2025-11-19T15:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "generally-available",
        "new-capability"
      ]
    },
    {
      "id": "aws-news-e90487b2907c",
      "title": "Amazon CloudWatch now supports scheduled queries in Logs Insights",
      "description": "Amazon CloudWatch Logs now supports automatically running Logs Insights queries on a recurring schedule for your log analysis needs. With scheduled queries, you can now automate log analysis tasks and deliver query results to Amazon S3 and Amazon EventBridge.\n \nWith today's launch, you can track trends, monitor key operational metrics, and detect anomalies without needing to manually re-run queries or maintain custom automation. This feature makes it easier to maintain continuous visibility into your applications and infrastructure, streamline operational workflows, and ensure consistent insight generation at scale. For example, you can setup scheduled queries for your weekly audit reporting. The query results can also be stored in Amazon S3 for analysis, or trigger incident response workflows through Amazon EventBridge. The feature supports all CloudWatch Logs Insights query languages and helps teams improve operational efficiency by eliminating manual query executions.\n \nScheduled queries is available in US East (Ohio), US East (N. Virginia), US West (N. California), US West (Oregon), Asia Pacific (Mumbai), Asia Pacific (Osaka), Asia Pacific (Seoul), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Canada (Central), Europe (Frankfurt), Europe (Ireland), Europe (London), Europe (Paris), Europe (Stockholm), and South America (São Paulo).\n \nYou can configure a scheduled query using the Amazon CloudWatch console, AWS Command Line Interface (AWS CLI), AWS Cloud Development Kit (AWS CDK), and AWS SDKs. For more information, visit the Amazon CloudWatch documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-cloudwatch-scheduled-queries",
      "pubDate": "2025-11-19T08:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "s3",
        "eventbridge",
        "cloudwatch"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "s3",
        "eventbridge",
        "cloudwatch",
        "launch",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-848b61183c11",
      "title": "AWS Lambda announces new tenant isolation mode to simplify building tenant-aware applications",
      "description": "Today, AWS Lambda announced a new tenant isolation mode, enabling customers to isolate request processing for individual tenants or end-users invoking a Lambda function. This launch simplifies building multi-tenant applications on Lambda, such as SaaS platforms for workflow automation or code execution.\n  Customers building multi-tenant applications have strict isolation requirements when running code or processing data for individual tenants or end-users. Previously, customers met these requirements by implementing custom solutions, such as creating dedicated Lambda functions per tenant and routing requests from individual tenants to their associated functions. Today’s launch enables you to isolate request processing for each tenant invoking a Lambda function, helping you meet strict tenant isolation requirements without the need to build and operate custom solutions. This launch extends Lambda’s isolation boundary from a single function to each tenant invoking that function.\n  To use the new tenant isolation mode, customers specify a unique tenant identifier when invoking their Lambda function. Lambda uses this identifier to route invocation requests to a function’s underlying execution environments and ensures that execution environments associated with a particular tenant are never used to serve requests from other tenants invoking the function.\n  The new tenant isolation mode for AWS Lambda is available in all AWS Regions, except Asia Pacific (New Zealand), AWS GovCloud (US), and China. To learn more, visit Lambda documentation and the launch blog post. For tenant isolation mode pricing information, visit AWS Lambda Pricing.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/aws-lambda-tenant-isolation-mode",
      "pubDate": "2025-11-19T08:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lambda"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda",
        "launch"
      ]
    },
    {
      "id": "aws-news-20c85b647486",
      "title": "Streamline integration with Amazon and AWS Partner products using AWS IAM temporary delegation",
      "description": "AWS Identity and Access Management (IAM) is launching temporary delegation, a new capability that helps you accelerate onboarding and simplify management for products from Amazon and AWS Partners that integrate with your AWS accounts.\n  With today’s launch, you can safely delegate limited, temporary access to these product providers to perform initial deployments, ad-hoc maintenance, or feature upgrades on your behalf. This approach provides a more secure and streamlined experience by eliminating the need for you to create persistent IAM roles for such tasks, or perform them manually. It reduces your setup time and lowers your operational burden, while giving you complete control and auditability over delegated access and actions.\n  This feature is available in all AWS commercial Regions. Amazon products and AWS Partners such as Amazon Leo (coming soon), Archera, Aviatrix, CrowdStrike (coming soon), Databricks, HashiCorp, Qumulo, Rapid7, and SentinelOne are already implementing AWS IAM temporary delegation.\n  To get started,\n  \n \n \nCustomers: See the AWS IAM user guide or AWS blog\n \n \nAWS Partners: Refer to the partner integration guide for onboarding details",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/streamline-integration-partner-products-iam-delegation/",
      "pubDate": "2025-11-19T08:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "iam"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "iam",
        "launch",
        "ga",
        "integration",
        "coming-soon",
        "new-capability"
      ]
    },
    {
      "id": "aws-news-34f620526e42",
      "title": "Amazon CloudWatch real user monitoring (RUM) adds support for iOS and Android applications",
      "description": "Amazon CloudWatch RUM now supports iOS and Android applications, expanding real user monitoring beyond web applications. Developers and SREs can now quickly isolate mobile application issues and improve end-user experience, with visibility into performance metrics such as screen load times, crash rates, and API latencies.\n  CloudWatch RUM for mobile uses the OpenTelemetry (OTEL) standard to send spans and events. The service captures mobile spans such as application startup time, screen load time and backend network calls. It also captures events including crashes, and ANRs/AppHangs to provide rich troubleshooting insights on the CloudWatch console.\n  You can perform impact analysis for specific errors or crashes, drill down to correlated telemetry, and filter by location, device type, operating system, and app versions to quickly identify root causes. Mobile telemetry integrates with application metrics, traces, logs, web RUM monitoring, and synthetic monitoring in CloudWatch Application Signals to speed up troubleshooting and reduce application disruption.\n  CloudWatch RUM support for iOS and Android is available in all AWS Commercial Regions where web monitoring is available. To learn more, see pricing, getting started for Android and iOS, and documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/real-user-monitoring-mobile-apps-cloudwatch/",
      "pubDate": "2025-11-19T08:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "cloudwatch"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "cloudwatch",
        "support"
      ]
    },
    {
      "id": "aws-news-b598eb7f509f",
      "title": "Amazon EC2 M7i instances are now available in the Europe (Zurich) Region",
      "description": "Starting today, Amazon Elastic Compute Cloud (Amazon EC2) M7i instances powered by custom 4th Gen Intel Xeon Scalable processors (code-named Sapphire Rapids) are available in the Europe (Zurich) region. These custom processors, available only on AWS, offer up to 15% better performance over comparable x86-based Intel processors utilized by other cloud providers.\n  M7i deliver up to 15% better price-performance compared to M6i. M7i instances are a great choice for workloads that need the largest instance sizes or continuous high CPU usage, such as gaming servers, CPU-based machine learning (ML), and video-streaming. M7i offer larger instance sizes, up to 48xlarge, and two bare metal sizes (metal-24xl, metal-48xl). These bare-metal sizes support built-in Intel accelerators: Data Streaming Accelerator, In-Memory Analytics Accelerator, and QuickAssist Technology that are used to facilitate efficient offload and acceleration of data operations and optimize performance for workloads.\n  To learn more, visit Amazon EC2 M7i Instances. To get started, see the AWS Management Console.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-ec2-m7i-instances-europe-zurich-region/",
      "pubDate": "2025-11-19T08:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "ec2",
        "ga",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-88962adbab8c",
      "title": "Amazon S3 now supports post-quantum TLS key exchange on S3 endpoints",
      "description": "Amazon S3 now supports post-quantum TLS key exchange on regional S3, S3 Tables, and S3 Express One Zone endpoints providing customers with post-quantum cryptography options for encryption of their data in-transit. All regional S3, S3 Tables, and S3 Express One Zone endpoints now support Module Lattice-Based Key Encapsulation Mechanisms (ML-KEM), one of National Institute of Standards & Technology (NIST) standardized post-quantum cryptographic algorithms. Through the new PQ-TLS key exchange, Amazon S3 now supports quantum-resistant cryptography for the encryption of data in-transit. This new support combined with Amazon S3’s server-side encryption by default utilizing AES-256 algorithms offers customers quantum-resistant encryption both in-transit and at-rest.\n  Post-quantum TLS key exchange for Amazon S3 is available for all clients configured to use the ML-KEM key exchange algorithm, where you receive the benefits of the post-quantum TLS key exchange. This is because Amazon S3 will automatically negotiate the highest TLS protocol version that your client software supports.\n  Post-quantum TLS key exchange for Amazon S3 is supported at no additional cost in all regional S3, S3 Tables, and S3 Express One Zone endpoints in all AWS regions. To learn more about PQ-TLS support in Amazon S3, visit our documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/s3-post-quantum-tls-key-exchange-endpoints/",
      "pubDate": "2025-11-19T08:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "s3",
        "rds"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "s3",
        "rds",
        "support"
      ]
    },
    {
      "id": "aws-news-173a9de0191b",
      "title": "Amazon MSK Console now supports viewing Kafka topics with new public APIs",
      "description": "Amazon Managed Streaming for Apache Kafka (Amazon MSK) now supports viewing topics directly through the Amazon MSK console, making it easier to inspect all your Kafka topics without setting up Kafka admin clients. You can browse and search topics within a cluster, quickly review replication settings and partition counts, and drill into individual topics to examine detailed configuration, partition-level information, and metrics. These console capabilities are powered by three new MSK APIs, ListTopics, DescribeTopic, and DescribeTopicPartitions that you can also use directly for programmatic access. The ListTopics API returns the list of all topics in a cluster, while the DescribeTopic and DescribeTopicPartitions APIs provide detailed configuration and partition information for a topic. All three APIs are available through the AWS CLI and AWS SDKs.\n  These MSK topic viewing capabilities are available for all Amazon MSK Provisioned clusters using Kafka version 3.6 and above across AWS regions where Amazon MSK is offered. To start using these features, you'll need to set up the appropriate IAM permissions. To learn more on how to get started, see the Amazon MSK Developer Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-msk-console-kafka-topics-public-apis/",
      "pubDate": "2025-11-19T08:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "iam",
        "kafka",
        "msk"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "iam",
        "kafka",
        "msk",
        "support"
      ]
    },
    {
      "id": "aws-news-03ef1b0c959f",
      "title": "AWS Network Load Balancer simplifies deployments with support for  Weighted Target Groups",
      "description": "Network Load Balancer now supports weighted target groups, allowing you to distribute traffic across multiple target groups with configurable weights for advanced deployment strategies.\n  Weighted target groups enables key use cases like Blue-Green and Canary Deployments, Application Migration, and A/B Testing by allowing you to register multiple target groups with configurable weights ranging from 0 to 999, providing precise control over traffic distribution. Blue-Green and Canary Deployments allow you to gradually shift traffic between application versions, minimizing downtime during upgrades and patches; Application Migration enables seamless transitions from legacy stacks to new stacks without disrupting production traffic; and A/B Testing facilitates splitting incoming traffic across experimental environments. All target group types are supported, including instance, IP address, and Application Load Balancer (ALB) targets.\n  Weighted Target Groups routing is available for all existing and new Network Load Balancers across AWS commercial and AWS GovCloud (US) regions at no additional charge. Standard Network Load Balancer Capacity Unit (LCU) pricing applies.\n  To learn more, please refer to this AWS blog post, and the NLB User Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/network-load-balancer-weighted-target-groups/",
      "pubDate": "2025-11-19T08:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "experimental",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-93151d26ae63",
      "title": "Amazon GuardDuty Malware Protection for AWS Backup is now available",
      "description": "Amazon GuardDuty Malware Protection for AWS Backup is now available, extending malware detection to your Amazon EC2, Amazon EBS, and Amazon S3 backups. This capability automates malware detection in your backups without requiring additional security software or agents. You can identify your last known clean backup to minimize business disruption during recovery.\n \nMalware protection scans new backups automatically, runs on-demand scans of existing backups, and verifies backups are clean before restoration. You can enable this capability even if GuardDuty foundational data sources aren't enabled in your account. You can also use incremental scanning which analyzes only changed data between backups, reducing costs compared to rescanning full backups.\n \nAmazon GuardDuty Malware Protection for AWS Backup is available in the list of supported Regions. You can get started using the AWS Backup console, API, or CLI. To learn more, read the launch blog or visit the AWS Backup documentation and Amazon GuardDuty Malware Protection documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-guardduty-malware-protection-backup/",
      "pubDate": "2025-11-19T08:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "s3",
        "ec2"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "s3",
        "ec2",
        "launch",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-05b9bc2e3644",
      "title": "Python 3.14 runtime now available in AWS Lambda",
      "description": "AWS Lambda now supports Python 3.14 as both a managed runtime and container base image. Python is a popular language for building serverless applications. Developers can now take advantage of new features and enhancements when creating serverless applications on Lambda.",
      "link": "https://aws.amazon.com/blogs/compute/python-3-14-runtime-now-available-in-aws-lambda/",
      "pubDate": "2025-11-18T21:29:50.000Z",
      "source": "computeBlog",
      "services": [
        "lambda"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda",
        "now-available",
        "new-feature",
        "enhancement",
        "support"
      ]
    },
    {
      "id": "aws-news-a3278978d471",
      "title": "Amazon Redshift now supports Just-In-Time (JIT) ANALYZE for Apache Iceberg tables",
      "description": "Amazon Redshift today announces the general availability of Just-In-Time (JIT) ANALYZE capability for Apache Iceberg tables, enabling users to run high performance read and write analytics queries on Apache Iceberg tables within the Redshift data lake. The Apache Iceberg open table format has been used by many customers to simplify data processing on rapidly expanding and evolving tables stored in data lakes.\n  Unlike traditional data warehouses, data lakes often lack comprehensive table-level and column-level statistics about the underlying data, making it challenging for query engines to choose the most optimal query execution plans without visibility into the table and column statistics. Sub-optimal query execution plans can lead to slower and less predictable performance.\n  ‘JIT ANALYZE’ is a new Amazon Redshift feature that automatically collects and utilizes statistics for Iceberg tables during query execution, eliminating manual statistics collection while giving the query engine the information it needs to generate optimal query execution plans. The system uses intelligent heuristics to identify queries that will benefit from statistics, maintains lightweight sketch data structures, and builds high quality table-level and column-level statistics. JIT ANALYZE delivers out-of-the-box performance on par with queries that have pre-calculated statistics, while providing the foundation for many other performance optimizations.\n  The Amazon Redshift JIT ANALYZE feature for Apache Iceberg tables is now available in all AWS regions where Amazon Redshift is available. Users do not need to make any changes or enable any settings to take advantage of this new data lake query optimization. To get started, visit the documentation page for Amazon Redshift Management Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-redshift-jit-analyze-apache-iceberg-tables/",
      "pubDate": "2025-11-18T08:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "redshift"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "redshift",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-e324298598f7",
      "title": "AWS announces Supplementary Packages for Amazon Linux",
      "description": "Today, AWS announces the general availability of Supplementary Packages for Amazon Linux (SPAL), a dedicated repository that provides developers and system administrators with streamlined access to thousands of pre-built, EPEL9 packages compatible for Amazon Linux 2023 (AL2023). Amazon Linux serves as the foundation for countless applications running on AWS, but developers often face lengthy processes when building packages from source code. SPAL addresses this challenge by offering ready-to-use packages that accelerate development workflows for teams working with AL2023 environments.\n  With SPAL, development teams can significantly reduce deployment times and focus on core application development rather than package compilation. This solution is particularly valuable for DevOps engineers, system administrators, and developers who need reliable packages for production workloads without the overhead of building from source. SPAL packages are derived from the community-maintained EPEL9 project, with AWS providing security patches as they become available upstream. AWS will continue expanding the repository based on customer feedback through the Amazon Linux 2023 GitHub repository.\n  Supplementary Packages for Amazon Linux (SPAL) is available in all AWS Commercial Regions, including the AWS GovCloud (US) Regions and China.\n  To get started, review available packages in the SPAL repository and update your package management configuration to include the SPAL repository for Amazon Linux 2023. To learn more about this feature consult the SPAL FAQs or AWS Documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/supplementary-packages-amazon-linux/",
      "pubDate": "2025-11-18T08:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "update"
      ]
    },
    {
      "id": "aws-news-43c9c76b43d8",
      "title": "AWS CloudFormation accelerates dev-test cycle with early validation and simplified troubleshooting",
      "description": "AWS CloudFormation now offers capabilities that allow customers to catch deployment errors before resource provisioning begins and resolve them more efficiently. Change set creation now provides early feedback on common deployment errors. Stack events are now grouped by an operation ID with access through the new describe-operation API to accelerate analysis of deployment errors. This empowers developers to reduce deployment cycle times and cut troubleshooting time from minutes to seconds.\n  When you create a change set, CloudFormation now validates your template against three common failure causes: invalid property syntax, resource name conflict with existing resources in your account, and S3 bucket emptiness constraint on delete operations. If validation fails, the change set status shows ‘FAILED’ with a detailed status on the validation failure. You can then view details for each failure, including the property path associated with them, to pinpoint exactly where issues occur in your template. When you execute a validated change set, the deployment can still fail because of resource-specific runtime errors, such as resource limits or service-specific constraints. For troubleshooting runtime errors, every stack operation now receives a unique ID. You can zoom into the stack events for an operation and filter down to the events that caused the deployment to fail. This allows you to quickly identify root causes, reducing your troubleshooting time.\n  Get started by creating change sets through the CloudFormation Console, CLI, or SDK. View stack events by operation ID in the CloudFormation Console Events tab or via describe-events API. To learn more, visit the validate deployment and troubleshooting User Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/cloudformation-dev-test-cycle-validation-troubleshooting/",
      "pubDate": "2025-11-18T08:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "s3",
        "cloudformation"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "s3",
        "cloudformation",
        "ga"
      ]
    },
    {
      "id": "aws-news-8fc9ffdf4659",
      "title": "AWS Lambda adds support for Python 3.14",
      "description": "AWS Lambda now supports creating serverless applications using Python 3.14. Developers can use Python 3.14 as both a managed runtime and a container base image, and AWS will automatically apply updates to the managed runtime and base image as they become available.\n  Python 3.14 is the latest long-term support release of Python. This release provides Lambda customers access to the latest Python 3.14 language features. You can use Python 3.14 with Lambda@Edge (in supported Regions), allowing you to customize low-latency content delivered through Amazon CloudFront. Powertools for AWS Lambda (Python), a developer toolkit to implement serverless best practices and increase developer velocity, also supports Python 3.14. You can use the full range of AWS deployment tools, including the Lambda console, AWS CLI, AWS Serverless Application Model (AWS SAM), AWS CDK, and AWS CloudFormation to deploy and manage serverless applications written in Python 3.14.\n  The Python 3.14 runtime is available in all Regions, including the AWS GovCloud (US) Regions and China Regions.\n  For more information, including guidance on upgrading existing Lambda functions, read our blog post. For more information about AWS Lambda, visit the product page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/aws-lambda-python-314/",
      "pubDate": "2025-11-18T08:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lambda",
        "cloudformation",
        "cloudfront"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda",
        "cloudformation",
        "cloudfront",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-8d8da7028d4c",
      "title": "Safely handle configuration drift with AWS CloudFormation drift-aware change sets",
      "description": "AWS CloudFormation launches drift-aware change sets that can compare an IaC template with the actual state of infrastructure and bring drifted resources in line with their template definitions. Configuration drift occurs when infrastructure managed by IaC is modified via the AWS Management Console, SDK, or CLI. With drift-aware change sets, you can revert drift and keep infrastructure in sync with templates. Additionally, you can preview the impact of deployments on drifted resources and prevent unexpected changes.\n  Customers can modify infrastructure outside of IaC when troubleshooting operational incidents. This creates the risk of unexpected changes in future IaC deployments, impacts the security posture of infrastructure, and hampers reproducibility for testing and disaster recovery. Standard change sets can compare a template with your last-deployed template, but do not consider drift. Drift-aware change sets provide a three-way diff between a new template, last-deployed template, and actual infrastructure state. If your diff predicts unintended overwrites of drift, you can update your template values and recreate the change set. During change set execution, CloudFormation will match resource properties with template values and recreate resources deleted outside of IaC. If a provisioning error occurs, CloudFormation will restore infrastructure to its actual state before deployment.\n  To get started, create a change set for an existing stack from the CloudFormation Console and choose “Drift-aware” as the change set type. Alternatively, pass the --deployment-mode REVERT_DRIFT parameter to the CreateChangeSet API from the AWS CLI or SDK. To learn more, visit the CloudFormation User Guide.\n  Drift-aware change sets are available in AWS Regions where CloudFormation is available. Refer to the AWS Region table to learn more.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/configuration-drift-enhanced-cloudformation-sets/",
      "pubDate": "2025-11-18T08:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "cloudformation"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "cloudformation",
        "launch",
        "preview",
        "update"
      ]
    },
    {
      "id": "aws-news-30d9bfa1e464",
      "title": "Amazon Route 53 DNS Firewall adds protection against Dictionary-based DGA attacks",
      "description": "Starting today, you can enable Route 53 Resolver DNS Firewall Advanced to monitor and block queries associated with Dictionary-based Domain Generation Algorithm (DGA) attacks, that generate domain names by pseudo-randomly concatenating words from a predefined dictionary, creating human-readable strings to evade detection.\n  Route 53 DNS Firewall Advanced is an offering on Route 53 DNS Firewall that enables you to enforce protections to monitor and block your DNS traffic in real-time based on anomalies identified in the domain names being queried from your VPCs. These include protections for DNS tunneling and DGA attacks. With this launch, you can also enforce protections for Dictionary-based DGA attacks, which is a variant of the DGA attack, where domain names are generated to mimic and blend with legitimate domain names, to resist detection. To get started, you can configure one or multiple DNS Firewall Advanced rule(s), specifying Dictionary DGA as the threat to be inspected. You can add the rule(s) to a DNS Firewall rule group, and enforce it on your VPCs by associating the rule group to each desired VPC directly or by using AWS Firewall Manager, AWS Resource Access Manager (RAM), AWS CloudFormation, or Route 53 Profiles.\n  Route 53 Resolver DNS Firewall Advanced support for Dictionary DGA is available in all AWS Regions, including the AWS GovCloud (US) Regions. To learn more about the new capabilities and the pricing, visit the Route 53 Resolver DNS Firewall webpage and the Route 53 pricing page. To get started, visit the Route 53 documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-route-53-dns-firewall-protection-dictionary-dga-attacks",
      "pubDate": "2025-11-17T19:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "rds",
        "cloudformation"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "rds",
        "cloudformation",
        "launch",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-006427d2053d",
      "title": "Amazon Redshift now supports writing to Apache Iceberg tables",
      "description": "Amazon Redshift today announces the general availability of write capability to Apache Iceberg tables, enabling users to run analytics read and write queries for append-only workloads on Apache Iceberg tables within Amazon Redshift. Amazon Redshift is a petabyte-scale, enterprise-grade cloud data warehouse service used by tens of thousands of customers. Whether your data is stored in operational data stores, data lakes, streaming engines or within your data warehouse, Amazon Redshift helps you quickly ingest, securely share data, and achieve the best performance at the best price. The Apache Iceberg open table format has been used by many customers to simplify data processing on rapidly expanding and evolving tables stored in data lakes.\n  Customers have been using Amazon Redshift to run queries on data lake tables in various file and table formats, achieving a wide range of scalability across data warehouse and data lake workloads. Data lake use cases continue to evolve and become increasingly sophisticated, and require capabilities like transactional consistency for record-level updates and deletes while having seamless schema and partition evolution support. With this milestone Amazon Redshift now supports SQL DDL (data definition language) operations to CREATE an Apache Iceberg table, SHOW the table definition SQL, DROP the table and perform DML (data manipulation language) operations such as INSERT. You can continue to use Amazon Redshift to read from your Apache Iceberg tables in AWS Glue Data Catalog and perform write operations on those Apache Iceberg tables while other users or applications can safely run DML operations on your tables.\n  Apache Iceberg support in Amazon Redshift is available in all AWS regions where Amazon Redshift is available. To get started, visit the documentation page for Amazon Redshift Management Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/aws-redshift-iceberg-writes-m1",
      "pubDate": "2025-11-17T16:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "redshift",
        "glue"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "redshift",
        "glue",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-435b2d6c932f",
      "title": "Amazon WorkSpaces Applications expands the regional availability to Italy, Spain, Malaysia, and Israel",
      "description": "Amazon Web Services (AWS) has expanded the regional availability for Amazon WorkSpaces Applications. Starting today, AWS customers can deploy their applications and desktops in the AWS Europe (Milan), Europe (Spain), Asia Pacific (Malaysia), and Israel (Tel Aviv) Regions and stream them using WorkSpaces Applications. Deploying your applications in a region closer to your end users helps provide a more responsive experience. \n  Amazon WorkSpaces Applications is a fully managed, secure application streaming service that provides users with instant access to their desktop applications from anywhere. It allows users to stream applications and desktops from AWS to their devices, without requiring them to download, install, or manage any software locally. WorkSpaces Applications manages the AWS resources required to host and run your applications, scales automatically, and provides access to your users on demand.\n  To get started with Amazon WorkSpaces Applications, sign into the WorkSpaces Applications management console and select one of the AWS Region of your choice. For the full list of Regions where WorkSpaces Applications is available, see the AWS Region Table. AppStream 2.0 offers pay-as-you-go pricing. For more information, see Amazon WorkSpaces Applications Pricing.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-workspaces-applications-region-expansion",
      "pubDate": "2025-11-17T16:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": []
    },
    {
      "id": "aws-news-aa87de19901a",
      "title": "Amazon Route 53 Profiles now supports Resolver query logging configurations",
      "description": "Today, AWS announced support for Resolver query logging configurations in Amazon Route 53 Profiles, allowing you to manage Resolver query logging configuration and apply it to multiple VPCs and AWS accounts within your organization. With this enhancement, Amazon Route 53 Profiles simplifies the management of Resolver query logging by streamlining the process of associating logging configurations with VPCs, and without requiring you to manually associate them with each VPC.\n  Route 53 Profiles allows you to create and share Route 53 configurations (private hosted zones, DNS Firewall rule groups, Resolver rules) across multiple VPCs and AWS accounts. Previously, Resolver query logging required you to manually set it up for each VPC in every AWS account. Now, with Route 53 Profiles you can manage your Resolver query logging configurations for your VPCs and AWS accounts, using a single Profile configuration. Profiles support for Resolver query logging configurations reduces the management overhead for network security teams and simplifies compliance auditing by providing consistent DNS query logs across all accounts and VPCs.\n  Route 53 Profiles support for Resolver query logging is now available in the AWS Regions mentioned here. To learn more about this capability and how it can benefit your organization, visit the Amazon Route 53 documentation. You can get started by accessing the Amazon Route 53 console in your AWS Management Console or through the AWS CLI. To learn more about Route 53 Profiles pricing, see here.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-route-53-profiles-resolver-query-logging-configurations",
      "pubDate": "2025-11-17T15:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga",
        "now-available",
        "enhancement",
        "support"
      ]
    },
    {
      "id": "aws-news-6384c9461e26",
      "title": "AWS HealthImaging adds native JPEG 2000 Lossless support",
      "description": "AWS HealthImaging now offers JPEG 2000 Lossless as a transfer syntax for storing and retrieving lossless medical images. With this launch, it is simpler than ever to integrate HealthImaging with applications that require JPEG 2000 encoded DICOM data.\n  Customers can now choose between JPEG 2000 lossless and High-throughput JPEG 2000 (HTJ2K) for storing lossless DICOM data. HealthImaging data stores enabled for JPEG 2000 Lossless compression more easily integrate with legacy applications and still deliver low latency image retrieval performance from the cloud. With this launch, customers can retrieve image frames in the JPEG 2000 Lossless (1.2.840.10008.1.2.4.90) without incurring the latency of transcoding at retreival time.\n  Support for JPEG 2000 Lossless is available in all AWS Regions where AWS HealthImaging is generally available: US East (N. Virginia), US West (Oregon), Asia Pacific (Sydney), and Europe (Ireland).\n  To learn more, visit the AWS HealthImaging Developer Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/aws-healthimaging-jpeg-2000-lossless/",
      "pubDate": "2025-11-17T08:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "launch",
        "generally-available",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-d3bf9cb1a579",
      "title": "Amazon Aurora MySQL 3.11 (compatible with MySQL 8.0.43) is now generally available",
      "description": "Starting today, Amazon Aurora MySQL - Compatible Edition 3 (with MySQL 8.0 compatibility) will support MySQL 8.0.43 through Aurora MySQL v3.11.\n  In addition to several security enhancements and bug fixes, MySQL 8.0.43 contains additional errors for group replication and introduces the mysql client “commands” option, which enables or disables most mysql client commands. For more details, refer to the Aurora MySQL 3.11 and MySQL 8.0.43 release notes. To upgrade to Aurora MySQL 3.11, you can initiate a minor version upgrade manually by modifying your DB cluster, or you can enable the “Auto minor version upgrade” option when creating or modifying a DB cluster. This release is available in all AWS regions where Aurora MySQL is available.\n  Amazon Aurora is designed for unparalleled high performance and availability at global scale with full MySQL and PostgreSQL compatibility. It provides built-in security, continuous backups, serverless compute, up to 15 read replicas, automated multi-Region replication, and integrations with other Amazon Web Services services. To get started with Amazon Aurora, take a look at our getting started page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-aurora-mysql-generally-available/",
      "pubDate": "2025-11-17T08:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "generally-available",
        "enhancement",
        "integration",
        "support"
      ]
    },
    {
      "id": "aws-news-f6d483853ecf",
      "title": "Amazon VPC IPAM automates IP assignments from Infoblox IPAM",
      "description": "Today, AWS launched the ability for Amazon VPC IP Address Manager (IPAM) to automatically acquire non-overlapping IP address allocations from Infoblox Universal IPAM. This feature minimizes manual processes between cloud and on-premises administrators, reducing the turnaround time.\n  With this launch, you can automatically acquire non-overlapping IP addresses from your on-premises Infoblox Universal IPAM into your top-level AWS IPAM pool and organize them into regional pools based on your business requirements. When you acquire non-overlapping IPs, you reduce the risk of service disruptions because your IPs don’t conflict with on-premise IP addresses. Previously, in hybrid cloud environments, administrators had to use offline means such as tickets or emails to request and allocate IP addresses, which was often error-prone and time-consuming. This integration automates the manual process, improving operational efficiency.\n  This feature is available in all AWS Regions where Amazon VPC IPAM is supported, excluding AWS China Regions and AWS GovCloud (US) Regions.\n  To learn more about IPAM, view the IPAM documentation. For details on pricing, refer to the IPAM tab on the Amazon VPC Pricing Page.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-vpc-ipam-automates-ip-from-infoblox/",
      "pubDate": "2025-11-17T08:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "launch",
        "ga",
        "integration",
        "support"
      ]
    },
    {
      "id": "aws-news-c36d51e13ef0",
      "title": "Building serverless applications with Rust on AWS Lambda",
      "description": "Today, AWS Lambda is promoting Rust support from Experimental to Generally Available. This means you can now use Rust to build business-critical serverless applications, backed by AWS Support and the Lambda availability SLA.",
      "link": "https://aws.amazon.com/blogs/compute/building-serverless-applications-with-rust-on-aws-lambda/",
      "pubDate": "2025-11-14T21:38:15.000Z",
      "source": "computeBlog",
      "services": [
        "lambda"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda",
        "experimental",
        "generally-available",
        "support"
      ]
    },
    {
      "id": "aws-news-78f167df36fd",
      "title": "AWS Lambda now supports Java 25",
      "description": "You can now develop AWS Lambda functions using Java 25 either as a managed runtime or using the container base image. This blog post highlights notable Java language features, Java Lambda runtime updates, and how you can use the new Java 25 runtime in your serverless applications.",
      "link": "https://aws.amazon.com/blogs/compute/aws-lambda-now-supports-java-25/",
      "pubDate": "2025-11-14T20:51:20.000Z",
      "source": "computeBlog",
      "services": [
        "lambda"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-525a7aa26225",
      "title": "Your guide to AWS Analytics at AWS re:Invent 2025",
      "description": "It’s that time of year again — AWS re:Invent is here! At re:Invent, bold ideas come to life. Get a front-row seat to hear inspiring stories from AWS experts, customers, and leaders as they explore today’s most impactful topics, from data analytics to AI. For all the data enthusiasts and professionals, we’ve curated a comprehensive […]",
      "link": "https://aws.amazon.com/blogs/big-data/your-guide-to-aws-analytics-at-aws-reinvent-2025/",
      "pubDate": "2025-11-13T20:06:19.000Z",
      "source": "bigDataBlog",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "ga"
      ]
    },
    {
      "id": "aws-news-32e40b364aee",
      "title": "The attendee’s guide to the AWS re:Invent 2025 Compute track",
      "description": "From December 1st to December 5th, Amazon Web Services (AWS) will hold its annual premier learning event: re:Invent. There are over 2000+ learning sessions that focus on specific topics at various skill levels, and the compute team have created 76 unique sessions for you to choose. There are many sessions you can choose from, and we are here to help you choose the sessions that best fit your needs. Even if you cannot join in person, you can catch-up with many of the sessions on-demand and even watch the keynote and innovation sessions live.",
      "link": "https://aws.amazon.com/blogs/compute/the-attendees-guide-to-the-aws-reinvent-2025-compute-track/",
      "pubDate": "2025-11-12T20:58:36.000Z",
      "source": "computeBlog",
      "services": [
        "nova"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "nova"
      ]
    },
    {
      "id": "aws-news-e14e83f5b2a7",
      "title": "Amazon MSK Express brokers now support Intelligent Rebalancing for 180 times faster operation performance",
      "description": "Effective today, all new Amazon Managed Streaming for Apache Kafka (Amazon MSK) Provisioned clusters with Express brokers will support Intelligent Rebalancing at no additional cost. In this post we’ll introduce the Intelligent Rebalancing feature and show an example of how it works to improve operation performance.",
      "link": "https://aws.amazon.com/blogs/big-data/amazon-msk-express-brokers-now-support-intelligent-rebalancing-for-180-times-faster-operation-performance/",
      "pubDate": "2025-11-10T23:15:45.000Z",
      "source": "bigDataBlog",
      "services": [
        "kafka",
        "msk"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "kafka",
        "msk",
        "support"
      ]
    },
    {
      "id": "aws-news-25fb32cc6ab1",
      "title": "AWS Lambda networking over IPv6",
      "description": "This post examines the benefits of transitioning Lambda functions to IPv6, provides practical guidance for implementing dual-stack support in your Lambda environment, and considerations for maintaining compatibility with existing systems during migration.",
      "link": "https://aws.amazon.com/blogs/compute/aws-lambda-networking-over-ipv6/",
      "pubDate": "2025-11-07T22:14:31.000Z",
      "source": "computeBlog",
      "services": [
        "lambda"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda",
        "support"
      ]
    },
    {
      "id": "aws-news-084a1116597e",
      "title": "Introducing AWS Lambda event source mapping tools in the AWS Serverless MCP Server",
      "description": "Modern serverless applications increasingly rely on event-driven architectures, where AWS Lambda functions process events from various sources like Amazon Kinesis, Amazon DynamoDB Streams, Amazon Simple Queue Service (Amazon SQS), Amazon Managed Streaming for Apache Kafka (Amazon MSK), and self-managed Apache Kafka. Although event source mappings (ESM) offer a powerful mechanism for integrating AWS Lambda with […]",
      "link": "https://aws.amazon.com/blogs/compute/introducing-aws-lambda-event-source-mapping-tools-in-the-aws-serverless-mcp-server/",
      "pubDate": "2025-10-30T16:53:19.000Z",
      "source": "computeBlog",
      "services": [
        "lambda",
        "dynamodb",
        "kinesis",
        "kafka",
        "msk",
        "sqs"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda",
        "dynamodb",
        "kinesis",
        "kafka",
        "msk",
        "sqs"
      ]
    },
    {
      "id": "aws-news-062c835cf136",
      "title": "Amazon Kinesis Data Streams now supports 10x larger record sizes: Simplifying real-time data processing",
      "description": "Today, AWS announced that Amazon Kinesis Data Streams now supports record sizes up to 10MiB – a tenfold increase from the previous limit. In this post, we explore Amazon Kinesis Data Streams large record support, including key use cases, configuration of maximum record sizes, throttling considerations, and best practices for optimal performance.",
      "link": "https://aws.amazon.com/blogs/big-data/amazon-kinesis-data-streams-now-supports-10x-larger-record-sizes-simplifying-real-time-data-processing/",
      "pubDate": "2025-10-28T19:23:30.000Z",
      "source": "bigDataBlog",
      "services": [
        "kinesis"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "kinesis",
        "support"
      ]
    },
    {
      "id": "aws-news-b7276fec0ee1",
      "title": "Unlock real-time data insights with schema evolution using Amazon MSK Serverless, Iceberg, and AWS Glue streaming",
      "description": "This post showcases a solution that businesses can use to access real-time data insights without the traditional delays between data creation and analysis. By combining Amazon MSK Serverless, Debezium MySQL connector, AWS Glue streaming, and Apache Iceberg tables, the architecture captures database changes instantly and makes them immediately available for analytics through Amazon Athena. A standout feature is the system's ability to automatically adapt when database structures change—such as adding new columns—without disrupting operations or requiring manual intervention.",
      "link": "https://aws.amazon.com/blogs/big-data/unlock-real-time-data-insights-with-schema-evolution-using-amazon-msk-serverless-iceberg-and-aws-glue-streaming/",
      "pubDate": "2025-10-23T19:54:50.000Z",
      "source": "bigDataBlog",
      "services": [
        "msk",
        "glue",
        "athena"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "msk",
        "glue",
        "athena"
      ]
    },
    {
      "id": "aws-news-360e834c997a",
      "title": "BASF Digital Farming builds a STAC-based solution on Amazon EKS",
      "description": "This post was co-written with Frederic Haase and Julian Blau with BASF Digital Farming GmbH. At xarvio – BASF Digital Farming, our mission is to empower farmers around the world with cutting-edge digital agronomic decision-making tools. Central to this mission is our crop optimization platform, xarvio FIELD MANAGER, which delivers actionable insights through a range […]",
      "link": "https://aws.amazon.com/blogs/architecture/basf-digital-farming-builds-a-stac-based-solution-on-amazon-eks/",
      "pubDate": "2025-10-22T16:21:09.000Z",
      "source": "architectureBlog",
      "services": [
        "eks"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "eks"
      ]
    },
    {
      "id": "aws-news-24029d05087c",
      "title": "What’s New in the AWS Deploy Tool for .NET",
      "description": "Version 2.0 of the AWS Deploy Tool for .NET is now available. This new major version introduces several foundational upgrades to improve the deployment experience for .NET applications on AWS. The tool comes with new minimum runtime requirements. We have upgraded it to require .NET 8 because the predecessor, .NET 6, is now out of […]",
      "link": "https://aws.amazon.com/blogs/developer/whats-new-in-the-aws-deploy-tool-for-net/",
      "pubDate": "2025-10-14T13:25:42.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "now-available"
      ]
    },
    {
      "id": "aws-news-2f3bd8791ed1",
      "title": "Modernization of real-time payment orchestration on AWS",
      "description": "The global real-time payments market is experiencing significant growth. According to Fortune Business Insights, the market was valued at USD 24.91 billion in 2024 and is projected to grow to USD 284.49 billion by 2032, with a CAGR of 35.4%. Similarly, Grand View Research reports that the global mobile payment market, valued at USD 88.50 […]",
      "link": "https://aws.amazon.com/blogs/architecture/modernization-of-real-time-payment-orchestration-on-aws/",
      "pubDate": "2025-10-01T23:34:00.000Z",
      "source": "architectureBlog",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": []
    },
    {
      "id": "aws-news-4fbb29739c17",
      "title": "General Availability Release of the Migration Tool for the AWS SDK for Java 2.x",
      "description": "The AWS SDK for Java 1.x (v1) entered maintenance mode on July 31, 2024, and will reach end-of-support on December 31, 2025. We recommend that you migrate to the AWS SDK for Java 2.x (v2) to access new features, enhanced performance, and continued support from AWS. To help you migrate efficiently, we’ve created a migration […]",
      "link": "https://aws.amazon.com/blogs/developer/general-availability-release-of-the-migration-tool-for-the-aws-sdk-for-java-2-x/",
      "pubDate": "2025-09-26T16:47:36.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "new-feature",
        "support"
      ]
    },
    {
      "id": "aws-news-d1d1f77f887e",
      "title": "How Karrot built a feature platform on AWS, Part 1: Motivation and feature serving",
      "description": "This two-part series shows how Karrot developed a new feature platform, which consists of three main components: feature serving, a stream ingestion pipeline, and a batch ingestion pipeline. This post starts by presenting our motivation, our requirements, and the solution architecture, focusing on feature serving.",
      "link": "https://aws.amazon.com/blogs/architecture/how-karrot-built-a-feature-platform-on-aws-part-1-motivation-and-feature-serving/",
      "pubDate": "2025-08-14T15:16:29.000Z",
      "source": "architectureBlog",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "new-feature"
      ]
    },
    {
      "id": "aws-news-40ebd26fef7f",
      "title": "How Karrot built a feature platform on AWS, Part 2: Feature ingestion",
      "description": "This two-part series shows how Karrot developed a new feature platform, which consists of three main components: feature serving, a stream ingestion pipeline, and a batch ingestion pipeline. This post covers the process of collecting features in real-time and batch ingestion into an online store, and the technical approaches for stable operation.",
      "link": "https://aws.amazon.com/blogs/architecture/how-karrot-built-a-feature-platform-on-aws-part-2-feature-ingestion/",
      "pubDate": "2025-08-14T15:16:27.000Z",
      "source": "architectureBlog",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "new-feature"
      ]
    },
    {
      "id": "aws-news-875544c87826",
      "title": "Preview Release of the AWS SDK Java 2.x HTTP Client built on Apache HttpClient 5.5.x",
      "description": "The AWS SDK for Java 2.x introduces the Apache 5 SDK HTTP client which is built on Apache HttpClient 5.5.x. This new SDK HTTP client is available alongside our existing SDK HTTP clients: Apache HttpClient 4.5.x, Netty, URL Connection, and AWS CRT HttpClient. To differentiate the use of Apache HttpClient 4.5.x and Apache HttpClient 5.5.x, […]",
      "link": "https://aws.amazon.com/blogs/developer/preview-release-of-theaws-sdk-java-2-x-http-client-built-on-apache-httpclient-5-5-x/",
      "pubDate": "2025-07-18T03:36:05.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "preview"
      ]
    },
    {
      "id": "aws-news-6606f79cd3d5",
      "title": "AWS .NET Distributed Cache Provider for Amazon DynamoDB now Generally Available",
      "description": "Today, we are excited to announce the general availability of the AWS .NET Distributed Cache Provider for Amazon DynamoDB. This is a seamless, serverless caching solution that enables .NET developers to efficiently manage their caching needs across distributed systems. Consistent caching is a difficult problem in distributed architectures, where maintaining data integrity and performance across […]",
      "link": "https://aws.amazon.com/blogs/developer/aws-net-distributed-cache-provider-for-amazon-dynamodb-now-generally-available/",
      "pubDate": "2025-07-03T13:49:25.000Z",
      "source": "developersAndDevOps",
      "services": [
        "dynamodb"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "dynamodb",
        "generally-available"
      ]
    },
    {
      "id": "aws-news-ae25b45e1a62",
      "title": "AWS Tools for PowerShell V5 now Generally Available",
      "description": "This blog was co-authored by Afroz Mohammed and Jonathan Nunn, Software Developers on the AWS PowerShell team. We’re excited to announce the general availability of the AWS Tools for PowerShell version 5, a major update that brings new features and improvements in security, along with a few breaking changes. New Features You can now cancel […]",
      "link": "https://aws.amazon.com/blogs/developer/aws-tools-for-powershell-v5-now-generally-available/",
      "pubDate": "2025-06-23T22:59:33.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "generally-available",
        "new-feature",
        "update",
        "improvement"
      ]
    },
    {
      "id": "aws-news-27b43a8f9a42",
      "title": "Deploy to ARM-Based Compute with AWS Deploy Tool for .NET",
      "description": "We’re excited to announce that the AWS Deploy Tool for .NET now supports deploying .NET applications to select ARM-based compute platforms on AWS! Whether you’re deploying from Visual Studio or using the .NET CLI, you can now target cost-effective ARM infrastructure like AWS Graviton with the same streamlined experience you’re used to. Why deploy to […]",
      "link": "https://aws.amazon.com/blogs/developer/deploy-to-arm-based-compute-with-aws-deploy-tool-for-net/",
      "pubDate": "2025-05-08T20:16:40.000Z",
      "source": "developersAndDevOps",
      "services": [
        "graviton"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "graviton",
        "support"
      ]
    },
    {
      "id": "aws-news-4d3126ea3a15",
      "title": "General Availability of AWS SDK for .NET V4.0",
      "description": "Version 4.0 of the AWS SDK for .NET has been released for general availability (GA). V4 has been in development for a little over a year in our SDK’s public GitHub repository with 13 previews being released. This new version contains performance improvements, consistency with other AWS SDKs, and bug and usability fixes that required […]",
      "link": "https://aws.amazon.com/blogs/developer/general-availability-of-aws-sdk-for-net-v4-0/",
      "pubDate": "2025-04-28T20:05:16.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "preview",
        "ga",
        "improvement"
      ]
    },
    {
      "id": "aws-news-49859f1bef68",
      "title": "Introducing the AWS IoT Device SDK for Swift (Developer Preview)",
      "description": "Today, AWS launches the developer preview of the AWS IoT Device SDK for Swift. The IoT Device SDK for Swift empowers Swift developers to create IoT applications for Linux and Apple macOS, iOS, and tvOS platforms using the MQTT 5 protocol. The SDK supports Swift 5.10+ and is designed to help developers easily integrate with […]",
      "link": "https://aws.amazon.com/blogs/developer/introducing-the-aws-iot-device-sdk-for-swift-developer-preview/",
      "pubDate": "2025-03-31T16:26:05.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "launch",
        "preview",
        "support"
      ]
    },
    {
      "id": "aws-news-dd08a704e7e9",
      "title": "Building and Debugging .NET Lambda applications with .NET Aspire (Part 2)",
      "description": "In Part 1 of our blog posts for .NET Aspire and AWS Lambda, we showed you how .NET Aspire can be used for running and debugging .NET Lambda functions. In this part, Part 2, we’ll show you how to take advantage of the .NET Aspire programming model for best practices and for connecting dependent resources […]",
      "link": "https://aws.amazon.com/blogs/developer/building-lambda-with-aspire-part-2/",
      "pubDate": "2025-03-04T17:54:04.000Z",
      "source": "developersAndDevOps",
      "services": [
        "lambda"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda"
      ]
    },
    {
      "id": "aws-news-4185fb6b40aa",
      "title": "Building and Debugging .NET Lambda applications with .NET Aspire (Part 1)",
      "description": "In a recent post we gave some background on .NET Aspire and introduced our AWS integrations with .NET Aspire that integrate AWS into the .NET dev inner loop for building applications. The integrations included how to provision application resources with AWS CloudFormation or AWS Cloud Development Kit (AWS CDK) and using Amazon DynamoDB local for […]",
      "link": "https://aws.amazon.com/blogs/developer/building-lambda-with-aspire-part-1/",
      "pubDate": "2025-03-03T21:16:42.000Z",
      "source": "developersAndDevOps",
      "services": [
        "lambda",
        "dynamodb",
        "cloudformation"
      ],
      "categories": [
        "general"
      ],
      "tags": [
        "lambda",
        "dynamodb",
        "cloudformation",
        "ga",
        "integration"
      ]
    },
    {
      "id": "aws-news-866c6557a5ec",
      "title": "Integrating AWS with .NET Aspire",
      "description": ".NET Aspire is a new way of building cloud-ready applications. In particular, it provides an orchestration for local environments in which to run, connect, and debug the components of distributed applications. Those components can be .NET projects, databases, containers, or executables. .NET Aspire is designed to have integrations with common components used in distributed applications. […]",
      "link": "https://aws.amazon.com/blogs/developer/integrating-aws-with-net-aspire/",
      "pubDate": "2025-02-11T20:39:27.000Z",
      "source": "developersAndDevOps",
      "services": [],
      "categories": [
        "general"
      ],
      "tags": [
        "integration"
      ]
    }
  ]
}