{
  "lastUpdated": "2026-02-07T06:27:51.111Z",
  "category": "industry-cases",
  "totalItems": 18,
  "items": [
    {
      "id": "aws-news-acb6f4f76a9c",
      "title": "Building fault-tolerant applications with AWS Lambda durable functions",
      "description": "Business applications often coordinate multiple steps that need to run reliably or wait for extended periods, such as customer onboarding, payment processing, or orchestrating large language model inference. These critical processes require completion despite temporary disruptions or system failures. Developers currently spend significant time implementing mechanisms to track progress, handle failures, and manage resources when […]",
      "link": "https://aws.amazon.com/blogs/compute/building-fault-tolerant-long-running-application-with-aws-lambda-durable-functions/",
      "pubDate": "2026-02-06T16:54:39.000Z",
      "source": "computeBlog",
      "services": [
        "lambda"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "lambda"
      ]
    },
    {
      "id": "aws-news-579c56d79c87",
      "title": "Mastering millisecond latency and millions of events: The event-driven architecture behind the Amazon Key Suite",
      "description": "In this post, we explore how the Amazon Key team used Amazon EventBridge to modernize their architecture, transforming a tightly coupled monolithic system into a resilient, event-driven solution. We explore the technical challenges we faced, our implementation approach, and the architectural patterns that helped us achieve improved reliability and scalability. The post covers our solutions for managing event schemas at scale, handling multiple service integrations efficiently, and building an extensible architecture that accommodates future growth.",
      "link": "https://aws.amazon.com/blogs/architecture/mastering-millisecond-latency-and-millions-of-events-the-event-driven-architecture-behind-the-amazon-key-suite/",
      "pubDate": "2026-02-04T15:53:39.000Z",
      "source": "architectureBlog",
      "services": [
        "eventbridge"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "eventbridge",
        "integration"
      ]
    },
    {
      "id": "aws-news-b7988a0ad294",
      "title": "Use Amazon MSK Connect and Iceberg Kafka Connect to build a real-time data lake",
      "description": "In this post, we demonstrate how to use Iceberg Kafka Connect with Amazon Managed Streaming for Apache Kafka (Amazon MSK) Connect to accelerate real-time data ingestion into data lakes, simplifying the synchronization process from transactional databases to Apache Iceberg tables.",
      "link": "https://aws.amazon.com/blogs/big-data/use-amazon-msk-connect-and-iceberg-kafka-connect-to-build-a-real-time-data-lake/",
      "pubDate": "2026-02-03T18:42:38.000Z",
      "source": "bigDataBlog",
      "services": [
        "kafka",
        "msk"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "kafka",
        "msk"
      ]
    },
    {
      "id": "aws-news-827f71faba2a",
      "title": "AWS Management Console now displays Account Name on the Navigation bar for easier account identification",
      "description": "Today, AWS announces the general availability of displaying account name in AWS Management Console across all Public Regions. AWS customers now have an easy way to identify their accounts at a glance. Users can now quickly distinguish between accounts visually using the account name that appears in the navigation bar for all authorized users in that account.\n  AWS customers manage multiple accounts to separate their workloads, such as maintaining distinct accounts for development and production environments or for different business units. Previously, users had to rely on account numbers to identify accounts. With this new feature, all authorized users can quickly identify the account using its name on the navigation bar.\n  The account name display feature is available at no additional cost in all public AWS Regions. To get started, make sure your administrator has enabled the feature (visit our managed policy documentation) and sign in to AWS Management Console.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/02/console-displays-account-name-on-nav-bar",
      "pubDate": "2026-02-03T17:18:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "ga",
        "new-feature"
      ]
    },
    {
      "id": "aws-news-8e05d89e5343",
      "title": "Amazon Connect now provides APIs to test and simulate voice interactions",
      "description": "Amazon Connect now offers APIs to configure and run tests that simulate contact center experiences, making it easy to validate workflows, self-service voice interactions, and their outcomes. With these APIs, you can programmatically configure test parameters, including the caller's phone number or customer profile, the reason for the call (such as \"I need to check my order status\"), the expected responses (such as \"Your request has been processed\"), and business conditions like after-hours scenarios or full call queues. With this launch, you can also integrate testing directly into CI/CD pipelines, run multiple tests simultaneously to validate workflows at scale, and enable automated regression testing as part of your deployment cycles. These capabilities allow you to rapidly validate changes to your workflows and confidently deploy new customer experiences to production.\n \nTo learn more about these features, see the Amazon Connect API Reference and Amazon Connect Administrator Guide. These features are available in Asia Pacific (Mumbai), Africa (Cape Town), Europe (Frankfurt), US East (N. Virginia), Asia Pacific (Seoul), Europe (London), Asia Pacific (Tokyo), US West (Oregon), Asia Pacific (Singapore), Asia Pacific (Sydney), and Canada (Central) regions. To learn more about Amazon Connect, AWS’s AI-native customer experience solution, please visit the Amazon Connect website.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/02/amazon-connect-provides-apis-test-simulate-voice-interactions/",
      "pubDate": "2026-02-02T16:30:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "launch",
        "ga"
      ]
    },
    {
      "id": "aws-news-0aaa039509ca",
      "title": "How Tipico democratized data transformations using Amazon Managed Workflows for Apache Airflow and AWS Batch",
      "description": "Tipico is the number one name in sports betting in Germany. Every day, we connect millions of fans to the thrill of sport, combining technology, passion, and trust to deliver fast, secure, and exciting betting, both online and in more than a thousand retail shops across Germany. We also bring this experience to Austria, where we proudly operate a strong sports betting business. In this post, we show how Tipico built a unified data transformation platform using Amazon Managed Workflows for Apache Airflow (Amazon MWAA) and AWS Batch.",
      "link": "https://aws.amazon.com/blogs/big-data/how-tipico-democratized-data-transformations-using-amazon-managed-workflows-for-apache-airflow-and-aws-batch/",
      "pubDate": "2026-01-28T17:56:00.000Z",
      "source": "bigDataBlog",
      "services": [],
      "categories": [
        "industry-cases"
      ],
      "tags": []
    },
    {
      "id": "aws-news-f48d83d195f1",
      "title": "AWS Marketplace expands AMI self-service listing experience to FPGA products",
      "description": "AWS Marketplace now offers a self-service listing experience for sellers listing Amazon Machine Image (AMI) products with FPGA (Field Programmable Gate Array) images. This new capability eliminates the previous dependency on manual Product Load Forms and accelerates time-to-market for AWS partners that offer specialized hardware accelerators using FPGA technology on supported Amazon F2 instance types.\n  With this launch, sellers can now create and manage AMIs with Amazon FPGA images using a new UI experience or programmatically through the AWS Marketplace Catalog API. During listing creation, sellers are guided through a step-by-step workflow to fill in required information about their listings including up to 15 Amazon FPGA images. The self-service experience includes comprehensive inline validation and error messages to help sellers identify and resolve configuration issues before submission, streamlining the publishing process and improving speed to market.\n  To learn more, see the AWS Marketplace Seller Guide and the AWS Marketplace Catalog API guide. To get started, visit the server product page in the AWS Marketplace Management Portal.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/aws-marketplace-expands-ami-self-service-listing-experience-to-fpga-products",
      "pubDate": "2026-01-27T17:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "launch",
        "ga",
        "support",
        "new-capability"
      ]
    },
    {
      "id": "aws-news-16e8e2f0eae6",
      "title": "Access a VPC-hosted Amazon OpenSearch Service domain with SAML authentication using AWS Client VPN",
      "description": "In this post, we explore different OpenSearch Service authentication methods and network topology considerations. Then we show how to build an architecture to access an OpenSearch Service domain hosted in a VPC using AWS Client VPN, AWS Transit Gateway, and AWS IAM Identity Center.",
      "link": "https://aws.amazon.com/blogs/big-data/access-a-vpc-hosted-amazon-opensearch-service-domain-with-saml-authentication-using-aws-client-vpn/",
      "pubDate": "2026-01-26T17:43:20.000Z",
      "source": "bigDataBlog",
      "services": [
        "opensearch",
        "opensearch service",
        "iam",
        "iam identity center"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "opensearch",
        "opensearch service",
        "iam",
        "iam identity center",
        "ga"
      ]
    },
    {
      "id": "aws-news-90e88878ff7b",
      "title": "Enable strategic data quality management with AWS Glue DQDL labels",
      "description": "AWS Glue DQDL labels add organizational context to data quality management by attaching business metadata directly to validation rules. In this post, we highlight the new DQDL labels feature, which enhances how you organize, prioritize, and operationalize your data quality efforts at scale. We show how labels such as business criticality, compliance requirements, team ownership, or data domain can be attached to data quality rules to streamline triage and analysis. You’ll learn how to quickly surface targeted insights (for example, “all high-priority customer data failures owned by marketing” or “GDPR-related issues from our Salesforce ingestion pipeline”) and how DQDL labels can help teams improve accountability and accelerate remediation workflows.",
      "link": "https://aws.amazon.com/blogs/big-data/enable-strategic-data-quality-management-with-aws-glue-dqdl-labels/",
      "pubDate": "2026-01-26T17:42:05.000Z",
      "source": "bigDataBlog",
      "services": [
        "glue"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "glue",
        "ga"
      ]
    },
    {
      "id": "aws-news-5c0694c5d05a",
      "title": "Apache Spark 4.0.1 preview now available on Amazon EMR Serverless",
      "description": "In this post, we explore key benefits, technical capabilities, and considerations for getting started with Spark 4.0.1 on Amazon EMR Serverless. With the emr-spark-8.0-preview release label, you can evaluate new SQL capabilities, Python API improvements, and streaming enhancements in your existing EMR Serverless environment.",
      "link": "https://aws.amazon.com/blogs/big-data/apache-spark-4-0-1-preview-now-available-on-amazon-emr-serverless/",
      "pubDate": "2026-01-26T17:38:46.000Z",
      "source": "bigDataBlog",
      "services": [
        "emr"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "emr",
        "preview",
        "now-available",
        "improvement",
        "enhancement"
      ]
    },
    {
      "id": "aws-news-70344a320bd4",
      "title": "EC2 Auto Scaling Introduces New Mechanisms for Group Deletion Protection",
      "description": "EC2 Auto Scaling is introducing a new policy condition key autoscaling:ForceDelete. This condition key is used with the DeleteAutoScalingGroup action to control whether the ForceDelete parameter can be used during deletion, which determines if an Auto Scaling group (ASG) can be deleted while it still contains running instances. You can use this condition key in IAM policies to restrict deletion permissions. This provides a safety measure to prevent accidental deletion of ASGs that still have running instances.\n  Furthermore, EC2 Auto Scaling now offers deletion protection at the group level. The new deletion-protection configuration can be set either when you create your ASGs or update them. This new feature lets you set enhanced controls based on your workload's criticality, with multiple protection levels available to safeguard against accidental deletions and help maintain application availability.\n  Combining the autoscaling:ForceDelete condition key with deletion protection at the group level provides a layered defense against unwanted ASG termination by allowing you to both restrict IAM permissions for force-delete operations and set enhanced protection controls directly on critical ASGs.\n  The features now available in all AWS Regions and AWS GovCloud (US) Regions. To get started, visit the EC2 Auto Scaling console or refer to our technical documentation for deletion protection and policy condition keys for Amazon EC2 Auto Scaling.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/ec2-auto-scaling-new-mechanisms-group-deletion-protection",
      "pubDate": "2026-01-23T19:09:00.000Z",
      "source": "whatsNew",
      "services": [
        "ec2",
        "iam"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "ec2",
        "iam",
        "ga",
        "now-available",
        "new-feature",
        "update"
      ]
    },
    {
      "id": "aws-news-d4f8f488d569",
      "title": "Amazon Connect adds conditional logic and real-time updates to Step-by-Step Guides",
      "description": "Amazon Connect Step-by-Step Guides now enables managers to build more dynamic and responsive guided experiences. Managers can create conditional user interfaces that adapt based on user interactions, making workflows more efficient. For example, managers can configure dropdown menus to show or hide fields, change default values, or adjust required fields based on the input in prior fields, creating tailored experiences for different scenarios.\n  In addition, Step-by-Step Guides can now automatically refresh data from Connect resources such as flow modules at specified intervals, ensuring agents always work with the most current information.\n  Amazon Connect Step-by-Step Guides is available in the following AWS regions: US East (N. Virginia), US West (Oregon), Canada (Central), Africa (Cape Town), Asia Pacific (Seoul), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Europe (Frankfurt), Europe (London), and the AWS GovCloud (US-West) Region. To learn more and get started, visit the Amazon Connect webpage and documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-connect-conditional-logic-real-time-updates-step-by-step-guides/",
      "pubDate": "2026-01-23T13:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "ga",
        "update"
      ]
    },
    {
      "id": "aws-news-c1c2c60376fd",
      "title": "Modernize your data warehouse by migrating Oracle Database to Amazon Redshift with Oracle GoldenGate",
      "description": "In this post, we show how to migrate an Oracle data warehouse to Amazon Redshift using Oracle GoldenGate and DMS Schema Conversion, a feature of AWS Database Migration Service (AWS DMS). This approach facilitates minimal business disruption through continuous replication.",
      "link": "https://aws.amazon.com/blogs/big-data/modernize-your-data-warehouse-by-migrating-oracle-database-to-amazon-redshift-with-oracle-goldengate/",
      "pubDate": "2026-01-22T17:28:29.000Z",
      "source": "bigDataBlog",
      "services": [
        "redshift"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "redshift",
        "ga"
      ]
    },
    {
      "id": "aws-news-30581ecb3d79",
      "title": "How BASF’s Agriculture Solutions drives traceability and climate action by tokenizing cotton value chains using Amazon Managed Blockchain",
      "description": "BASF Agricultural Solutions combines innovative products and digital tools with practical farmer knowledge. This post explores how Amazon Managed Blockchain can drive a positive change in the agricultural industry by tokenizing food and cotton value chains for traceability, climate action, and circularity.",
      "link": "https://aws.amazon.com/blogs/architecture/how-basfs-agriculture-solutions-drives-traceability-and-climate-action-by-tokenizing-cotton-value-chains-using-amazon-managed-blockchain/",
      "pubDate": "2025-12-10T17:41:52.000Z",
      "source": "architectureBlog",
      "services": [
        "nova"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "nova"
      ]
    },
    {
      "id": "aws-news-c8a3488015cc",
      "title": "AWS SDK for JavaScript aligns with Node.js release schedule",
      "description": "This post is about AWS SDK for JavaScript v3 announcing end of support for Node.js versions based on Node.js release schedule, and it is not about AWS Lambda. For the latter, refer to the Lambda runtime deprecation policy. In the second week of January 2026, the AWS SDK for JavaScript v3 (JS SDK) will start […]",
      "link": "https://aws.amazon.com/blogs/developer/aws-sdk-for-javascript-aligns-with-node-js-release-schedule/",
      "pubDate": "2025-12-08T17:32:10.000Z",
      "source": "developersAndDevOps",
      "services": [
        "lambda"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "lambda",
        "support"
      ]
    },
    {
      "id": "aws-news-f8633d530b1e",
      "title": "She architects: Bringing unique perspectives to innovative solutions at AWS",
      "description": "Have you ever wondered what it is really like to be a woman in tech at one of the world's leading cloud companies? Or maybe you are curious about how diverse perspectives drive innovation beyond the buzzwords? Today, we are providing an insider's perspective on the role of a solutions architect (SA) at Amazon Web Services (AWS). However, this is not a typical corporate success story. We are three women who have navigated challenges, celebrated wins, and found our unique paths in the world of cloud architecture, and we want to share our real stories with you.",
      "link": "https://aws.amazon.com/blogs/architecture/she-architects-bringing-unique-perspectives-to-innovative-solutions-at-aws/",
      "pubDate": "2025-12-08T16:37:15.000Z",
      "source": "architectureBlog",
      "services": [
        "nova",
        "rds"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "nova",
        "rds",
        "ga"
      ]
    },
    {
      "id": "aws-news-1c031b337189",
      "title": "Secure Amazon Elastic VMware Service (Amazon EVS) with AWS Network Firewall",
      "description": "In this post, we demonstrate how to utilize AWS Network Firewall to secure an Amazon EVS environment, using a centralized inspection architecture across an EVS cluster, VPCs, on-premises data centers and the internet. We walk through the implementation steps to deploy this architecture using AWS Network Firewall and AWS Transit Gateway.",
      "link": "https://aws.amazon.com/blogs/architecture/secure-amazon-elastic-vmware-service-amazon-evs-with-aws-network-firewall/",
      "pubDate": "2025-11-26T16:22:03.000Z",
      "source": "architectureBlog",
      "services": [],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "ga"
      ]
    },
    {
      "id": "aws-news-b04be71f4d69",
      "title": "Improve API discoverability with the new Amazon API Gateway Portal",
      "description": "In this post, we will show how you can use the new portal feature to create customizable portals with enhanced security features in minutes, with APIs from multiple accounts, without managing any infrastructure.",
      "link": "https://aws.amazon.com/blogs/compute/improve-api-discoverability-with-the-new-amazon-api-gateway-portal/",
      "pubDate": "2025-11-20T00:41:25.000Z",
      "source": "computeBlog",
      "services": [
        "api gateway"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "api gateway",
        "ga"
      ]
    }
  ]
}