{
  "lastUpdated": "2025-10-21T06:15:44.154Z",
  "category": "industry-cases",
  "totalItems": 20,
  "items": [
    {
      "id": "aws-news-37dcae1b25ff",
      "title": "Beyond vibes: How to properly select the right LLM for the right task",
      "description": "In this post, we discuss an approach that can guide you to build comprehensive and empirically driven evaluations that can help you make better decisions when selecting the right model for your task.",
      "link": "https://aws.amazon.com/blogs/machine-learning/beyond-vibes-how-to-properly-select-the-right-llm-for-the-right-task/",
      "pubDate": "2025-10-17T16:09:22.000Z",
      "source": "mlBlog",
      "services": [],
      "categories": [
        "industry-cases"
      ],
      "tags": []
    },
    {
      "id": "aws-news-11031ecd9926",
      "title": "Zero downtime blue/green deployments with Amazon API Gateway",
      "description": "In this post, you learn how to implement blue/green deployments by using Amazon API Gateway for your APIs. For this post, we use AWS Lambda functions on the backend. However, you can follow the same strategy for other backend implementations of the APIs. All the required infrastructure is deployed by using AWS Serverless Application Model (AWS SAM).",
      "link": "https://aws.amazon.com/blogs/compute/zero-downtime-blue-green-deployments-with-amazon-api-gateway/",
      "pubDate": "2025-10-16T19:01:22.000Z",
      "source": "computeBlog",
      "services": [
        "lambda",
        "api gateway"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "lambda",
        "api gateway",
        "ga"
      ]
    },
    {
      "id": "aws-news-6f31d6a0a58c",
      "title": "Amazon ECS supports running Firelens as a non-root user",
      "description": "Amazon Elastic Container Services (Amazon ECS) now allows you to run Firelens containers as a non-root user, by specifying a User ID in your Task Definition.\n  Specifying a non-root user with a specific user ID reduces the potential attack footprint by users who may gain access to such software, a security best practice and a compliance requirement by some industries and security services such as the AWS Security Hub. With this release, Amazon ECS allows you to specify a user ID in the \"user\" field of your Firelens containerDefinition element of your Task Definition, instead of only allowing \"user\": \"0\" (root user).\n  The new capability is supported in all AWS Regions. See the documentation for using Firelens for more details on how to set up your Firelens container to run as non-root.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-ecs-running-firelens-as-nonroot-user/",
      "pubDate": "2025-10-15T12:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "ecs"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "ecs",
        "ga",
        "support",
        "new-capability"
      ]
    },
    {
      "id": "aws-news-b4f91e644bb4",
      "title": "Announcing AWS for Fluent Bit 3.0.0 based on Fluent Bit 4.1.0",
      "description": "AWS for Fluent Bit announces version 3.0.0, based on Fluent Bit version 4.1.0 and Amazon Linux 2023. Container logging using AWS for Fluent Bit is now more performant and more feature-rich for AWS customers, including those using Amazon Elastic Container Services (Amazon ECS) and Amazon Elastic Kubernetes Service (Amazon EKS).\n  AWS for Fluent Bit enables Amazon ECS and Amazon EKS customers to collect, process, and route container logs to destinations including Amazon CloudWatch Logs, Amazon Data Firehose, Amazon Kinesis Data Streams, and Amazon S3 without changing application code. AWS for Fluent Bit 3.0.0 upgrades the Fluent Bit version to 4.1.0, and upgrades the base image to Amazon Linux 2023. These updates deliver access to the latest Fluent Bit features, significant performance improvements, and enhanced security. New features include native OpenTelemetry (OTel) support for ingesting and forwarding OTLP logs, metrics, and traces with AWS SigV4 authentication—eliminating the need for additional sidecars. Performance improvements include faster JSON parsing, processing more logs per vCPU with lower latency. Security enhancements include TLS min version and cipher controls, which enforce your TLS policy on outputs from AWS for Fluent Bit for stronger protocol posture.\n  You can use AWS for Fluent Bit 3.0.0 on both ECS and EKS. On ECS, update the FireLens log-router container image in your task definition to the 3.0.0 tag from the Amazon ECR Public Gallery. On EKS, upgrade by either updating the Helm release or setting the DaemonSet image to the 3.0.0 version.\n  The AWS for Fluent Bit image is available in the Amazon ECR Public Gallery and in the Amazon ECR repository. You can also find it on GitHub for source code and additional guidance.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-fluent-bit-3-0-0-based-4-1-0",
      "pubDate": "2025-10-14T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "s3",
        "ecs",
        "eks",
        "kinesis",
        "cloudwatch"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "s3",
        "ecs",
        "eks",
        "kinesis",
        "cloudwatch",
        "ga",
        "new-feature",
        "update",
        "improvement",
        "enhancement",
        "support"
      ]
    },
    {
      "id": "aws-news-cae6860b9f30",
      "title": "Transforming the physical world with AI: the next frontier in intelligent automation",
      "description": "In this post, we explore how Physical AI represents the next frontier in intelligent automation, where artificial intelligence transcends digital boundaries to perceive, understand, and manipulate the tangible world around us.",
      "link": "https://aws.amazon.com/blogs/machine-learning/transforming-the-physical-world-with-ai-the-next-frontier-in-intelligent-automation/",
      "pubDate": "2025-10-13T22:21:26.000Z",
      "source": "mlBlog",
      "services": [],
      "categories": [
        "industry-cases"
      ],
      "tags": []
    },
    {
      "id": "aws-news-b5fee32efb6d",
      "title": "Amazon Location Service Updates for Vietnam's New Administrative Boundaries",
      "description": "Amazon Location Service has updated its mapping data to reflect Vietnam's recent administrative reorganization, which consolidated the country's provinces from 63 to 34 administrative units. This update enables customers in Vietnam to seamlessly align their operations with the new administrative structure that took effect July 1, 2025.\n  The update includes changes to Vietnam's administrative boundaries, names, and hierarchical structure across all levels. The refresh incorporates the new structure of 34 provincial-level administrative units, consisting of 28 provinces and 6 centrally managed cities, along with consolidated commune-level administrative boundaries from 10,310 to 3,321 units. Place names and administrative components in Points of Interest (POI) have been updated while preserving street-level address accuracy.\n  This update supports use cases across industries such as logistics, e-commerce, and public services where accurate administrative boundary data is essential for operations like delivery zone planning, service area management, and address validation. The updated data is automatically available to customers querying Vietnam address data through Amazon Location Service.\n  Amazon Location Service enables developers to easily and securely add location data and mapping functionalities into applications. Amazon Location Service with GrabMaps service is available in Singapore and Malaysia regions. To learn more, check out our developer guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-location-service-new-admin-boundaries-vietnam/",
      "pubDate": "2025-10-08T07:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "ga",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-73f5eefa6896",
      "title": "AWS Marketplace expands Japan consumption tax support for Channel Partner Private Offers",
      "description": "Starting today, AWS Marketplace expands its Japan consumption tax (JCT) support for Channel Partner Private Offers (CPPOs), enhancing the tax experience for Independent Software Vendors (ISVs) and Channel Partners. For transactions where Japan ISVs authorize Japan Channel Partners to resell to Japan addressed buyers, AWS Japan G.K. (\"AWS Japan\") will now collect the 10% JCT for the first leg of the transaction between ISVs and Channel Partners, issue a tax qualified invoice (TQI) to the Channel Partners and disburse the JCT to ISVs. \n  AWS Japan will continue to collect the 10% JCT for the second leg of the transaction between Japan Channel Partners and Japan buyers and issue a TQI to the buyers, as previously established under the Japan Marketplace Facilitator rule. This launch unifies the compliance across both transactions, creating a seamless tax experience.\n  This feature is applicable for Japan ISVs and Japan Channel Partners when transacting via the AWS Japan Marketplace Operator. To learn more, please visit the AWS Japan FAQ or AWS Marketplace Seller Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-marketplace-japan-consumption-tax-support",
      "pubDate": "2025-10-07T14:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "launch",
        "support"
      ]
    },
    {
      "id": "aws-news-1cf24c6b0f9d",
      "title": "Deploying AI models for inference with AWS Lambda using zip packaging",
      "description": "Users usually package their function code as container images when using machine learning (ML) models that are larger than 250 MB, which is the Lambda deployment package size limit for zip files. In this post, we demonstrate an approach that downloads ML models directly from Amazon S3 into your function’s memory so that you can continue packaging your function code using zip files.",
      "link": "https://aws.amazon.com/blogs/compute/deploying-ai-models-for-inference-with-aws-lambda-using-zip-packaging/",
      "pubDate": "2025-10-02T22:11:33.000Z",
      "source": "computeBlog",
      "services": [
        "lambda",
        "s3"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "lambda",
        "s3"
      ]
    },
    {
      "id": "aws-news-6439cf5b53b1",
      "title": "Amazon Cognito adds terms of use and privacy policy documents support to Managed Login",
      "description": "Amazon Cognito now allows you to configure terms of use and privacy policy documents for Managed Login pages. This helps customers seamlessly present legal terms during user registration while simplifying implementation. With Managed Login, Cognito customers could previously use its no-code editor to customize the user journey from signup and login to password recovery and multi-factor authentication. Now, customers can additionally use Managed Login to easily set up terms of use and privacy policy documents, saving development teams from building custom solutions.\n  With this capability, you can configure terms of use and privacy policy URLs for each app client in your Cognito user pool. When users register, they see text indicating that by signing up, they agree to your terms of use and privacy policy, and a link to your webpage with the agreement. You can configure different URLs for each supported language to match your Managed Login localization settings. For example, if you have configured the privacy policy and terms of use documents for French (fr) and the same is selected in the lang query-parameter on the sign-up page URL, users will see the French URL you configured.\n  This capability is available to Amazon Cognito customers using the Essentials or Plus tiers in AWS Regions where Cognito is available, including the AWS GovCloud (US) Regions. To learn more, refer to the developer guide and Pricing Detail Page for Cognito Essentials and Plus tier.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-cognito-terms-use-privacy-policy-documents-managed-login",
      "pubDate": "2025-10-02T14:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-1d55d1ad4c56",
      "title": "How to export to Amazon S3 Tables by using AWS Step Functions Distributed Map",
      "description": "In this post, we show how to use Step Functions Distributed Map to process Amazon S3 objects and export results to Amazon S3 Tables, creating a scalable and maintainable data processing pipeline.",
      "link": "https://aws.amazon.com/blogs/compute/how-to-export-to-amazon-s3-tables-by-using-aws-step-functions-distributed-map/",
      "pubDate": "2025-10-01T16:44:18.000Z",
      "source": "computeBlog",
      "services": [
        "s3",
        "step functions"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "s3",
        "step functions"
      ]
    },
    {
      "id": "aws-news-64ef1d1304dd",
      "title": "Optimize Amazon EMR runtime for Apache Spark with EMR S3A",
      "description": "With the Amazon EMR 7.10 runtime, Amazon EMR has introduced EMR S3A, an improved implementation of the open source S3A file system connector. In this post, we showcase the enhanced read and write performance advantages of using Amazon EMR 7.10.0 runtime for Apache Spark with EMR S3A as compared to EMRFS and the open source S3A file system connector.",
      "link": "https://aws.amazon.com/blogs/big-data/optimize-amazon-emr-runtime-for-apache-spark-with-emr-s3a/",
      "pubDate": "2025-09-24T20:51:44.000Z",
      "source": "bigDataBlog",
      "services": [
        "s3",
        "emr"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "s3",
        "emr"
      ]
    },
    {
      "id": "aws-news-3f039c67eb3a",
      "title": "Accelerating SQL analytics with Amazon Redshift MCP server",
      "description": "In this post, we walk through setting up the Amazon Redshift MCP server and demonstrate how a data analyst can efficiently explore Redshift data warehouses and perform data analysis using natural language queries.",
      "link": "https://aws.amazon.com/blogs/big-data/accelerating-sql-analytics-with-amazon-redshift-mcp-server/",
      "pubDate": "2025-09-23T21:04:01.000Z",
      "source": "bigDataBlog",
      "services": [
        "redshift"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "redshift"
      ]
    },
    {
      "id": "aws-news-caff1135364c",
      "title": "Trellix achieved 35% cost savings and enhanced security with Amazon OpenSearch Service",
      "description": "Trellix, a global leader in cybersecurity solutions, emerged in 2022 from the merger of McAfee Enterprise and FireEye. To address exponential log growth across their multi-tenant, multi-Region infrastructure, Trellix used Amazon OpenSearch Service, Amazon OpenSearch Ingestion, and Amazon S3 to modernize their log infrastructure. In this post, we share how, by adopting these AWS solutions, Trellix enhanced their system’s performance, availability, and scalability while reducing operational overhead.",
      "link": "https://aws.amazon.com/blogs/big-data/trellix-achieved-35-cost-savings-and-enhanced-security-with-amazon-opensearch-service/",
      "pubDate": "2025-09-19T15:48:17.000Z",
      "source": "bigDataBlog",
      "services": [
        "s3",
        "opensearch",
        "opensearch service",
        "opensearch ingestion"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "s3",
        "opensearch",
        "opensearch service",
        "opensearch ingestion"
      ]
    },
    {
      "id": "aws-news-0eb6b4032c21",
      "title": "Enhance the local testing experience for serverless applications with LocalStack",
      "description": "Today, we’re excited to announce new capabilities that further simplify the local testing experience for Lambda functions and serverless applications through integration with LocalStack, an AWS Partner, in the AWS Toolkit for Visual Studio Code. In this post, we will show you how you can enhance your local testing experience for serverless applications with LocalStack using AWS Toolkit.",
      "link": "https://aws.amazon.com/blogs/compute/enhance-the-local-testing-experience-for-serverless-applications-with-localstack/",
      "pubDate": "2025-09-17T17:51:30.000Z",
      "source": "computeBlog",
      "services": [
        "lambda",
        "localstack"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "lambda",
        "localstack",
        "integration"
      ]
    },
    {
      "id": "aws-news-df07ccc46610",
      "title": "Implementing advanced AWS Graviton adoption strategies across AWS Regions",
      "description": "When expanding your Graviton deployment across multiple AWS Regions, careful planning helps you navigate considerations around regional instance type availability and capacity optimization. This post shows how to implement advanced configuration strategies for Graviton-enabled EC2 Auto Scaling groups across multiple Regions, helping you maximize instance availability, reduce costs, and maintain consistent application performance even in AWS Regions with limited Graviton instance type availability.",
      "link": "https://aws.amazon.com/blogs/compute/implementing-advanced-aws-graviton-adoption-strategies-across-aws-regions/",
      "pubDate": "2025-08-26T18:26:26.000Z",
      "source": "computeBlog",
      "services": [
        "ec2",
        "graviton"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "ec2",
        "graviton",
        "ga"
      ]
    },
    {
      "id": "aws-news-158c07987a55",
      "title": "Improving network observability with new AWS Outposts racks network metrics",
      "description": "With AWS Outposts racks, you can extend AWS infrastructure, services, APIs, and tools to on-premises locations. Providing performant, stable, and resilient network connections to both the parent AWS Region as well as the local network is essential to maintaining uninterrupted service. The release of two new Amazon CloudWatch metrics, VifConnectionStatus and VifBgpSessionState, gives you greater visibility into the operational status of the Outpost network connections. In this post, we discuss how to use these metrics to quickly identify network disruptions, using additional data points that can help reduce time to resolution.",
      "link": "https://aws.amazon.com/blogs/compute/improving-network-observability-with-new-aws-outposts-racks-network-metrics/",
      "pubDate": "2025-08-06T17:30:30.000Z",
      "source": "computeBlog",
      "services": [
        "cloudwatch",
        "outposts"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "cloudwatch",
        "outposts"
      ]
    },
    {
      "id": "aws-news-9e63742dd9e4",
      "title": "How Zapier runs isolated tasks on AWS Lambda and upgrades functions at scale",
      "description": "In this post, you’ll learn how Zapier has built their serverless architecture focusing on three key aspects: using Lambda functions to build isolated Zaps, operating over a hundred thousand Lambda functions through Zapier's control plane infrastructure, and enhancing security posture while reducing maintenance efforts by introducing automated function upgrades and cleanup workflows into their platform architecture.",
      "link": "https://aws.amazon.com/blogs/architecture/how-zapier-runs-isolated-tasks-on-aws-lambda-and-upgrades-functions-at-scale/",
      "pubDate": "2025-07-25T13:30:06.000Z",
      "source": "architectureBlog",
      "services": [
        "lambda"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "lambda"
      ]
    },
    {
      "id": "aws-news-9eb0f60de1a7",
      "title": "How Scale to Win uses AWS WAF to block DDoS events",
      "description": "In this post, you'll learn how Scale to Win configured their network topology and AWS WAF to protect against DDoS events that reached peaks of over 2 million requests per second during the 2024 US presidential election campaign season. The post details how they implemented comprehensive DDoS protection by segmenting human and machine traffic, using tiered rate limits with CAPTCHA, and preventing CAPTCHA token reuse through AWS WAF Bot Control.",
      "link": "https://aws.amazon.com/blogs/architecture/how-scale-to-win-uses-aws-waf-to-block-ddos-events/",
      "pubDate": "2025-07-14T19:12:38.000Z",
      "source": "architectureBlog",
      "services": [
        "waf"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "waf",
        "ga"
      ]
    },
    {
      "id": "aws-news-8ab7f94aaf5b",
      "title": "Migrate and modernize VMware workloads with AWS Transform for VMware",
      "description": "AWS Transform for VMware is a service that tackles cloud migration challenges by significantly reducing manual effort and accelerating the migration of critical VMware workloads to AWS Cloud. In this post, we highlight its comprehensive capabilities, including streamlined discovery and assessment, intelligent network conversion, enhanced security and compliance, and orchestrated migration execution.",
      "link": "https://aws.amazon.com/blogs/architecture/migrate-and-modernize-vmware-workloads-with-aws-transform-for-vmware/",
      "pubDate": "2025-07-08T20:37:49.000Z",
      "source": "architectureBlog",
      "services": [
        "transform for vmware"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "transform for vmware"
      ]
    },
    {
      "id": "aws-news-46a5eae9af95",
      "title": "How Launchpad from Pega enables secure SaaS extensibility with AWS Lambda",
      "description": "In this post, we share how Pegasystems (Pega) built Launchpad, its new SaaS development platform, to solve a core challenge in multi-tenant environments: enabling secure customer customization. By running tenant code in isolated environments with AWS Lambda, Launchpad offers its customers a secure, scalable foundation, eliminating the need for bespoke code customizations.",
      "link": "https://aws.amazon.com/blogs/architecture/how-launchpad-from-pega-enables-secure-saas-extensibility-with-aws-lambda/",
      "pubDate": "2025-05-30T18:30:49.000Z",
      "source": "architectureBlog",
      "services": [
        "lambda"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "lambda",
        "launch",
        "ga"
      ]
    }
  ]
}