{
  "lastUpdated": "2025-12-31T06:18:08.969Z",
  "category": "industry-cases",
  "totalItems": 14,
  "items": [
    {
      "id": "aws-news-a0fe3428a81f",
      "title": "AWS launches simplified import of CloudTrail Lake data in Amazon CloudWatch",
      "description": "Today, AWS launches simplified import of CloudTrail Lake data in Amazon CloudWatch, a data management and analytics service that allows you to unify operational, security, and compliance data across your AWS environment and third-party sources. With this launch, you can now import your historical CloudTrail Lake data into CloudWatch with a few steps enabling you to easily consolidate operational, security, and compliance data in one place. In CloudWatch, you simply specify the CloudTrail Lake event data store (EDS), and the date range to initiate import of your CloudTrail data. Simplified import of CloudTrail Lake data is supported via the AWS console, CLI, and SDK.\n  While simplified import of CloudTrail Lake data is available at no additional cost, you incur CloudWatch fees based on custom logs pricing. To learn more about simplified import of CloudTrail Lake data and supported AWS regions, visit the Amazon CloudWatch documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-simplified-import-cloudtrail-lake-data-amazon-cloudwatch",
      "pubDate": "2025-12-30T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "cloudwatch"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "cloudwatch",
        "launch",
        "support"
      ]
    },
    {
      "id": "aws-news-fb901172890e",
      "title": "Simplified management of Amazon MSK with natural language using Kiro CLI and Amazon MSK MCP Server",
      "description": "In this post, we demonstrate how Kiro CLI and the MSK MCP server can streamline your Kafka management. Through practical examples and demonstrations, we show you how to use these tools to perform common administrative tasks efficiently while maintaining robust security and reliability.",
      "link": "https://aws.amazon.com/blogs/big-data/simplified-management-of-amazon-msk-with-natural-language-using-kiro-cli-and-amazon-msk-mcp-server/",
      "pubDate": "2025-12-24T17:55:05.000Z",
      "source": "bigDataBlog",
      "services": [
        "kafka",
        "msk"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "kafka",
        "msk"
      ]
    },
    {
      "id": "aws-news-e8f26776387b",
      "title": "Modernize Apache Spark workflows using Spark Connect on Amazon EMR on Amazon EC2",
      "description": "In this post, we demonstrate how to implement Apache Spark Connect on Amazon EMR on Amazon Elastic Compute Cloud (Amazon EC2) to build decoupled data processing applications. We show how to set up and configure Spark Connect securely, so you can develop and test Spark applications locally while executing them on remote Amazon EMR clusters.",
      "link": "https://aws.amazon.com/blogs/big-data/modernize-apache-spark-workflows-using-spark-connect-on-amazon-emr-on-amazon-ec2/",
      "pubDate": "2025-12-18T21:29:47.000Z",
      "source": "bigDataBlog",
      "services": [
        "ec2",
        "emr"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "ec2",
        "emr"
      ]
    },
    {
      "id": "aws-news-12f51c5b7c59",
      "title": "How Taxbit achieved cost savings and faster processing times using Amazon S3 Tables",
      "description": "In this post, we discuss how Taxbit partnered with Amazon Web Services (AWS) to streamline their crypto tax analytics solution using Amazon S3 Tables, achieving 82% cost savings and five times faster processing times.",
      "link": "https://aws.amazon.com/blogs/big-data/how-taxbit-achieved-cost-savings-and-faster-processing-times-using-amazon-s3-tables/",
      "pubDate": "2025-12-18T21:27:55.000Z",
      "source": "bigDataBlog",
      "services": [
        "s3"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "s3"
      ]
    },
    {
      "id": "aws-news-4911a42f92d4",
      "title": "Power data ingestion into Splunk using Amazon Data Firehose",
      "description": "With Kinesis Data Firehose, customers can use a fully managed, reliable, and scalable data streaming solution to Splunk. In this post, we tell you a bit more about the Kinesis Data Firehose and Splunk integration. We also show you how to ingest large amounts of data into Splunk using Kinesis Data Firehose.",
      "link": "https://aws.amazon.com/blogs/big-data/power-data-ingestion-into-splunk-using-amazon-data-firehose/",
      "pubDate": "2025-12-17T18:52:29.000Z",
      "source": "bigDataBlog",
      "services": [
        "kinesis"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "kinesis",
        "integration"
      ]
    },
    {
      "id": "aws-news-45a9cad1a252",
      "title": "Introducing Apache Spark upgrade agent for Amazon EMR",
      "description": "In this post, you learn how to assess your existing Amazon EMR Spark applications, use the Spark upgrade agent directly from the Kiro IDE, upgrade a sample e-commerce order analytics Spark application project (including build configs, source code, tests, and data quality validation), and review code changes before rolling them out through your CI/CD pipeline.",
      "link": "https://aws.amazon.com/blogs/big-data/introducing-apache-spark-upgrade-agent-for-amazon-emr/",
      "pubDate": "2025-12-16T01:04:59.000Z",
      "source": "bigDataBlog",
      "services": [
        "emr"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "emr"
      ]
    },
    {
      "id": "aws-news-c96efd75c6aa",
      "title": "Accelerate Apache Hive read and write on Amazon EMR using enhanced S3A",
      "description": "In this post, we demonstrate how Apache Hive on Amazon EMR 7.10 delivers significant performance improvements for both read and write operations on Amazon S3.",
      "link": "https://aws.amazon.com/blogs/big-data/accelerate-apache-hive-read-and-write-on-amazon-emr-using-enhanced-s3a/",
      "pubDate": "2025-12-15T21:55:33.000Z",
      "source": "bigDataBlog",
      "services": [
        "s3",
        "emr"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "s3",
        "emr",
        "improvement"
      ]
    },
    {
      "id": "aws-news-95cd816fd5ef",
      "title": "Amazon EMR HBase on Amazon S3 transitioning to EMR S3A with comparable EMRFS performance",
      "description": "Starting with version 7.10, Amazon EMR is transitioning from EMR File System (EMRFS) to EMR S3A as the default file system connector for Amazon S3 access. This transition brings HBase on Amazon S3 to a new level, offering performance parity with EMRFS while delivering substantial improvements, including better standardization, improved portability, stronger community support, improved performance through non-blocking I/O, asynchronous clients, and better credential management with AWS SDK V2 integration. In this post, we discuss this transition and its benefits.",
      "link": "https://aws.amazon.com/blogs/big-data/amazon-emr-hbase-on-amazon-s3-transitioning-to-emr-s3a-with-comparable-emrfs-performance/",
      "pubDate": "2025-12-15T21:20:04.000Z",
      "source": "bigDataBlog",
      "services": [
        "s3",
        "emr"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "s3",
        "emr",
        "improvement",
        "integration",
        "support"
      ]
    },
    {
      "id": "aws-news-b436aaca5181",
      "title": "How Socure achieved 50% cost reduction by migrating from self-managed Spark to Amazon EMR Serverless",
      "description": "Socure is one of the leading providers of digital identity verification and fraud solutions. Socure’s data science environment includes a streaming pipeline called Transaction ETL (TETL), built on OSS Apache Spark running on Amazon EKS. TETL ingests and processes data volumes ranging from small to large datasets while maintaining high-throughput performance. In this post, we show how Socure was able to achieve 50% cost reduction by migrating the TETL streaming pipeline from self-managed spark to Amazon EMR serverless.",
      "link": "https://aws.amazon.com/blogs/big-data/how-socure-achieved-50-cost-reduction-by-migrating-from-self-managed-spark-to-amazon-emr-serverless/",
      "pubDate": "2025-12-15T19:23:31.000Z",
      "source": "bigDataBlog",
      "services": [
        "emr",
        "eks"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "emr",
        "eks"
      ]
    },
    {
      "id": "aws-news-30581ecb3d79",
      "title": "How BASF’s Agriculture Solutions drives traceability and climate action by tokenizing cotton value chains using Amazon Managed Blockchain",
      "description": "BASF Agricultural Solutions combines innovative products and digital tools with practical farmer knowledge. This post explores how Amazon Managed Blockchain can drive a positive change in the agricultural industry by tokenizing food and cotton value chains for traceability, climate action, and circularity.",
      "link": "https://aws.amazon.com/blogs/architecture/how-basfs-agriculture-solutions-drives-traceability-and-climate-action-by-tokenizing-cotton-value-chains-using-amazon-managed-blockchain/",
      "pubDate": "2025-12-10T17:41:52.000Z",
      "source": "architectureBlog",
      "services": [
        "nova"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "nova"
      ]
    },
    {
      "id": "aws-news-c8a3488015cc",
      "title": "AWS SDK for JavaScript aligns with Node.js release schedule",
      "description": "This post is about AWS SDK for JavaScript v3 announcing end of support for Node.js versions based on Node.js release schedule, and it is not about AWS Lambda. For the latter, refer to the Lambda runtime deprecation policy. In the second week of January 2026, the AWS SDK for JavaScript v3 (JS SDK) will start […]",
      "link": "https://aws.amazon.com/blogs/developer/aws-sdk-for-javascript-aligns-with-node-js-release-schedule/",
      "pubDate": "2025-12-08T17:32:10.000Z",
      "source": "developersAndDevOps",
      "services": [
        "lambda"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "lambda",
        "support"
      ]
    },
    {
      "id": "aws-news-f8633d530b1e",
      "title": "She architects: Bringing unique perspectives to innovative solutions at AWS",
      "description": "Have you ever wondered what it is really like to be a woman in tech at one of the world's leading cloud companies? Or maybe you are curious about how diverse perspectives drive innovation beyond the buzzwords? Today, we are providing an insider's perspective on the role of a solutions architect (SA) at Amazon Web Services (AWS). However, this is not a typical corporate success story. We are three women who have navigated challenges, celebrated wins, and found our unique paths in the world of cloud architecture, and we want to share our real stories with you.",
      "link": "https://aws.amazon.com/blogs/architecture/she-architects-bringing-unique-perspectives-to-innovative-solutions-at-aws/",
      "pubDate": "2025-12-08T16:37:15.000Z",
      "source": "architectureBlog",
      "services": [
        "nova",
        "rds"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "nova",
        "rds",
        "ga"
      ]
    },
    {
      "id": "aws-news-1c031b337189",
      "title": "Secure Amazon Elastic VMware Service (Amazon EVS) with AWS Network Firewall",
      "description": "In this post, we demonstrate how to utilize AWS Network Firewall to secure an Amazon EVS environment, using a centralized inspection architecture across an EVS cluster, VPCs, on-premises data centers and the internet. We walk through the implementation steps to deploy this architecture using AWS Network Firewall and AWS Transit Gateway.",
      "link": "https://aws.amazon.com/blogs/architecture/secure-amazon-elastic-vmware-service-amazon-evs-with-aws-network-firewall/",
      "pubDate": "2025-11-26T16:22:03.000Z",
      "source": "architectureBlog",
      "services": [],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "ga"
      ]
    },
    {
      "id": "aws-news-b04be71f4d69",
      "title": "Improve API discoverability with the new Amazon API Gateway Portal",
      "description": "In this post, we will show how you can use the new portal feature to create customizable portals with enhanced security features in minutes, with APIs from multiple accounts, without managing any infrastructure.",
      "link": "https://aws.amazon.com/blogs/compute/improve-api-discoverability-with-the-new-amazon-api-gateway-portal/",
      "pubDate": "2025-11-20T00:41:25.000Z",
      "source": "computeBlog",
      "services": [
        "api gateway"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "api gateway",
        "ga"
      ]
    }
  ]
}