{
  "lastUpdated": "2025-11-21T06:16:18.487Z",
  "category": "industry-cases",
  "totalItems": 15,
  "items": [
    {
      "id": "aws-news-c48032d4f03b",
      "title": "Amazon Connect now offers persistent agent connections for faster call handling",
      "description": "Amazon Connect now offers the ability to maintain an open communication channel between your agents and Amazon Connect, helping reduce the time it takes to establish a connection with a customer. Contact center administrators can configure an agent’s user profile to maintain a persistent connection after a conversation ends, allowing for subsequent calls to connect faster. Amazon Connect persistent agent connection makes it easier to support compliance requirements with telemarketing laws such as the U.S. Telephone Consumer Protection Act (TCPA) for outbound campaigns’ calling by reducing the time it takes for a customer to connect with your agents.\n  Amazon Connect persistent connection is now available in all AWS regions where Amazon Connect is offered, and there is no additional charge beyond standard pricing for the Amazon Connect service usage and associated telephony charges. To learn more, visit our product page or refer to our Admin Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-connect-persistent-agent-connections",
      "pubDate": "2025-11-20T22:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-b04be71f4d69",
      "title": "Improve API discoverability with the new Amazon API Gateway Portal",
      "description": "In this post, we will show how you can use the new portal feature to create customizable portals with enhanced security features in minutes, with APIs from multiple accounts, without managing any infrastructure.",
      "link": "https://aws.amazon.com/blogs/compute/improve-api-discoverability-with-the-new-amazon-api-gateway-portal/",
      "pubDate": "2025-11-20T00:41:25.000Z",
      "source": "computeBlog",
      "services": [
        "api gateway"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "api gateway",
        "ga"
      ]
    },
    {
      "id": "aws-news-e365b523f7af",
      "title": "Savings Plans and Reserved Instances Group Sharing is now generally available",
      "description": "AWS today announced the general availability of Reserved Instances and Savings Plans (RISP) Group Sharing, a new Billing and Cost Management feature that gives customers granular control over how AWS commitments are shared across their organization. This capability allows customers to define how Reserved Instances and Savings Plans benefits are distributed among specific groups of accounts within their AWS organization, ensuring cost savings align with their business structure and accountability requirements.\n  RISP Group Sharing addresses a common challenge faced by enterprise customers managing AWS costs across multiple business units: for example, Reserved Instances and Savings Plans don't always benefit the teams that purchased them. With this feature, customers can create groups using AWS Cost Categories that reflect their organizational hierarchy—whether by business units, projects, geographical regions, or funding sources. The feature offers two sharing options: the Prioritized Group Sharing applies commitments to defined groups first, then shares unused capacity organization-wide, while the Restricted Group Sharing keeps commitments exclusively within defined groups for complete isolation when strict boundaries are required.\n  RISP Group Sharing is available now in all AWS Regions, except AWS GovCloud (US) Regions and the China Regions.\n  To get started with RISP Group Sharing, visit the Billing preferences from the AWS Billing and Cost Management Console and follow the guided setup to create your first Cost Category and configure sharing preferences. For detailed implementation guidance, see the user guide and announcement blog.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/savings-plans-reserved-instances-group-sharing-generally-available",
      "pubDate": "2025-11-19T16:00:00.000Z",
      "source": "whatsNew",
      "services": [],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "generally-available",
        "ga",
        "announcement"
      ]
    },
    {
      "id": "aws-news-c2a673d7ccc0",
      "title": "Accelerate infrastructure development with AWS CloudFormation intelligent authoring in IDEs",
      "description": "Today, AWS CloudFormation announces the launch of the AWS CloudFormation Language Server, a new capability that brings intelligent authoring, early validation, troubleshooting, and drift management directly into Integrated Development Environment (IDE) through the AWS Toolkit. This new feature empowers developers to build infrastructure faster and deploy safely.\n  With this launch, developers using Visual Studio, Kiro, and other compatible IDEs can now benefit from context-aware authoring powered by the Language Server. It offers built-in auto-complete, schema validation, policy checks using CloudFormation Guard, and deployment validation directly within the IDE. For example, it immediately flags invalid resource properties or missing IAM permission requirements, while the drift-aware deployment view highlights differences between your template and deployed infrastructure, helping you spot configuration changes made outside of CloudFormation. These capabilities help developers identify issues, such as syntax errors, missing permissions, or configuration mismatches before deployment. It also provides a drift view that highlights differences between the current template and the deployed stack configuration. By integrating validation and real-time feedback directly into the authoring experience, the CloudFormation Language Server keeps developers in their flow state, turning infrastructure coding into a seamless experience, and improves infrastructure safety. This unified experience enables developers to move from design to deployment faster while maintaining compliance and best practices, spending more time building and less time troubleshooting.\n  The AWS CloudFormation Language Server is available in all AWS Commercial Regions where AWS CloudFormation is supported. To get started, install or upgrade the AWS Toolkit. To learn more, refer to AWS CloudFormation Language Server.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/aws-cloudformation-intelligent-authoring-ides",
      "pubDate": "2025-11-19T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "cloudformation",
        "iam"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "cloudformation",
        "iam",
        "launch",
        "new-feature",
        "support",
        "new-capability"
      ]
    },
    {
      "id": "aws-news-866a094e4852",
      "title": "AWS CloudTrail adds data event aggregation to simplify security monitoring",
      "description": "AWS announces CloudTrail aggregated events, a new feature that simplifies how enterprises monitor and analyze their CloudTrail data events at scale. Aggregations are available for CloudTrail data events, which could generate thousands of events per minute as users access resources like Amazon S3 buckets or AWS Lambda functions. With this feature, security, compliance, and operations teams can efficiently monitor high-volume data access patterns without processing massive numbers of individual events.\n  Aggregation for data events streamlines security monitoring by consolidating high-volume AWS API activity into 5-minute summaries. These summaries highlight key trends like access frequency, error rates, and most-used actions, allowing teams to quickly identify patterns while maintaining access to detailed events when needed. Security teams can easily answer questions like \"How has this user's activity changed over the past week?\" or \"What are the top actions being performed on this critical resource?\" without having to scan through voluminous CloudTrail data events.\n  You can enable aggregation in your trails capturing data events through the AWS console or CLI, and choose from pre-built aggregation templates for API activity, resource access, and user activity summaries. For more information, see the CloudTrail trail documentation. You are charged for aggregations based on the number of CloudTrail data events that are analyzed to create the aggregation. For more information, visit the CloudTrail pricing page.\n  You can use CloudTrail aggregations for data in all commercial AWS Regions.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/cloudtrail-data-event-aggregation-security-monitoring/",
      "pubDate": "2025-11-19T08:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lambda",
        "s3"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "lambda",
        "s3",
        "ga",
        "new-feature"
      ]
    },
    {
      "id": "aws-news-1c81acbb3316",
      "title": "Introducing Amazon MWAA Serverless",
      "description": "Today, AWS announced Amazon Managed Workflows for Apache Airflow (MWAA) Serverless. This is a new deployment option for MWAA that eliminates the operational overhead of managing Apache Airflow environments while optimizing costs through serverless scaling. In this post, we demonstrate how to use MWAA Serverless to build and deploy scalable workflow automation solutions.",
      "link": "https://aws.amazon.com/blogs/big-data/introducing-amazon-mwaa-serverless/",
      "pubDate": "2025-11-17T22:22:46.000Z",
      "source": "bigDataBlog",
      "services": [],
      "categories": [
        "industry-cases"
      ],
      "tags": []
    },
    {
      "id": "aws-news-a7184d7c3c1a",
      "title": "Introducing the Amazon OpenSearch Lens for the AWS Well-Architected Framework",
      "description": "In this post, we show you how to use the Amazon OpenSearch Service Lens to evaluate your OpenSearch Service workloads against architectural best practices.",
      "link": "https://aws.amazon.com/blogs/big-data/introducing-the-amazon-opensearch-lens-for-the-aws-well-architected-framework/",
      "pubDate": "2025-11-12T01:07:02.000Z",
      "source": "bigDataBlog",
      "services": [
        "opensearch",
        "opensearch service"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "opensearch",
        "opensearch service",
        "ga"
      ]
    },
    {
      "id": "aws-news-a104392c9b46",
      "title": "Analyzing Amazon EC2 Spot instance interruptions by using event-driven architecture",
      "description": "In this post, you'll learn how to build this comprehensive monitoring solution step-by-step. You'll gain practical experience designing an event-driven pipeline, implementing data processing workflows, and creating insightful dashboards that help you track interruption trends, optimize ASG configurations, and improve the resilience of your Spot Instance workloads.",
      "link": "https://aws.amazon.com/blogs/big-data/analyzing-amazon-ec2-spot-instance-interruptions-by-using-event-driven-architecture/",
      "pubDate": "2025-11-10T22:05:20.000Z",
      "source": "bigDataBlog",
      "services": [
        "ec2",
        "rds"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "ec2",
        "rds",
        "ga"
      ]
    },
    {
      "id": "aws-news-a14aa54b7cee",
      "title": "Orchestrating big data processing with AWS Step Functions Distributed Map",
      "description": "In this post, you'll learn how to use AWS Step Functions Distributed Map to process Amazon Athena data manifest and Parquet files through a step-by-step demonstration.",
      "link": "https://aws.amazon.com/blogs/compute/orchestrating-big-data-processing-with-aws-step-functions-distributed-map/",
      "pubDate": "2025-11-04T23:42:01.000Z",
      "source": "computeBlog",
      "services": [
        "athena",
        "step functions"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "athena",
        "step functions"
      ]
    },
    {
      "id": "aws-news-5625caee948f",
      "title": "Amazon Kinesis Data Streams launches On-demand Advantage for instant throughput increases and streaming at scale",
      "description": "Today, AWS announced the new Amazon Kinesis Data Streams On-demand Advantage mode, which includes warm throughput capability and an updated pricing structure. With this feature you can enable instant scaling for traffic surges while optimizing costs for consistent streaming workloads. In this post, we explore this new feature, including key use cases, configuration options, pricing considerations, and best practices for optimal performance.",
      "link": "https://aws.amazon.com/blogs/big-data/amazon-kinesis-data-streams-launches-on-demand-advantage-for-instant-throughput-increases-and-streaming-at-scale/",
      "pubDate": "2025-11-03T22:00:31.000Z",
      "source": "bigDataBlog",
      "services": [
        "kinesis"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "kinesis",
        "launch",
        "new-feature",
        "update"
      ]
    },
    {
      "id": "aws-news-1998e227992a",
      "title": "Scaling data governance with Amazon DataZone: Covestro success story",
      "description": "In this post, we show you how Covestro transformed its data architecture by implementing Amazon DataZone and AWS Serverless Data Lake Framework, transitioning from a centralized data lake to a data mesh architecture. The implementation enabled streamlined data access, better data quality, and stronger governance at scale, achieving a 70% reduction in time-to-market for over 1,000 data pipelines.",
      "link": "https://aws.amazon.com/blogs/big-data/scaling-data-governance-with-amazon-datazone-covestro-success-story/",
      "pubDate": "2025-11-03T21:02:06.000Z",
      "source": "bigDataBlog",
      "services": [],
      "categories": [
        "industry-cases"
      ],
      "tags": []
    },
    {
      "id": "aws-news-b147351ed9fa",
      "title": "Upgrade from Amazon Redshift DC2 node type to Amazon Redshift Serverless",
      "description": "In this post, we show you the upgrade process from DC2 instances to Amazon Redshift Serverless. By using Amazon Redshift Serverless, you can run and scale analytics without managing data warehouse infrastructure.",
      "link": "https://aws.amazon.com/blogs/big-data/upgrade-from-amazon-redshift-dc2-node-type-to-amazon-redshift-serverless/",
      "pubDate": "2025-10-22T21:04:31.000Z",
      "source": "bigDataBlog",
      "services": [
        "redshift"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "redshift"
      ]
    },
    {
      "id": "aws-news-11031ecd9926",
      "title": "Zero downtime blue/green deployments with Amazon API Gateway",
      "description": "In this post, you learn how to implement blue/green deployments by using Amazon API Gateway for your APIs. For this post, we use AWS Lambda functions on the backend. However, you can follow the same strategy for other backend implementations of the APIs. All the required infrastructure is deployed by using AWS Serverless Application Model (AWS SAM).",
      "link": "https://aws.amazon.com/blogs/compute/zero-downtime-blue-green-deployments-with-amazon-api-gateway/",
      "pubDate": "2025-10-16T19:01:22.000Z",
      "source": "computeBlog",
      "services": [
        "lambda",
        "api gateway"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "lambda",
        "api gateway",
        "ga"
      ]
    },
    {
      "id": "aws-news-9e63742dd9e4",
      "title": "How Zapier runs isolated tasks on AWS Lambda and upgrades functions at scale",
      "description": "In this post, you’ll learn how Zapier has built their serverless architecture focusing on three key aspects: using Lambda functions to build isolated Zaps, operating over a hundred thousand Lambda functions through Zapier's control plane infrastructure, and enhancing security posture while reducing maintenance efforts by introducing automated function upgrades and cleanup workflows into their platform architecture.",
      "link": "https://aws.amazon.com/blogs/architecture/how-zapier-runs-isolated-tasks-on-aws-lambda-and-upgrades-functions-at-scale/",
      "pubDate": "2025-07-25T13:30:06.000Z",
      "source": "architectureBlog",
      "services": [
        "lambda"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "lambda"
      ]
    },
    {
      "id": "aws-news-9eb0f60de1a7",
      "title": "How Scale to Win uses AWS WAF to block DDoS events",
      "description": "In this post, you'll learn how Scale to Win configured their network topology and AWS WAF to protect against DDoS events that reached peaks of over 2 million requests per second during the 2024 US presidential election campaign season. The post details how they implemented comprehensive DDoS protection by segmenting human and machine traffic, using tiered rate limits with CAPTCHA, and preventing CAPTCHA token reuse through AWS WAF Bot Control.",
      "link": "https://aws.amazon.com/blogs/architecture/how-scale-to-win-uses-aws-waf-to-block-ddos-events/",
      "pubDate": "2025-07-14T19:12:38.000Z",
      "source": "architectureBlog",
      "services": [
        "waf"
      ],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "waf",
        "ga"
      ]
    }
  ]
}