{
  "lastUpdated": "2025-09-28T11:56:04.340Z",
  "category": "industry-cases",
  "totalItems": 7,
  "items": [
    {
      "id": "aws-news-c959ef8c3720",
      "title": "Building health care agents using Amazon Bedrock AgentCore",
      "description": "In this solution, we demonstrate how the user (a parent) can interact with a Strands or LangGraph agent in conversational style and get information about the immunization history and schedule of their child, inquire about the available slots, and book appointments. With some changes, AI agents can be made event-driven so that they can automatically send reminders, book appointments, and so on.",
      "link": "https://aws.amazon.com/blogs/machine-learning/building-health-care-agents-using-amazon-bedrock-agentcore/",
      "pubDate": "2025-09-26T16:03:41.000Z",
      "source": "ml-blog",
      "services": [
        "bedrock",
        "agentcore"
      ],
      "categories": [
        "generative-ai",
        "industry-cases"
      ],
      "tags": [
        "bedrock",
        "agentcore"
      ]
    },
    {
      "id": "aws-news-72cd9c93cdeb",
      "title": "Build multi-agent site reliability engineering assistants with Amazon Bedrock AgentCore",
      "description": "In this post, we demonstrate how to build a multi-agent SRE assistant using Amazon Bedrock AgentCore, LangGraph, and the Model Context Protocol (MCP). This system deploys specialized AI agents that collaborate to provide the deep, contextual intelligence that modern SRE teams need for effective incident response and infrastructure management.",
      "link": "https://aws.amazon.com/blogs/machine-learning/build-multi-agent-site-reliability-engineering-assistants-with-amazon-bedrock-agentcore/",
      "pubDate": "2025-09-26T15:58:34.000Z",
      "source": "ml-blog",
      "services": [
        "bedrock",
        "agentcore"
      ],
      "categories": [
        "generative-ai",
        "industry-cases"
      ],
      "tags": [
        "bedrock",
        "agentcore"
      ]
    },
    {
      "id": "aws-news-1510ce03e38b",
      "title": "How PropHero built an intelligent property investment advisor with continuous evaluation using Amazon Bedrock",
      "description": "In this post, we explore how we built a multi-agent conversational AI system using Amazon Bedrock that delivers knowledge-grounded property investment advice. We explore the agent architecture, model selection strategy, and comprehensive continuous evaluation system that facilitates quality conversations while facilitating rapid iteration and improvement.",
      "link": "https://aws.amazon.com/blogs/machine-learning/how-prophero-built-an-intelligent-property-investment-advisor-with-continuous-evaluation-using-amazon-bedrock/",
      "pubDate": "2025-09-25T19:25:23.000Z",
      "source": "ml-blog",
      "services": [
        "bedrock"
      ],
      "categories": [
        "generative-ai",
        "natural-language",
        "industry-cases"
      ],
      "tags": [
        "bedrock",
        "improvement"
      ]
    },
    {
      "id": "aws-news-6bac89759fe3",
      "title": "Amazon Connect now supports you to associate custom attributes with interaction segments",
      "description": "Amazon Connect now supports you to associate custom attributes with interaction segments, ensuring reporting and analytics always reflect the true customer journey. Attributes such as business unit name, account type, or contact reason can be centrally managed with predetermined values and applied to contact records through flows or the UpdateContact API. This approach preserves accurate business context throughout customer journeys, particularly during transfers and multi-party communications. For example, a customer engagement that originates in the Support business unit and transitions to Sales: each distinct interaction segment maintains its precise business unit name, creating an accurate and comprehensive record of the customer journey.\n  This feature is available in all AWS regions where Amazon Connect is available. To learn more about using predefined attributes as contact segment attributes, see the Amazon Connect Administrator Guide. To learn more about Amazon Connect, the AWS contact center as a service solution on the cloud, please visit the Amazon Connect website.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-connect-associate-custom-attributes-interaction-segments/",
      "pubDate": "2025-09-23T07:00:00.000Z",
      "source": "whats-new",
      "services": [],
      "categories": [
        "industry-cases"
      ],
      "tags": [
        "ga",
        "update",
        "support"
      ]
    },
    {
      "id": "aws-news-b2e219fc1dd9",
      "title": "DeepSeek-V3.1 model now available fully managed in Amazon Bedrock",
      "description": "DeepSeek-V3.1 is now available as a fully managed foundation model in Amazon Bedrock. This advanced open weight model allows you to switch between thinking mode for detailed step-by-step analysis and non-thinking mode for quicker responses. With comprehensive multilingual support, it delivers enhanced accuracy and reduced hallucinations compared to previous DeepSeek models, while maintaining visibility into its decision-making process.\n  You can use DeepSeek-V3.1's enterprise-grade capabilities across critical business functions, from state-of-the-art software development to complex mathematical reasoning and data analysis. The model excels at sophisticated problem-solving tasks, demonstrating strong performance in coding benchmarks and technical challenges. Its enhanced tool-calling capabilities and seamless workflow integration make it ideal for building AI agents and automating enterprise processes, while its transparent reasoning approach helps teams understand and trust its outputs.\n  \n DeepSeek-V3.1 is now available in the US West (Oregon), Asia Paciﬁc (Tokyo), Asia Paciﬁc (Mumbai), Europe (London), and Europe (Stockholm) AWS Regions. To learn more, read the blog, product page, Amazon Bedrock pricing, and documentation. To get started with DeepSeek in Amazon Bedrock, visit the Amazon Bedrock console.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/deepseek-v3-1-model-fully-managed-amazon-bedrock",
      "pubDate": "2025-09-18T14:00:00.000Z",
      "source": "whats-new",
      "services": [
        "bedrock",
        "lex"
      ],
      "categories": [
        "generative-ai",
        "natural-language",
        "industry-cases"
      ],
      "tags": [
        "bedrock",
        "lex",
        "now-available",
        "integration",
        "support"
      ]
    },
    {
      "id": "aws-news-36861798e0d8",
      "title": "Amazon AppStream 2.0 adds support for fractional GPU instances",
      "description": "Today, Amazon AppStream 2.0 announces support for Graphics G6 instances with fractionalized GPU sizes, which are built on the EC2 G6 family, designed to cater to graphics applications that need smaller GPU fractions.\n  Graphics G6 instances with fractionalized GPU sizes (G6f and Gr6f) allow users to utilize only the GPU resources they need, rather than provisioning full GPU instances. This approach helps enable better resource optimization through shared GPU capacity, offering flexibility to choose smaller GPU fractions (such as 1/2, 1/4, or 1/8) that align with specific workload requirements. Organizations can benefit from reduced costs by avoiding over-provisioning while maintaining access to GPU capabilities for applications that don't require full GPU power.\n  These new instance types are available in 10 AWS Regions, including US East (N. Virginia, Ohio), US West (Oregon), Canada (Central), Europe (Frankfurt, London), Asia Pacific (Tokyo, Mumbai, Sydney), and South America (Sao Paulo). AppStream 2.0 offers pay-as-you-go pricing, see Amazon AppStream 2.0 Pricing for more information.\n  To get started, select an AppStream 2.0 Graphics G6 instances with fractionalized GPU sizes when launching an image builder or creating a new fleet. You can launch Graphics G6 instances with fractionalized GPU sizes using either the AWS management console or the AWS SDK. To learn more, see AppStream 2.0 Instance Families.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-appstream-fractional-gpu/",
      "pubDate": "2025-09-16T15:00:00.000Z",
      "source": "whats-new",
      "services": [
        "lex"
      ],
      "categories": [
        "natural-language",
        "industry-cases"
      ],
      "tags": [
        "lex",
        "launch",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-79795044339d",
      "title": "Automate advanced agentic RAG pipeline with Amazon SageMaker AI",
      "description": "In this post, we walk through how to streamline your RAG development lifecycle from experimentation to automation, helping you operationalize your RAG solution for production deployments with Amazon SageMaker AI, helping your team experiment efficiently, collaborate effectively, and drive continuous improvement.",
      "link": "https://aws.amazon.com/blogs/machine-learning/automate-advanced-agentic-rag-pipeline-with-amazon-sagemaker-ai/",
      "pubDate": "2025-09-12T17:36:19.000Z",
      "source": "ml-blog",
      "services": [
        "sagemaker"
      ],
      "categories": [
        "generative-ai",
        "machine-learning",
        "industry-cases"
      ],
      "tags": [
        "sagemaker",
        "improvement"
      ]
    }
  ]
}