{
  "lastUpdated": "2025-10-25T06:13:19.619Z",
  "category": "machine-learning",
  "totalItems": 6,
  "items": [
    {
      "id": "aws-news-98cfef58cd17",
      "title": "Amazon SageMaker Unified Studio supports Amazon Athena workgroups",
      "description": "Data engineers and data analysts using Amazon SageMaker Unified Studio can now connect to and run queries with pre-existing Amazon Athena workgroups. This feature enables data teams to run SQL queries in SageMaker Unified Studio with the default settings and properties from existing Athena workgroups. Since Athena workgroups are used to manage query access and control costs, data engineers and data analysts can save time by reusing Athena workgroups as their SQL analytics compute while maintaining data usage limits and tracking query usage by team or project. \n  When choosing a compute for SQL analytics within SageMaker Unified Studio, customers can create a new Athena compute connection or choose to connect to an existing Athena workgroup. To get started, navigate to SageMaker Unified Studio, select “Add compute” and choose “Connect to existing compute resources”. Then create a connection to your pre-existing Athena workgroups and save. This new compute is now available within the SageMaker Unified Studio query editor to run SQL queries.\n  Connecting to Athena workgroups within SageMaker Unified Studio is available in all regions where SageMaker Unified Studio is supported.\n  To learn more, refer to the SageMaker Unified Studio Guide and Athena Workgroups Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-sagemaker-unified-studio-athena-workgroups/",
      "pubDate": "2025-10-24T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "sagemaker",
        "unified studio",
        "athena"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "unified studio",
        "athena",
        "ga",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-b5bfe4ecdc05",
      "title": "Automate email notifications for governance teams working with Amazon SageMaker Catalog",
      "description": "In this post, we show you how to create custom notifications for events occurring in SageMaker Catalog using Amazon EventBridge, AWS Lambda, and Amazon SNS. You can expand this solution to automatically integrate SageMaker Catalog with in-house enterprise workflow tools like ServiceNow and Helix.",
      "link": "https://aws.amazon.com/blogs/big-data/automate-email-notifications-for-governance-teams-working-with-amazon-sagemaker-catalog/",
      "pubDate": "2025-10-21T20:59:53.000Z",
      "source": "bigDataBlog",
      "services": [
        "sagemaker",
        "lambda",
        "eventbridge",
        "sns"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "lambda",
        "eventbridge",
        "sns"
      ]
    },
    {
      "id": "aws-news-a711a087d1f2",
      "title": "Serverless deployment for your Amazon SageMaker Canvas models",
      "description": "In this post, we walk through how to take an ML model built in SageMaker Canvas and deploy it using SageMaker Serverless Inference, helping you go from model creation to production-ready predictions quickly and efficiently without managing any infrastructure. This solution demonstrates a complete workflow from adding your trained model to the SageMaker Model Registry through creating serverless endpoint configurations and deploying endpoints that automatically scale based on demand .",
      "link": "https://aws.amazon.com/blogs/machine-learning/serverless-deployment-for-your-amazon-sagemaker-canvas-models/",
      "pubDate": "2025-10-21T19:03:19.000Z",
      "source": "mlBlog",
      "services": [
        "sagemaker",
        "canvas"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "canvas"
      ]
    },
    {
      "id": "aws-news-5bde5fbf03d4",
      "title": "Configure seamless single sign-on with SQL analytics in Amazon SageMaker Unified Studio",
      "description": "This post demonstrates how to configure SageMaker Unified Studio with SSO, set up projects and user onboarding, and access data securely using integrated analytics tools.",
      "link": "https://aws.amazon.com/blogs/big-data/configure-seamless-single-sign-on-with-sql-analytics-in-amazon-sagemaker-unified-studio/",
      "pubDate": "2025-10-17T23:20:34.000Z",
      "source": "bigDataBlog",
      "services": [
        "sagemaker",
        "unified studio"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "unified studio"
      ]
    },
    {
      "id": "aws-news-cc1315a3715a",
      "title": "Visualize data lineage using Amazon SageMaker Catalog for Amazon EMR, AWS Glue, and Amazon Redshift",
      "description": "Amazon SageMaker offers a comprehensive hub that integrates data, analytics, and AI capabilities, providing a unified experience for users to access and work with their data. Through Amazon SageMaker Unified Studio, a single and unified environment, you can use a wide range of tools and features to support your data and AI development needs, including […]",
      "link": "https://aws.amazon.com/blogs/big-data/visualize-data-lineage-using-amazon-sagemaker-catalog-for-amazon-emr-aws-glue-and-amazon-redshift/",
      "pubDate": "2025-10-13T19:08:49.000Z",
      "source": "bigDataBlog",
      "services": [
        "sagemaker",
        "unified studio",
        "emr",
        "redshift",
        "glue"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "unified studio",
        "emr",
        "redshift",
        "glue",
        "support"
      ]
    },
    {
      "id": "aws-news-65e8716647ee",
      "title": "Amazon SageMaker AI Projects now supports custom template S3 provisioning",
      "description": "Amazon SageMaker AI Projects now supports provisioning custom machine learning (ML) project templates from Amazon S3. Administrators can now manage ML templates in SageMaker AI studio so data scientists can create standardized ML projects to meet their organizational needs.\n  Data scientists can use Amazon SageMaker AI Projects to create standardized ML projects that meet organizational requirements and automate ML development workflows. Administrators define standardized ML project templates that include end-to-end development patterns. By provisioning custom templates from Amazon S3, administrators can define standardized project templates and provide access to these templates directly in the SageMaker AI studio for data scientists, ensuring all ML projects follow organizational standards.\n  SageMaker AI Projects custom template S3 provisioning is available in all AWS Regions where SageMaker AI Projects is available.\n  To learn more, visit SageMaker AI Projects documentation, and SageMaker AI Studio.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-sagemaker-ai-projects-custom-template-s3-provisioning",
      "pubDate": "2025-10-13T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "sagemaker",
        "s3",
        "rds"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "s3",
        "rds",
        "ga",
        "support"
      ]
    }
  ]
}