{
  "lastUpdated": "2026-01-24T06:16:32.856Z",
  "category": "machine-learning",
  "totalItems": 3,
  "items": [
    {
      "id": "aws-news-5dbb9c1d438d",
      "title": "Power up your analytics with Amazon SageMaker Unified Studio integration with Tableau, Power BI, and more",
      "description": "In this post, we guide you through connecting various analytics tools to Amazon SageMaker Unified Studio using the Athena JDBC driver, enabling seamless access to your subscribed data within your Amazon SageMaker Unified Studio projects.",
      "link": "https://aws.amazon.com/blogs/big-data/power-up-your-analytics-with-amazon-sagemaker-unified-studio-integration-with-tableau-power-bi-and-more/",
      "pubDate": "2026-01-22T17:26:09.000Z",
      "source": "bigDataBlog",
      "services": [
        "sagemaker",
        "unified studio",
        "athena"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "unified studio",
        "athena",
        "integration"
      ]
    },
    {
      "id": "aws-news-bdcf392e064f",
      "title": "Accelerate context-aware data analysis and ML workflows with Amazon SageMaker Data Agent",
      "description": "In this post, we demonstrate the capabilities of SageMaker Data Agent, discuss the challenges it addresses, and explore a real-world example analyzing New York City taxi trip data to see the agent in action.",
      "link": "https://aws.amazon.com/blogs/big-data/accelerate-context-aware-data-analysis-and-ml-workflows-with-amazon-sagemaker-data-agent/",
      "pubDate": "2026-01-22T17:25:02.000Z",
      "source": "bigDataBlog",
      "services": [
        "sagemaker"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker"
      ]
    },
    {
      "id": "aws-news-92f8ed9bd86b",
      "title": "SageMaker Unified Studio adds cross-Region subscriptions support for IDC based domains",
      "description": "Amazon SageMaker Unified Studio now supports cross-Region subscriptions for comprehensive and flexible data access and governance. With cross-Region support, you can subscribe to AWS Glue tables and views, as well as Amazon Redshift tables and views published in a different AWS Region than your project. This capability helps break down data silos and enable better collaboration across your organization by allowing teams to access curated data assets from any AWS Region without manual replication.\n  To get started with cross-Region subscriptions, log into SageMaker Unified Studio, or use the Amazon DataZone API, SDK, or AWS CLI. Cross-Region subscriptions support is available in all AWS Regions where SageMaker Unified Studio is supported. To learn more, see the SageMaker Unified Studio user guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/sagemaker-unified-studio-adds-cross-region-iam/",
      "pubDate": "2026-01-20T20:59:00.000Z",
      "source": "whatsNew",
      "services": [
        "sagemaker",
        "unified studio",
        "lex",
        "redshift",
        "glue"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "unified studio",
        "lex",
        "redshift",
        "glue",
        "ga",
        "support"
      ]
    }
  ]
}