{
  "lastUpdated": "2025-10-20T06:16:03.912Z",
  "category": "machine-learning",
  "totalItems": 6,
  "items": [
    {
      "id": "aws-news-5bde5fbf03d4",
      "title": "Configure seamless single sign-on with SQL analytics in Amazon SageMaker Unified Studio",
      "description": "This post demonstrates how to configure SageMaker Unified Studio with SSO, set up projects and user onboarding, and access data securely using integrated analytics tools.",
      "link": "https://aws.amazon.com/blogs/big-data/configure-seamless-single-sign-on-with-sql-analytics-in-amazon-sagemaker-unified-studio/",
      "pubDate": "2025-10-17T23:20:34.000Z",
      "source": "bigDataBlog",
      "services": [
        "sagemaker",
        "unified studio"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "unified studio"
      ]
    },
    {
      "id": "aws-news-19dcea9a5a48",
      "title": "Scala development in Amazon SageMaker Studio with Almond kernel",
      "description": "This post provides a comprehensive guide on integrating the Almond kernel into SageMaker Studio, offering a solution for Scala development within the platform.",
      "link": "https://aws.amazon.com/blogs/machine-learning/scala-development-in-amazon-sagemaker-studio-with-almond-kernel/",
      "pubDate": "2025-10-15T16:35:01.000Z",
      "source": "mlBlog",
      "services": [
        "sagemaker"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker"
      ]
    },
    {
      "id": "aws-news-cc1315a3715a",
      "title": "Visualize data lineage using Amazon SageMaker Catalog for Amazon EMR, AWS Glue, and Amazon Redshift",
      "description": "Amazon SageMaker offers a comprehensive hub that integrates data, analytics, and AI capabilities, providing a unified experience for users to access and work with their data. Through Amazon SageMaker Unified Studio, a single and unified environment, you can use a wide range of tools and features to support your data and AI development needs, including […]",
      "link": "https://aws.amazon.com/blogs/big-data/visualize-data-lineage-using-amazon-sagemaker-catalog-for-amazon-emr-aws-glue-and-amazon-redshift/",
      "pubDate": "2025-10-13T19:08:49.000Z",
      "source": "bigDataBlog",
      "services": [
        "sagemaker",
        "unified studio",
        "emr",
        "redshift",
        "glue"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "unified studio",
        "emr",
        "redshift",
        "glue",
        "support"
      ]
    },
    {
      "id": "aws-news-65e8716647ee",
      "title": "Amazon SageMaker AI Projects now supports custom template S3 provisioning",
      "description": "Amazon SageMaker AI Projects now supports provisioning custom machine learning (ML) project templates from Amazon S3. Administrators can now manage ML templates in SageMaker AI studio so data scientists can create standardized ML projects to meet their organizational needs.\n  Data scientists can use Amazon SageMaker AI Projects to create standardized ML projects that meet organizational requirements and automate ML development workflows. Administrators define standardized ML project templates that include end-to-end development patterns. By provisioning custom templates from Amazon S3, administrators can define standardized project templates and provide access to these templates directly in the SageMaker AI studio for data scientists, ensuring all ML projects follow organizational standards.\n  SageMaker AI Projects custom template S3 provisioning is available in all AWS Regions where SageMaker AI Projects is available.\n  To learn more, visit SageMaker AI Projects documentation, and SageMaker AI Studio.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-sagemaker-ai-projects-custom-template-s3-provisioning",
      "pubDate": "2025-10-13T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "sagemaker",
        "s3",
        "rds"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "s3",
        "rds",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-b060e3f342a5",
      "title": "Amazon SageMaker notebook instance now supports Amazon Linux 2023",
      "description": "Today, we are excited to announce that Amazon SageMaker notebook instance supports Amazon Linux 2023. You can now choose Amazon Linux 2023 for your new Amazon SageMaker notebook instance to take advantage of the latest innovations, enhanced security features.\n  Amazon SageMaker notebook instances are fully managed Jupyter Notebooks with pre-configured development environments for data science and machine learning. Data scientists and developers can use SageMaker Notebooks to interactively explore, visualize and prepare data, and build and deploy machine learning models on SageMaker.\n  Amazon Linux 2023 (AL2023) is a general-purpose rpm-based Linux distribution and successor to Amazon Linux 2 (AL2). Amazon Linux 2023 simplifies operating system management through its secure, stable, and high-performance runtime environment. This Linux distribution follows a predictable two-year major release cycle with five years of long-term support. The first two years provide standard support with quarterly security patches, bug fixes, and new features, followed by three years of maintenance. Enhanced security features include SELinux support and FIPS 140-3 validation for cryptographic modules.\n  With this you now have the options to launch a notebook instance with AL2023 or AL2. For more details about this launch and instructions on how to get started with AL2023 notebook instances, please refer to the Amazon Linux 2023 documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-sagemaker-notebook-instance-amazon-linux-2023/",
      "pubDate": "2025-10-09T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "nova",
        "sagemaker"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "nova",
        "sagemaker",
        "launch",
        "new-feature",
        "support"
      ]
    },
    {
      "id": "aws-news-33355eceeb89",
      "title": "Use Apache Airflow workflows to orchestrate data processing on Amazon SageMaker Unified Studio",
      "description": "Orchestrating machine learning pipelines is complex, especially when data processing, training, and deployment span multiple services and tools. In this post, we walk through a hands-on, end-to-end example of developing, testing, and running a machine learning (ML) pipeline using workflow capabilities in Amazon SageMaker, accessed through the Amazon SageMaker Unified Studio experience. These workflows are powered by Amazon Managed Workflows for Apache Airflow.",
      "link": "https://aws.amazon.com/blogs/big-data/use-apache-airflow-workflows-to-orchestrate-data-processing-on-amazon-sagemaker-unified-studio/",
      "pubDate": "2025-09-22T16:56:56.000Z",
      "source": "bigDataBlog",
      "services": [
        "sagemaker",
        "unified studio",
        "lex"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "unified studio",
        "lex"
      ]
    }
  ]
}