{
  "lastUpdated": "2026-01-22T06:18:54.913Z",
  "category": "machine-learning",
  "totalItems": 3,
  "items": [
    {
      "id": "aws-news-f6bd34f7e625",
      "title": "SageMaker Unified Studio adds support for cross-Region and IAM role-based subscriptions",
      "description": "Amazon SageMaker Unified Studio now supports cross-Region subscriptions and IAM role-based subscriptions for simple and flexible data access and governance. With cross-Region support, you can subscribe to AWS Glue tables and views, as well as Amazon Redshift tables and views published in a different AWS Region than your project. This capability helps break down data silos and enable better collaboration across your organization by allowing teams to access curated data assets from any AWS Region without manual replication.\n  Additionally, you can now discovery and request access to data through IAM-role based subscriptions. This allows you to request access to data without requiring a SageMaker Unified Studio project, eliminating the project intermediary layer and simplifying access to data through IAM roles.\n  To get started with cross-Region subscriptions, log into SageMaker Unified Studio, or use the Amazon DataZone API, SDK, or AWS CLI. IAM role-based subscriptions are available via Amazon DataZone API and SDK. These new APIs for cross-Region subscriptions and IAM role-based access are available in all AWS Regions where SageMaker Unified Studio is supported. To learn more, see the SageMaker Unified Studio user guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/sagemaker-unified-studio-adds-cross-region-iam/",
      "pubDate": "2026-01-20T20:59:00.000Z",
      "source": "whatsNew",
      "services": [
        "sagemaker",
        "unified studio",
        "lex",
        "redshift",
        "iam",
        "glue"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "unified studio",
        "lex",
        "redshift",
        "iam",
        "glue",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-8abea41234e8",
      "title": "Accelerating LLM inference with post-training weight and activation using AWQ and GPTQ on Amazon SageMaker AI",
      "description": "Quantized models can be seamlessly deployed on Amazon SageMaker AI using a few lines of code. In this post, we explore why quantization matters—how it enables lower-cost inference, supports deployment on resource-constrained hardware, and reduces both the financial and environmental impact of modern LLMs, while preserving most of their original performance. We also take a deep dive into the principles behind PTQ and demonstrate how to quantize the model of your choice and deploy it on Amazon SageMaker.",
      "link": "https://aws.amazon.com/blogs/machine-learning/accelerating-llm-inference-with-post-training-weight-and-activation-using-awq-and-gptq-on-amazon-sagemaker-ai/",
      "pubDate": "2026-01-09T18:09:22.000Z",
      "source": "mlBlog",
      "services": [
        "sagemaker"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "support"
      ]
    },
    {
      "id": "aws-news-4ed9fe1d2855",
      "title": "Unifying governance and metadata across Amazon SageMaker Unified Studio and Atlan",
      "description": "In this post, we show you how to unify governance and metadata across Amazon SageMaker Unified Studio and Atlan through a comprehensive bidirectional integration. You’ll learn how to deploy the necessary AWS infrastructure, configure secure connections, and set up automated synchronization to maintain consistent metadata across both platforms.",
      "link": "https://aws.amazon.com/blogs/big-data/unifying-governance-and-metadata-across-amazon-sagemaker-unified-studio-and-atlan/",
      "pubDate": "2025-12-22T18:17:06.000Z",
      "source": "bigDataBlog",
      "services": [
        "sagemaker",
        "unified studio"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "unified studio",
        "integration"
      ]
    }
  ]
}