{
  "lastUpdated": "2026-02-03T06:36:21.107Z",
  "category": "machine-learning",
  "totalItems": 6,
  "items": [
    {
      "id": "aws-news-50526bbbaf99",
      "title": "Federate access to Amazon SageMaker Unified Studio with AWS IAM Identity Center and Ping Identity",
      "description": "In this post, we show how to set up workforce access with SageMaker Unified Studio using Ping Identity as an external IdP with IAM Identity Center.",
      "link": "https://aws.amazon.com/blogs/big-data/federate-access-to-amazon-sagemaker-unified-studio-with-aws-iam-identity-center-and-ping-identity/",
      "pubDate": "2026-02-02T20:39:39.000Z",
      "source": "bigDataBlog",
      "services": [
        "sagemaker",
        "unified studio",
        "iam",
        "iam identity center"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "unified studio",
        "iam",
        "iam identity center"
      ]
    },
    {
      "id": "aws-news-d3a02636592d",
      "title": "Amazon SageMaker Unified Studio now supports AWS PrivateLink",
      "description": "Today, Amazon SageMaker announced a new capability allowing you to establish connectivity between your Amazon Virtual Private Cloud (VPC) and Amazon SageMaker Unified Studio without customer data traffic going through the public internet. Customers needing to go beyond the standard data transfer protocol (HTTPS/TLS2) can choose to configure their VPC so data transfer stays within the AWS network.\n  Through AWS PrivateLink, Network Administrators can now onboard AWS service endpoints to their VPC used by Amazon SageMaker Unified Studio. With the endpoints are onboarded, IAM policies used by Amazon SageMaker will enforce that customer data stay within the AWS network.\n  Amazon SageMaker private access using AWS PrivateLink is available in all AWS Regions where Amazon SageMaker Unified Studio is supported, including: Asia Pacific (Tokyo), Europe (Ireland), US East (N. Virginia), US East (Ohio), US West (Oregon), Europe (Frankfurt), South America (São Paulo), Asia Pacific (Seoul), Europe (London), Asia Pacific (Singapore), Asia Pacific (Sydney), Canada (Central), Asia Pacific (Mumbai), Europe (Paris), Europe (Stockholm)\n  To learn more, visit Amazon SageMaker then get started with the network isolation documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-sagemaker-unified-studio-aws-privatelink/",
      "pubDate": "2026-01-30T19:08:00.000Z",
      "source": "whatsNew",
      "services": [
        "sagemaker",
        "unified studio",
        "iam"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "unified studio",
        "iam",
        "ga",
        "support",
        "new-capability"
      ]
    },
    {
      "id": "aws-news-d2c43410cffb",
      "title": "Simplify ModelOps with Amazon SageMaker AI Projects using Amazon S3-based templates",
      "description": "This post explores how you can use Amazon S3-based templates to simplify ModelOps workflows, walk through the key benefits compared to using Service Catalog approaches, and demonstrates how to create a custom ModelOps solution that integrates with GitHub and GitHub Actions—giving your team one-click provisioning of a fully functional ML environment.",
      "link": "https://aws.amazon.com/blogs/machine-learning/simplify-modelops-with-amazon-sagemaker-ai-projects-using-amazon-s3-based-templates/",
      "pubDate": "2026-01-30T17:18:57.000Z",
      "source": "mlBlog",
      "services": [
        "sagemaker",
        "s3"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "s3"
      ]
    },
    {
      "id": "aws-news-5dbb9c1d438d",
      "title": "Power up your analytics with Amazon SageMaker Unified Studio integration with Tableau, Power BI, and more",
      "description": "In this post, we guide you through connecting various analytics tools to Amazon SageMaker Unified Studio using the Athena JDBC driver, enabling seamless access to your subscribed data within your Amazon SageMaker Unified Studio projects.",
      "link": "https://aws.amazon.com/blogs/big-data/power-up-your-analytics-with-amazon-sagemaker-unified-studio-integration-with-tableau-power-bi-and-more/",
      "pubDate": "2026-01-22T17:26:09.000Z",
      "source": "bigDataBlog",
      "services": [
        "sagemaker",
        "unified studio",
        "athena"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "unified studio",
        "athena",
        "integration"
      ]
    },
    {
      "id": "aws-news-bdcf392e064f",
      "title": "Accelerate context-aware data analysis and ML workflows with Amazon SageMaker Data Agent",
      "description": "In this post, we demonstrate the capabilities of SageMaker Data Agent, discuss the challenges it addresses, and explore a real-world example analyzing New York City taxi trip data to see the agent in action.",
      "link": "https://aws.amazon.com/blogs/big-data/accelerate-context-aware-data-analysis-and-ml-workflows-with-amazon-sagemaker-data-agent/",
      "pubDate": "2026-01-22T17:25:02.000Z",
      "source": "bigDataBlog",
      "services": [
        "sagemaker"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker"
      ]
    },
    {
      "id": "aws-news-92f8ed9bd86b",
      "title": "SageMaker Unified Studio adds cross-Region subscriptions support for IDC based domains",
      "description": "Amazon SageMaker Unified Studio now supports cross-Region subscriptions for comprehensive and flexible data access and governance. With cross-Region support, you can subscribe to AWS Glue tables and views, as well as Amazon Redshift tables and views published in a different AWS Region than your project. This capability helps break down data silos and enable better collaboration across your organization by allowing teams to access curated data assets from any AWS Region without manual replication.\n  To get started with cross-Region subscriptions, log into SageMaker Unified Studio, or use the Amazon DataZone API, SDK, or AWS CLI. Cross-Region subscriptions support is available in all AWS Regions where SageMaker Unified Studio is supported. To learn more, see the SageMaker Unified Studio user guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/sagemaker-unified-studio-adds-cross-region-iam/",
      "pubDate": "2026-01-20T20:59:00.000Z",
      "source": "whatsNew",
      "services": [
        "sagemaker",
        "unified studio",
        "lex",
        "redshift",
        "glue"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "unified studio",
        "lex",
        "redshift",
        "glue",
        "ga",
        "support"
      ]
    }
  ]
}