{
  "lastUpdated": "2025-10-12T06:13:10.551Z",
  "category": "machine-learning",
  "totalItems": 4,
  "items": [
    {
      "id": "aws-news-b060e3f342a5",
      "title": "Amazon SageMaker notebook instance now supports Amazon Linux 2023",
      "description": "Today, we are excited to announce that Amazon SageMaker notebook instance supports Amazon Linux 2023. You can now choose Amazon Linux 2023 for your new Amazon SageMaker notebook instance to take advantage of the latest innovations, enhanced security features.\n  Amazon SageMaker notebook instances are fully managed Jupyter Notebooks with pre-configured development environments for data science and machine learning. Data scientists and developers can use SageMaker Notebooks to interactively explore, visualize and prepare data, and build and deploy machine learning models on SageMaker.\n  Amazon Linux 2023 (AL2023) is a general-purpose rpm-based Linux distribution and successor to Amazon Linux 2 (AL2). Amazon Linux 2023 simplifies operating system management through its secure, stable, and high-performance runtime environment. This Linux distribution follows a predictable two-year major release cycle with five years of long-term support. The first two years provide standard support with quarterly security patches, bug fixes, and new features, followed by three years of maintenance. Enhanced security features include SELinux support and FIPS 140-3 validation for cryptographic modules.\n  With this you now have the options to launch a notebook instance with AL2023 or AL2. For more details about this launch and instructions on how to get started with AL2023 notebook instances, please refer to the Amazon Linux 2023 documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-sagemaker-notebook-instance-amazon-linux-2023/",
      "pubDate": "2025-10-09T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "nova",
        "sagemaker"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "nova",
        "sagemaker",
        "launch",
        "new-feature",
        "support"
      ]
    },
    {
      "id": "aws-news-a90e2c47c482",
      "title": "Implement a secure MLOps platform based on Terraform and GitHub",
      "description": "Machine learning operations (MLOps) is the combination of people, processes, and technology to productionize ML use cases efficiently. To achieve this, enterprise customers must develop MLOps platforms to support reproducibility, robustness, and end-to-end observability of the ML use case’s lifecycle. Those platforms are based on a multi-account setup by adopting strict security constraints, development best […]",
      "link": "https://aws.amazon.com/blogs/machine-learning/implement-a-secure-mlops-platform-based-on-terraform-and-github/",
      "pubDate": "2025-10-08T15:38:36.000Z",
      "source": "mlBlog",
      "services": [],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "support"
      ]
    },
    {
      "id": "aws-news-d8c99e49be3f",
      "title": "Modernize fraud prevention: GraphStorm v0.5 for real-time inference",
      "description": "In this post, we demonstrate how to implement real-time fraud prevention using GraphStorm v0.5's new capabilities for deploying graph neural network (GNN) models through Amazon SageMaker. We show how to transition from model training to production-ready inference endpoints with minimal operational overhead, enabling sub-second fraud detection on transaction graphs with billions of nodes and edges.",
      "link": "https://aws.amazon.com/blogs/machine-learning/modernize-fraud-prevention-graphstorm-v0-5-for-real-time-inference/",
      "pubDate": "2025-09-30T20:29:46.000Z",
      "source": "mlBlog",
      "services": [
        "sagemaker"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker"
      ]
    },
    {
      "id": "aws-news-33355eceeb89",
      "title": "Use Apache Airflow workflows to orchestrate data processing on Amazon SageMaker Unified Studio",
      "description": "Orchestrating machine learning pipelines is complex, especially when data processing, training, and deployment span multiple services and tools. In this post, we walk through a hands-on, end-to-end example of developing, testing, and running a machine learning (ML) pipeline using workflow capabilities in Amazon SageMaker, accessed through the Amazon SageMaker Unified Studio experience. These workflows are powered by Amazon Managed Workflows for Apache Airflow.",
      "link": "https://aws.amazon.com/blogs/big-data/use-apache-airflow-workflows-to-orchestrate-data-processing-on-amazon-sagemaker-unified-studio/",
      "pubDate": "2025-09-22T16:56:56.000Z",
      "source": "bigDataBlog",
      "services": [
        "sagemaker",
        "unified studio",
        "lex"
      ],
      "categories": [
        "machine-learning"
      ],
      "tags": [
        "sagemaker",
        "unified studio",
        "lex"
      ]
    }
  ]
}