{
  "lastUpdated": "2025-12-05T06:16:49.946Z",
  "category": "natural-language",
  "totalItems": 6,
  "items": [
    {
      "id": "aws-news-3bcc932fc880",
      "title": "AWS Lambda announces durable functions for multi-step applications and AI workflows",
      "description": "AWS Lambda announces durable functions, enabling developers to build reliable multi-step applications and AI workflows within the Lambda developer experience. Durable functions automatically checkpoint progress, suspend execution for up to one year during long-running tasks, and recover from failures - all without requiring you to manage additional infrastructure or write custom state management and error handling code.\n  Customers use Lambda for the simplicity of its event-driven programming model and built-in integrations. While traditional Lambda functions excel at handling single, short-lived tasks, developers building complex multi-step applications, such as order processing, user onboarding, and AI-assisted workflows, previously needed to implement custom state management logic or integrate with external orchestration services. Lambda durable functions address this opportunity by extending the Lambda programming model with new operations like \"steps\" and \"waits\" that let you checkpoint progress and pause execution without incurring compute charges. The service handles state management, error recovery, and efficient pausing and resuming of long-running tasks, allowing you to focus on your core business logic.\n  Lambda durable functions are generally available in US East (Ohio) with support for Python (versions 3.13 and 3.14) and Node.js (versions 22 and 24) runtimes. For the latest region availability, visit the AWS Capabilities by Region page.\n  You can activate durable functions for new Python or Node.js based Lambda functions using the AWS Lambda API, AWS Management Console, AWS Command Line Interface (AWS CLI), AWS Cloud Formation, AWS Serverless Application Model (AWS SAM), AWS SDK, and AWS Cloud Development Kit (AWS CDK). For more information on durable functions, visit the AWS Lambda Developer Guide and launch blog post. To learn about pricing, visit AWS Lambda pricing.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/lambda-durable-multi-step-applications-ai-workflows/",
      "pubDate": "2025-12-02T13:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "lambda"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "lambda",
        "launch",
        "generally-available",
        "integration",
        "support"
      ]
    },
    {
      "id": "aws-news-97b700bfdba5",
      "title": "Amazon Connect adds support for third-party speech-to-text and text-to-speech AI models for end-customer self-service",
      "description": "Amazon Connect now supports third-party speech providers for end-customer self-service, giving you greater flexibility in how you deliver voice experiences. You can integrate Deepgram for speech-to-text and ElevenLabs for text-to-speech directly within Amazon Connect, using them together with Amazon Connect's native speech capabilities, built-in orchestration, analytics, and compliance controls.\n  This feature is available with Amazon Connect unlimited AI and in all commercial AWS regions where Amazon Connect is offered. For more information, see the Amazon Connect Administrator Guide. To learn more about Amazon Connect, the AWS cloud-based contact center, please visit the Amazon Connect website.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/amazon-connect-third-party-speech-to-text-to-speech-ai-models",
      "pubDate": "2025-11-30T18:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "support"
      ]
    },
    {
      "id": "aws-news-647095c77582",
      "title": "AWS announces preview of AWS Interconnect - multicloud",
      "description": "AWS announces preview of AWS Interconnect - multicloud, providing simple, resilient, high-speed private connections to other cloud service providers (CSPs), starting in preview with Google Cloud as the first launch partner and then with Microsoft Azure later in 2026.\n  Customers have been adopting multicloud strategies while migrating more applications to the cloud. They do so for many reasons including interoperability requirements, the freedom to choose technology that best suits their needs, and the ability to build and deploy applications on any environment with greater ease and speed. Previously, when interconnecting workloads across multiple cloud providers, customers had to go the route of a ‘do-it-yourself’ multicloud approach, leading to complexities of managing global multi-layered networks at scale. AWS Interconnect - multicloud is the first purpose-built product of its kind and a new way of how clouds connect and talk to each other. It enables customers to quickly establish private, secure, high-speed network connections with dedicated bandwidth and built-in resiliency between their Amazon VPCs and other cloud environments. Interconnect - multicloud makes it easy to connect AWS networking services such as AWS Transit Gateway, AWS Cloud WAN, and Amazon VPC to other Cloud Service Providers (CSPs) quickly, instead of weeks or months.\n  Interconnect - multicloud is available in preview in five AWS Regions. You can enable this capability using the AWS Management Console. CSPs can also easily adopt via a published open API package on GitHub. For more information, see the AWS Interconnect - multicloud documentation pages.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/preview-aws-interconnect-multicloud/",
      "pubDate": "2025-11-30T08:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "eks"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "eks",
        "launch",
        "preview",
        "ga"
      ]
    },
    {
      "id": "aws-news-f2d713a3e108",
      "title": "AWS announces gated preview of AWS Interconnect - last mile",
      "description": "AWS launches AWS Interconnect - last mile, a fully managed connectivity offering that allows customers to connect their branch offices, data centers, and remote locations to AWS with just a few clicks, eliminating the friction of discovering partners and the complexity of network setup. As a milestone collaboration between AWS and Lumen, AWS Interconnect - last mile combines AWS cloud innovation with Lumen’s extensive network footprint to redefine how businesses connect to the cloud.\n  Customers can now instantly establish private, high-speed connections to AWS by simply entering their location, selecting bandwidth, and choosing their AWS Region. The launch simplifies the connectivity experience by automating complex network configuration including BGP peering, VLAN configuration, and ASN assignment. Customers can dynamically scale bandwidth from 1 Gbps to 100 Gbps through the AWS console and benefit from zero down-time maintenance. The service is architected for high availability and backed by SLAs. MACsec encryption is enabled by default for enhanced security between AWS Direct Connect and partner devices.\n  AWS Interconnect - last mile is available as a gated preview through Lumen, our launch partner, for customers in US starting today. Request access here.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/11/gated-preview-interconnect-last-mile/",
      "pubDate": "2025-11-30T08:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "nova",
        "lex"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "nova",
        "lex",
        "launch",
        "preview",
        "ga"
      ]
    },
    {
      "id": "aws-news-7d35cf5f9ae9",
      "title": "Enhancing API security with Amazon API Gateway TLS security policies",
      "description": "In this post, you will learn how the new Amazon API Gateway’s enhanced TLS security policies help you meet standards such as PCI DSS, Open Banking, and FIPS, while strengthening how your APIs handle TLS negotiation. This new capability increases your security posture without adding operational complexity, and provides you with a single, consistent way to standardize TLS configuration across your API Gateway infrastructure.",
      "link": "https://aws.amazon.com/blogs/compute/enhancing-api-security-with-amazon-api-gateway-tls-security-policies/",
      "pubDate": "2025-11-21T21:17:52.000Z",
      "source": "computeBlog",
      "services": [
        "lex",
        "rds",
        "api gateway"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "rds",
        "api gateway",
        "ga",
        "new-capability"
      ]
    },
    {
      "id": "aws-news-11d98a88cbe1",
      "title": "Implement monitoring for Amazon EKS with managed services",
      "description": "In this post, we show you how to implement comprehensive monitoring for Amazon Elastic Kubernetes Service (Amazon EKS) workloads using AWS managed services. This solution demonstrates building an EKS platform that combines flexible compute options with enterprise-grade observability using AWS native services and OpenTelemetry.",
      "link": "https://aws.amazon.com/blogs/architecture/implement-monitoring-for-amazon-eks-with-managed-services/",
      "pubDate": "2025-07-18T15:47:13.000Z",
      "source": "architectureBlog",
      "services": [
        "lex",
        "eks"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "eks"
      ]
    }
  ]
}