{
  "lastUpdated": "2026-01-22T06:18:54.913Z",
  "category": "natural-language",
  "totalItems": 10,
  "items": [
    {
      "id": "aws-news-75137c1ba3c1",
      "title": "Instance Scheduler on AWS adds enhanced scaling, reliability, and event-driven automation",
      "description": "Today AWS announced enhanced scheduling orchestration to track AWS tagging events, self-service troubleshooting via informational resource tags, an optional EC2 insufficient-capacity retry flow using alternate instance types, and automatic creation of a dedicated EventBridge bus for scheduling events for Instance Scheduler (IS) on AWS. IS’s orchestration and fan-out mechanisms have been re-architected to enable customers to track AWS tagging events, allowing the product to more intelligently sequence and distribute scheduling operations - improving scaling performance and addressing cost-scaling concerns. The product now enables distributed cloud engineer personas to perform self-service troubleshooting in their spoke accounts through informational tags applied to their resources without relying on a central cloud administrator. In addition, an optional Insufficient Capacity Error Retry flow has been added to automatically retry failed start actions using alternate instance types when EC2 encounters insufficient capacity errors, ensuring workloads start reliably even in constrained Availability Zones or regions. Lastly, Instance Scheduler on AWS now automatically creates a dedicated EventBus for scheduling-related events, streamlining integrations and automation workflows.\n \nThis update improves Instance Scheduler’s scalability, reduces operational overhead, and increases workload reliability across complex customer environments. You can accelerate issue resolution and boost operational efficiency by empowering distributed cloud engineers to troubleshoot independently. You can enhance overall workload resilience by improving handling of EC2 capacity shortages and simplify integrations by streamlining event routing through the new EventBus to support more extensible automation workflows.\n \nTo learn more about Instance Scheduler, visit the Product Page or contact your AWS account team.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/instance-scheduler-adds-enhanced-scaling/",
      "pubDate": "2026-01-21T15:48:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "ec2",
        "eventbridge"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "ec2",
        "eventbridge",
        "update",
        "integration",
        "support"
      ]
    },
    {
      "id": "aws-news-3827f9e1cb7a",
      "title": "Amazon EVS now supports VCF and VMware ESX software version selection",
      "description": "Amazon Elastic VMware Service (Amazon EVS) now supports the ability to specify supported combinations of VMware Cloud Foundation (VCF) and ESX software versions when setting up your EVS environments and hosts.\n \nAmazon EVS lets you run VCF natively within your Amazon Virtual Private Cloud (VPC), powered by AWS Nitro EC2 bare-metal instances. Amazon EVS automates deployment of a complete VCF environment in hours using either an intuitive step-by-step configuration workflow on the AWS console or the AWS Command Line Interface (CLI). This newest enhancement addresses the critical need for version flexibility to help you migrate workloads to AWS faster, reduce operational complexity and risk, and meet data center exit deadlines with Amazon EVS.\n \nWith software versioning support, you can now specify a VCF version when creating new environments using the CreateEnvironment API and select an ESX version when adding new hosts to existing environments using the CreateEnvironmentHost API. You can also query supported version combinations with the new GetVersions API. As part of this capability, we're also adding support for new environment deployments with VCF 5.2.2.\n  \nTo get started, visit the Amazon EVS product detail page and user guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-evs-vcf-vmware-esx-software-version",
      "pubDate": "2026-01-20T08:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "ec2"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "ec2",
        "enhancement",
        "support"
      ]
    },
    {
      "id": "aws-news-441e607bd84f",
      "title": "Unlock granular resource control with queue-based QMR in Amazon Redshift Serverless",
      "description": "With Amazon Redshift Serverless queue-based Query Monitoring Rules (QMR), administrators can define workload-aware thresholds and automated actions at the queue level—a significant improvement over previous workgroup-level monitoring. You can create dedicated queues for distinct workloads such as BI reporting, ad hoc analysis, or data engineering, then apply queue-specific rules to automatically abort, log, or restrict queries that exceed execution-time or resource-consumption limits. By isolating workloads and enforcing targeted controls, this approach protects mission-critical queries, improves performance predictability, and prevents resource monopolization—all while maintaining the flexibility of a serverless experience. In this post, we discuss how you can implement your workloads with query queues in Redshift Serverless.",
      "link": "https://aws.amazon.com/blogs/big-data/unlock-granular-resource-control-with-queue-based-qmr-in-amazon-redshift-serverless/",
      "pubDate": "2026-01-15T16:29:47.000Z",
      "source": "bigDataBlog",
      "services": [
        "lex",
        "redshift"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "redshift",
        "improvement"
      ]
    },
    {
      "id": "aws-news-576b2199ce20",
      "title": "Amazon Lex launches improved speech recognition models for English",
      "description": "Amazon Lex now offers a neural automatic speech recognition (ASR) model for English that delivers improved recognition accuracy for your voice bots. Trained on data from multiple English locales, the model excels at recognizing conversational speech patterns across diverse speaking styles, including non-native English speakers and regional accents. This reduces the need for end-customers to repeat themselves and improves self-service success rates. To enable this feature, select \"Neural\" as the speech recognition option in your bot's locale settings.\n  This feature is available in all AWS commercial regions where Amazon Connect and Lex operate. To learn more, visit the Amazon Lex documentation or explore the Amazon Connect website to learn how Amazon Connect and Amazon Lex deliver seamless end-customer self-service experiences.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-lex-improved-speech-recognition-models-english",
      "pubDate": "2026-01-13T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "launch"
      ]
    },
    {
      "id": "aws-news-dfe386ee3ced",
      "title": "Amazon Lex launches configurable voice activity detection sensitivity",
      "description": "Amazon Lex now provides three VAD sensitivity levels that can be configured for each bot locale: Default, High, and Maximum. The Default setting is suitable for most environments with typical background noise levels. High is designed for environments with consistent but moderate noise levels, such as busy offices or retail spaces. Maximum provides the highest tolerance for very noisy environments such as manufacturing floors, construction sites, or outdoor locations with significant ambient noise. You can configure VAD sensitivity when creating or updating a bot locale in the Amazon Connect's Conversational AI designer.\n \nThis feature is available in all AWS commercial regions where Amazon Connect and Lex operate. To learn more, visit the Amazon Lex documentation or explore the Amazon Connect website to learn how Amazon Connect and Amazon Lex deliver seamless end-customer self-service experiences.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-lex-configurable-voice-activity-detection-sensitivity/",
      "pubDate": "2026-01-12T18:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "launch"
      ]
    },
    {
      "id": "aws-news-0b63de0733e4",
      "title": "Amazon EC2 R8i and R8i-flex instances are now available in additional AWS regions",
      "description": "Starting today, Amazon Elastic Compute Cloud (Amazon EC2) R8i and R8i-flex instances are available in the Asia Pacific (Mumbai, Hyderabad) and Europe (Paris) regions. These instances are powered by custom Intel Xeon 6 processors, available only on AWS, delivering the highest performance and fastest memory bandwidth among comparable Intel processors in the cloud. The R8i and R8i-flex instances offer up to 15% better price-performance, and 2.5x more memory bandwidth compared to previous generation Intel-based instances. They deliver 20% higher performance than R7i instances, with even higher gains for specific workloads. They are up to 30% faster for PostgreSQL databases, up to 60% faster for NGINX web applications, and up to 40% faster for AI deep learning recommendation models compared to R7i.\n  R8i-flex, our first memory-optimized Flex instances, are the easiest way to get price performance benefits for a majority of memory-intensive workloads. They offer the most common sizes, from large to 16xlarge, and are a great first choice for applications that don't fully utilize all compute resources.\n  R8i instances are a great choice for all memory-intensive workloads, especially for workloads that need the largest instance sizes or continuous high CPU usage. R8i instances offer 13 sizes including 2 bare metal sizes and the new 96xlarge size for the largest applications. R8i instances are SAP-certified and deliver 142,100 aSAPS, delivering exceptional performance for mission-critical SAP workloads.\n  To get started, sign in to the AWS Management Console. For more information about the R8i and R8i-flex instances visit the AWS News blog.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-ec2-r8i-r8i-flex-instances-additional-aws-regions",
      "pubDate": "2026-01-08T18:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "ec2"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "ec2",
        "ga",
        "now-available"
      ]
    },
    {
      "id": "aws-news-122931709b9f",
      "title": "Amazon EC2 C8i and C8i-flex instances are now available in additional AWS regions",
      "description": "Starting today, Amazon Elastic Compute Cloud (Amazon EC2) C8i and C8i-flex instances are available in the Asia Pacific (Mumbai), Asia Pacific (Seoul), and Asia Pacific (Tokyo) regions. These instances are powered by custom Intel Xeon 6 processors, available only on AWS, delivering the highest performance and fastest memory bandwidth among comparable Intel processors in the cloud. These C8i and C8i-flex instances offer up to 15% better price-performance, and 2.5x more memory bandwidth compared to previous generation Intel-based instances. They deliver up to 20% higher performance than C7i and C7i-flex instances, with even higher gains for specific workloads. The C8i and C8i-flex are up to 60% faster for NGINX web applications, up to 40% faster for AI deep learning recommendation models, and 35% faster for Memcached stores compared to C7i and C7i-flex.\n  C8i-flex are the easiest way to get price performance benefits for a majority of compute intensive workloads like web and application servers, databases, caches, Apache Kafka, Elasticsearch, and enterprise applications. They offer the most common sizes, from large to 16xlarge, and are a great first choice for applications that don't fully utilize all compute resources.\n  C8i instances are a great choice for all memory-intensive workloads, especially for workloads that need the largest instance sizes or continuous high CPU usage. C8i instances offer 13 sizes including 2 bare metal sizes and the new 96xlarge size for the largest applications.\n  To get started, sign in to the AWS Management Console. Customers can purchase these instances via Savings Plans, On-Demand instances, and Spot instances. For more information about the new C8i and C8i-flex instances visit the AWS News blog.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-ec2-c8i-c8i-flex-instances-additional-aws-regions",
      "pubDate": "2026-01-07T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "ec2",
        "kafka"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "ec2",
        "kafka",
        "ga",
        "now-available"
      ]
    },
    {
      "id": "aws-news-354d826c5819",
      "title": "Amazon Connect now provides the capability to store nested JSON object and looping arrays",
      "description": "Amazon Connect now enables you to store and work with complex data structures in your flows, making it easy to build dynamic automated experiences that use rich information returned from your internal business systems. You can save complete data records, including nested JSON objects and lists, and reference specific elements within them, such as a particular order from a list of orders returned in JSON format.\n  Additionally, you can automatically loop through lists of items in your customer service flows, moving through each entry in sequence while tracking the current position in the loop. This allows you to easily access item-level details and present relevant information to end-customers. For example, a travel agency can retrieve all of a customer’s itineraries in a single request and guide the caller through each booking to review or update their reservations. A bank can similarly walk customers through recent transactions one by one using data retrieved securely from its systems. These capabilities reduce the need for repeated calls to your business systems, simplify workflow design, and make it easier to deliver advanced automated experiences that adapt as your business requirements evolve.\n  To learn more about these features, see the Amazon Connect Administrator Guide. These features are available in all AWS regions where Amazon Connect is available. To learn more about Amazon Connect, AWS’s AI-native customer experience solution, please visit the Amazon Connect website.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-connect-nested-json-object-looping-arrays",
      "pubDate": "2026-01-02T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "rds"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "rds",
        "update"
      ]
    },
    {
      "id": "aws-news-047fc4a05d74",
      "title": "AWS Secrets Manager announces improved secret sorting capabilities",
      "description": "Today, AWS Secrets Manager announces enhanced secret sorting capabilities in the Secrets Manager console and for ListSecrets API. You can now sort secrets by name, last changed date, last accessed date, and creation date—expanding beyond the previous creation date-only option.\n  Secrets Manager is a fully managed service that helps you manage, retrieve, and rotate database credentials, application credentials, API keys, and other secrets throughout their lifecycles. This enhancement improves secret discovery by providing flexible sorting options across multiple dimensions through both Secrets Manager console and APIs.\n  The new sorting capabilities are available in Secrets Manager console and ListSecrets API in all AWS commercial and AWS GovCloud (US) Regions. For a list of regions where Secrets Manager is available, see the AWS Region table.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/12/aws-secrets-manager-secret-sorting-capabilities",
      "pubDate": "2025-12-23T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "secrets manager"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "secrets manager",
        "enhancement"
      ]
    },
    {
      "id": "aws-news-7d35cf5f9ae9",
      "title": "Enhancing API security with Amazon API Gateway TLS security policies",
      "description": "In this post, you will learn how the new Amazon API Gateway’s enhanced TLS security policies help you meet standards such as PCI DSS, Open Banking, and FIPS, while strengthening how your APIs handle TLS negotiation. This new capability increases your security posture without adding operational complexity, and provides you with a single, consistent way to standardize TLS configuration across your API Gateway infrastructure.",
      "link": "https://aws.amazon.com/blogs/compute/enhancing-api-security-with-amazon-api-gateway-tls-security-policies/",
      "pubDate": "2025-11-21T21:17:52.000Z",
      "source": "computeBlog",
      "services": [
        "lex",
        "rds",
        "api gateway"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "rds",
        "api gateway",
        "ga",
        "new-capability"
      ]
    }
  ]
}