{
  "lastUpdated": "2026-02-14T06:30:23.081Z",
  "category": "natural-language",
  "totalItems": 8,
  "items": [
    {
      "id": "aws-news-32455357f2c9",
      "title": "Amazon RDS now supports backup configuration when restoring snapshots",
      "description": "Amazon Relational Database Service (RDS) and Amazon Aurora now offer greater flexibility for restore operations to view and modify backup retention period and preferred backup window prior to and upon restoring database snapshots. The backup retention period lets you specify how many days backups are retained, while the preferred backup window allows you to set your desired backup schedule.\n  Previously, restored database instances and clusters inherited backup parameter values from snapshot metadata and could only be modified after restore was complete. This launch introduces two enhancements - you can now view the backup retention period and preferred backup window settings as part of automated backups and snapshots, providing visibility into backup configurations before initiating restore operation. Additionally, you can now specify or modify the backup retention period and preferred backup window when restoring database instances and clusters, eliminating the need to modify the instance or cluster after restoration.\n  These enhancements are available for all Amazon RDS database engines (MySQL, PostgreSQL, MariaDB, Oracle, SQL Server, and DB2) and Amazon Aurora (MySQL-Compatible and PostgreSQL-Compatible editions) in all AWS commercial regions and AWS GovCloud (US) regions where RDS and Aurora are supported and respective database engines are available. You can use these features through the AWS Management Console, AWS Command Line Interface (CLI), and AWS SDKs at no additional cost. For more information, see Amazon RDS and Amazon Aurora User Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/02/rds-aurora-backup-configuration-restoring-snapshots/",
      "pubDate": "2026-02-13T13:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "rds"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "rds",
        "launch",
        "enhancement",
        "support"
      ]
    },
    {
      "id": "aws-news-22def9800bc5",
      "title": "Amazon Athena adds 1-minute reservations and new capacity control features",
      "description": "Amazon Athena is a serverless interactive query service that makes it easy to analyze data using SQL. With Athena, there’s no infrastructure to manage, you simply submit queries and get results. Capacity Reservations is a feature of Athena that addresses the need to run critical workloads by providing dedicated serverless capacity for workloads you specify. In this post, we highlight three new capabilities that make Capacity Reservations more flexible and easier to manage: reduced minimums for fine-grained capacity adjustments, an autoscaling solution for dynamic workloads, and capacity cost and performance controls.",
      "link": "https://aws.amazon.com/blogs/big-data/amazon-athena-adds-1-minute-reservations-and-new-capacity-control-features/",
      "pubDate": "2026-02-11T22:16:01.000Z",
      "source": "bigDataBlog",
      "services": [
        "lex",
        "athena"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "athena"
      ]
    },
    {
      "id": "aws-news-9bbc90812487",
      "title": "Amazon EC2 R8i and R8i-flex instances are now available in additional AWS regions",
      "description": "Starting today, Amazon Elastic Compute Cloud (Amazon EC2) R8i and R8i-flex instances are available in the Asia Pacific (New Zealand) and Middle East (UAE) regions. These instances are powered by custom Intel Xeon 6 processors, available only on AWS, delivering the highest performance and fastest memory bandwidth among comparable Intel processors in the cloud. The R8i and R8i-flex instances offer up to 15% better price-performance, and 2.5x more memory bandwidth compared to previous generation Intel-based instances. They deliver 20% higher performance than R7i instances, with even higher gains for specific workloads. They are up to 30% faster for PostgreSQL databases, up to 60% faster for NGINX web applications, and up to 40% faster for AI deep learning recommendation models compared to R7i.\n  R8i-flex, our first memory-optimized Flex instances, are the easiest way to get price performance benefits for a majority of memory-intensive workloads. They offer the most common sizes, from large to 16xlarge, and are a great first choice for applications that don't fully utilize all compute resources.\n  R8i instances are a great choice for all memory-intensive workloads, especially for workloads that need the largest instance sizes or continuous high CPU usage. R8i instances offer 13 sizes including 2 bare metal sizes and the new 96xlarge size for the largest applications. R8i instances are SAP-certified and deliver 142,100 aSAPS, delivering exceptional performance for mission-critical SAP workloads.\n  To get started, sign in to the AWS Management Console. For more information about the R8i and R8i-flex instances visit the AWS News blog.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/02/amazon-ec2-r8i-r8i-flex-instances-AKL-DXB-region/",
      "pubDate": "2026-02-11T17:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "ec2"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "ec2",
        "ga",
        "now-available"
      ]
    },
    {
      "id": "aws-news-a0980a66101f",
      "title": "Amazon EC2 C8i and C8i-flex instances are now available in Europe (Paris), Canada (Central), and US West (N. California) regions",
      "description": "Starting today, Amazon Elastic Compute Cloud (Amazon EC2) C8i and C8i-flex instances are available in the Europe (Paris), Canada (Central), and US West (N. California) regions. These instances are powered by custom Intel Xeon 6 processors, available only on AWS, delivering the highest performance and fastest memory bandwidth among comparable Intel processors in the cloud. These C8i and C8i-flex instances offer up to 15% better price-performance, and 2.5x more memory bandwidth compared to previous generation Intel-based instances. They deliver up to 20% higher performance than C7i and C7i-flex instances, with even higher gains for specific workloads. The C8i and C8i-flex are up to 60% faster for NGINX web applications, up to 40% faster for AI deep learning recommendation models, and 35% faster for Memcached stores compared to C7i and C7i-flex.\n  C8i-flex are the easiest way to get price performance benefits for a majority of compute intensive workloads like web and application servers, databases, caches, Apache Kafka, Elasticsearch, and enterprise applications. They offer the most common sizes, from large to 16xlarge, and are a great first choice for applications that don't fully utilize all compute resources.\n  C8i instances are a great choice for all memory-intensive workloads, especially for workloads that need the largest instance sizes or continuous high CPU usage. C8i instances offer 13 sizes including 2 bare metal sizes and the new 96xlarge size for the largest applications.\n  To get started, sign in to the AWS Management Console. Customers can purchase these instances via Savings Plans, On-Demand instances, and Spot instances. For more information about the new C8i and C8i-flex instances visit the AWS News blog.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/02/amazon-ec2-c8i-c8i-flex-instances-europe-paris-canada-central-uswest-ncalifornia-regions",
      "pubDate": "2026-02-11T17:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "ec2",
        "kafka"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "ec2",
        "kafka",
        "ga",
        "now-available"
      ]
    },
    {
      "id": "aws-news-422f564cfc67",
      "title": "Automated Reasoning checks rewriting chatbot reference implementation",
      "description": "This blog post dives deeper into the implementation architecture for the Automated Reasoning checks rewriting chatbot.",
      "link": "https://aws.amazon.com/blogs/machine-learning/automated-reasoning-checks-rewriting-chatbot-reference-implementation/",
      "pubDate": "2026-02-09T19:34:05.000Z",
      "source": "mlBlog",
      "services": [],
      "categories": [
        "natural-language"
      ],
      "tags": []
    },
    {
      "id": "aws-news-6515e8f8245f",
      "title": "Amazon Connect Cases now supports CSV uploads to map related field options",
      "description": "Amazon Connect Cases now supports using a CSV file to define which field options appear based on other field values, making it easier to configure complex field relationships on case templates. Instead of manually defining valid options — such as applicable defect types based on product category — admins can upload a file to define these relationships at scale, reducing onboarding effort and configuration time.\n  Amazon Connect Cases is available in the following AWS regions: US East (N. Virginia), US West (Oregon), Canada (Central), Europe (Frankfurt), Europe (London), Asia Pacific (Seoul), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), and Africa (Cape Town) AWS regions. To learn more and get started, visit the Amazon Connect Cases webpage and documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/02/amazon-connect-cases-csv-related-field-options",
      "pubDate": "2026-02-06T08:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-244a6a9a1248",
      "title": "AWS Network Firewall announces new price reductions",
      "description": "AWS Network Firewall has introduced two pricing improvements for customers. The service has added the hourly and data processing discounts on NAT Gateways that are service-chained with Network Firewall secondary endpoints. Additionally, AWS Network Firewall has removed additional data processing charges for Advanced Inspection, which enables Transport Layer Security (TLS) inspection of encrypted network traffic.\n \nPreviously, NAT Gateway discounts were limited to primary Network Firewall endpoints, and customers paid additional data processing charges when using Advanced Inspection for TLS inspection in select AWS regions. With these improvements, the NAT Gateway discounts now apply when service-chained with both primary and secondary firewall endpoints. Customers also no longer pay the additional data processing charge for Advanced Inspection that ranged from $0.001/GB to $0.009/GB in 13 AWS regions: Middle East (Bahrain), Asia Pacific (Hong Kong), Asia Pacific (Tokyo), Asia Pacific (Osaka), Asia Pacific (Mumbai), EU (Milan), South America (São Paulo), US West (N. California), Africa (Cape Town), Asia Pacific (Seoul), Asia Pacific (Singapore), Asia Pacific (Sydney), and Asia Pacific (Melbourne).\n \nThese changes help to reduce costs for architectures that use Network Firewall's multiple VPC endpoint capability and TLS inspection features. Multiple VPC endpoints allow you to connect 50 VPCs per Availability Zone to a single Network Firewall, helping to reduce operational complexity and lower costs as you protect more VPCs. By removing additional data processing charges when using Advanced Inspection, customers can now implement TLS inspection more cost-effectively across their network security architecture.\n \nThese pricing improvements are available in all AWS regions where Network Firewall is offered and are applied automatically to eligible configurations. No action is required from customers.\n \nTo learn more, see AWS Network Firewall pricing and the AWS Network Firewall service documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2026/02/aws-network-firewall-new-price-reduction/",
      "pubDate": "2026-02-06T08:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "ga",
        "improvement"
      ]
    },
    {
      "id": "aws-news-7d35cf5f9ae9",
      "title": "Enhancing API security with Amazon API Gateway TLS security policies",
      "description": "In this post, you will learn how the new Amazon API Gateway’s enhanced TLS security policies help you meet standards such as PCI DSS, Open Banking, and FIPS, while strengthening how your APIs handle TLS negotiation. This new capability increases your security posture without adding operational complexity, and provides you with a single, consistent way to standardize TLS configuration across your API Gateway infrastructure.",
      "link": "https://aws.amazon.com/blogs/compute/enhancing-api-security-with-amazon-api-gateway-tls-security-policies/",
      "pubDate": "2025-11-21T21:17:52.000Z",
      "source": "computeBlog",
      "services": [
        "lex",
        "rds",
        "api gateway"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "rds",
        "api gateway",
        "ga",
        "new-capability"
      ]
    }
  ]
}