{
  "lastUpdated": "2025-10-26T06:13:38.592Z",
  "category": "natural-language",
  "totalItems": 12,
  "items": [
    {
      "id": "aws-news-f902e3002218",
      "title": "AWS Transfer Family now supports changing identity provider type on a server",
      "description": "AWS Transfer Family now enables you to change your server's identity provider (IdP) type without service interruption. This enhancement gives you more control and flexibility over authentication management in your file transfer workflows, enabling you to adapt quickly to changing business requirements.\n  AWS Transfer Family provides fully managed file transfers over SFTP, FTP, FTPS, AS2, and web-browser based interfaces. With this launch, you can now dynamically switch between service managed authentication, Active Directory, and custom IdP configurations for SFTP, FTPS, and FTP servers. This enables you to implement zero-downtime authentication migration and meet evolving compliance requirements. \n  Changing IDP type is available in all AWS Regions where the service is available. To learn more, visit the Transfer Family User Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-transfer-family-changing-idp-type",
      "pubDate": "2025-10-24T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "launch",
        "enhancement",
        "support"
      ]
    },
    {
      "id": "aws-news-8c07c7c147a6",
      "title": "Amazon Connect now provides granular permissions for conversation recordings and transcripts",
      "description": "Amazon Connect now provides granular permissions to access conversation recordings and transcripts in the UI, giving administrators greater flexibility and security control. Contact center administrators can now separately configure access to recordings and transcripts, allowing users to listen to calls while preventing unauthorized copying of transcripts. The system also provides flexible download controls, enabling users to download redacted recordings while restricting downloads of unredacted versions. Administrators can also create sophisticated permission scenarios, providing access to redacted recordings of sensitive conversations while granting unredacted recording access for other conversations.\n  This feature is available in all regions where Amazon Connect is offered. To learn more, please visit our documentation and our webpage.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-connect-granular-permissions-conversation-recordings-transcripts/",
      "pubDate": "2025-10-23T17:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex"
      ]
    },
    {
      "id": "aws-news-6b8927b02983",
      "title": "Breaking down monolith workflows: Modularizing AWS Step Functions workflows",
      "description": "You can use AWS Step Functions to orchestrate complex business problems. However, as workflows grow and evolve, you can find yourself grappling with monolithic state machines that become increasingly difficult to maintain and update. In this post, we show you strategies for decomposing large Step Functions workflows into modular, maintainable components.",
      "link": "https://aws.amazon.com/blogs/compute/breaking-down-monolith-workflows-modularizing-aws-step-functions-workflows/",
      "pubDate": "2025-10-22T21:02:22.000Z",
      "source": "computeBlog",
      "services": [
        "lex",
        "step functions"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "step functions",
        "update"
      ]
    },
    {
      "id": "aws-news-6264980d4817",
      "title": "Amazon CloudWatch Synthetics now supports bundled multi-check canaries",
      "description": "Amazon CloudWatch Synthetics introduces multi-check blueprints, enabling customers to create comprehensive synthetic tests using simple JSON configuration files. This new feature addresses the challenge many customers face when developing custom scripts for basic endpoint monitoring, which often lack the depth needed for thorough synthetic testing across various check types like HTTP endpoints with different authentication methods, DNS record validation, SSL certificate monitoring, and TCP port checks.\n  With multi-check blueprints, customers can now bundle up to 10 different monitoring steps, one step per endpoint, in a single canary, making API monitoring more cost-effective and easier to implement. The solution provides built-in support for complex assertions on response codes, latency, headers, and body content, along with seamless integration with AWS Secrets Manager for secure credential handling. Customers benefit from detailed step-by-step results and debugging capabilities through the existing CloudWatch Synthetics console, significantly simplifying the process of implementing comprehensive API monitoring compared to writing individual custom canaries for each check. This feature streamlines monitoring workflows, reduces costs, and enhances the overall efficiency of synthetic monitoring setups.\n  Multi-check blueprints are available in all commercial AWS regions where Amazon CloudWatch Synthetics is offered. For pricing details, see Amazon CloudWatch pricing. To learn more about multi-check blueprints and how to get started, see the CloudWatch Synthetics Canaries Blueprints documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-cloudwatch-synthetics-bundled-multi-check-canaries",
      "pubDate": "2025-10-22T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "secrets manager",
        "cloudwatch"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "secrets manager",
        "cloudwatch",
        "new-feature",
        "integration",
        "support"
      ]
    },
    {
      "id": "aws-news-e7f28cce076c",
      "title": "Stifel’s approach to scalable Data Pipeline Orchestration in Data Mesh",
      "description": "Stifel Financial Corp, a diversified financial services holding company is expanding its data landscape that requires an orchestration solution capable of managing increasingly complex data pipeline operations across multiple business domains. Traditional time-based scheduling systems fall short in addressing the dynamic interdependencies between data products, requires event-driven orchestration. Key challenges include coordinating cross-domain dependencies, maintaining data consistency across business units, meeting stringent SLAs, and scaling effectively as data volumes grow. Without a flexible orchestration solution, these issues can lead to delayed business operations and insights, increased operational overhead, and heightened compliance risks due to manual interventions and rigid scheduling mechanisms that cannot adapt to evolving business needs. In this post, we walk through how Stifel Financial Corp, in collaboration with AWS ProServe, has addressed these challenges by building a modular, event-driven orchestration solution using AWS native services that enables precise triggering of data pipelines based on dependency satisfaction, supporting near real-time responsiveness and cross-domain coordination.",
      "link": "https://aws.amazon.com/blogs/big-data/stifels-approach-to-scalable-data-pipeline-orchestration-in-data-mesh/",
      "pubDate": "2025-10-21T21:02:00.000Z",
      "source": "bigDataBlog",
      "services": [
        "lex"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "support"
      ]
    },
    {
      "id": "aws-news-c83bf77ed8b8",
      "title": "Stream mainframe data to AWS in near real time with Precisely and Amazon MSK",
      "description": "In this post, we introduce an alternative architecture to synchronize mainframe data to the cloud using Amazon Managed Streaming for Apache Kafka (Amazon MSK) for greater flexibility and scalability. This event-driven approach provides additional possibilities for mainframe data integration and modernization strategies.",
      "link": "https://aws.amazon.com/blogs/big-data/stream-mainframe-data-to-aws-in-near-real-time-with-precisely-and-amazon-msk/",
      "pubDate": "2025-10-16T18:55:25.000Z",
      "source": "bigDataBlog",
      "services": [
        "lex",
        "kafka",
        "msk"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "kafka",
        "msk",
        "integration"
      ]
    },
    {
      "id": "aws-news-7d6fdbd109cc",
      "title": "AWS SAM CLI adds Finch support, expanding local development tool options for serverless applications",
      "description": "AWS Serverless Application Model Command Line Interface (SAM CLI) now supports Finch as an alternative to Docker for local development and testing of serverless applications. This gives developers greater flexibility in choosing their preferred local development environment when working with SAM CLI to build and test their serverless applications.\n  Developers building serverless applications spend significant time in their local development environments. SAM CLI is a command-line tool for local development and testing of serverless applications. It allows you to build, test, debug, and package your serverless applications locally before deploying to AWS Cloud. To provide the local development and testing environment for your applications, SAM CLI uses a tool that can run containers on your local device. Previously, SAM CLI only supported Docker as the tool for running containers locally. Starting today, SAM CLI also supports Finch as a container development tool. Finch is an open-source tool, developed and supported by AWS, for local container development. This means you can now choose between Docker and Finch as your preferred container tool for local development when working with SAM CLI.\n  You can use SAM CLI to invoke Lambda functions locally, test API endpoints, and debug your serverless applications with the same experience you would have in the AWS Cloud. With Finch support, SAM CLI now automatically detects and uses Finch as the container development tool when Docker is not available. You can also set Finch as your preferred container tool for SAM CLI. This new feature supports all core SAM CLI commands including sam build, sam local invoke, sam local start-api, and sam local start-lambda.\n  To learn more about using SAM CLI with Finch, visit the SAM CLI developer guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-sam-cli-finch-support",
      "pubDate": "2025-10-15T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "lambda"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "lambda",
        "new-feature",
        "support"
      ]
    },
    {
      "id": "aws-news-3eb898c25f1c",
      "title": "Amazon RDS for Oracle zero-ETL integration with Amazon Redshift is now available in 8 additional AWS regions",
      "description": "Amazon RDS for Oracle zero-ETL integration with Amazon Redshift is now available in the Asia Pacific (Hyderabad), Asia pacific (Jakarta), Asia Pacific (Melbourne), Canada West (Calgary), Europe (Spain), Europe (Zurich), Israel (Tel Aviv), and Middle East(UAE) Regions. Amazon RDS for Oracle zero-ETL integration with Amazon Redshift enables near real-time analytics and machine learning (ML) to analyze petabytes of transactional data in Amazon Redshift without complex data pipelines for extract-transform-load (ETL) operations. Within seconds of data being written to an Amazon RDS for Oracle database instance, the data is replicated to Amazon Redshift. Zero-ETL integrations simplify the process of analyzing data from Amazon RDS for Oracle database instances, enabling you to derive holistic insights across multiple applications with ease. \n  You can use the AWS management console, API, CLI, and AWS CloudFormation to create and manage zero-ETL integrations between RDS for Oracle and Amazon Redshift. If you use Oracle multitenant architecture, you can choose specific pluggable databases (PDBs) to selectively replicate them. In addition, you can choose specific tables and tailor replication to your needs.\n  RDS for Oracle zero-ETL integration with Redshift is available with Oracle Database version 19c. To learn more, refer Amazon RDS and Amazon Redshift documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-rds-oracle-zero-etl-integration-redshift-8-regions/",
      "pubDate": "2025-10-15T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "redshift",
        "rds",
        "cloudformation"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "redshift",
        "rds",
        "cloudformation",
        "ga",
        "now-available",
        "integration"
      ]
    },
    {
      "id": "aws-news-af96d7936e65",
      "title": "Amazon AppStream 2.0 announces availability of license included Microsoft applications",
      "description": "Amazon AppStream 2.0 now offers Microsoft applications with licenses included, providing customers with the flexibility to run these applications on AppStream 2.0 fleets. As part of this launch, AppStream 2.0 provides Microsoft Office, Visio, and Project 2021/2024 in both Standard and Professional editions. Each is available in both 32-bit and 64-bit versions for On-Demand and Always-On fleets.\n  Administrators can dynamically control applications availability by adding or removing applications from AppStream 2.0 images and fleets. End users benefit from a seamless experience, accessing Microsoft applications that are fully integrated with their business applications within their AppStream 2.0 sessions. This helps in ensuring that users can work efficiently with both Microsoft and business applications in a unified environment, eliminating the need for switching between different platforms or services.\n  To get started, create an AppStream custom image by launching an image builder with a Windows Server operating system image. Select the desired set of applications to be installed. Then connect to the image builder and complete image creation by following the Amazon AppStream 2.0 Administration Guide. You must use an AppStream 2.0 Image Builder that uses an AppStream 2.0 agent released on or after October 2, 2025 Or, your image must use managed AppStream 2.0 image updates released on or after October 3, 2025.\n  This functionality is generally available in all regions where AppStream 2.0 is offered. Customers are billed per hour for the AppStream streaming resources, and per-user per-month (non-prorated) for Microsoft applications. Please see Amazon AppStream 2.0 Pricing for more information.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-appstream-license-included-apps",
      "pubDate": "2025-10-14T15:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "launch",
        "generally-available",
        "update"
      ]
    },
    {
      "id": "aws-news-abde2effb621",
      "title": "Amazon Connect now provides configurable thresholds for schedule adherence",
      "description": "Amazon Connect now provides configurable thresholds for schedule adherence, giving you more flexibility in how you track agent performance. You can define thresholds for how early or late agents start or end their shifts, as well as for individual activities. For example, agents can start their shift 5 minutes early and end 10 minutes late, or end their breaks 3 minutes late, without negatively impacting their adherence scores. You can further customize these thresholds for individual teams. For example, teams that handle contacts with long handle times can be given more flexibility in when they start their breaks. This launch enables managers to focus on true adherence violations and eliminates the impact of minor schedule deviations on agent performance, thus improving manager productivity and agent satisfaction.\n  This feature is available in all AWS Regions where Amazon Connect agent scheduling is available. To learn more about Amazon Connect agent scheduling, click here.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-connect-configurable-thresholds-schedule-adherence/",
      "pubDate": "2025-10-14T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "launch",
        "ga"
      ]
    },
    {
      "id": "aws-news-cb8062515dfa",
      "title": "Accelerating local serverless development with console to IDE and remote debugging for AWS Lambda",
      "description": "Delightful developer experience is an important part of building serverless applications efficiently, whether you’re creating an automation script or developing a complex enterprise application. While AWS Lambda has transformed modern application development in the cloud with its serverless computing model, developers spend significant time working in their local environments. They rely on familiar IDEs, debugging […]",
      "link": "https://aws.amazon.com/blogs/compute/accelerating-local-serverless-development-with-console-to-ide-and-remote-debugging-for-aws-lambda/",
      "pubDate": "2025-09-09T18:00:39.000Z",
      "source": "computeBlog",
      "services": [
        "lex",
        "lambda"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "lambda"
      ]
    },
    {
      "id": "aws-news-11d98a88cbe1",
      "title": "Implement monitoring for Amazon EKS with managed services",
      "description": "In this post, we show you how to implement comprehensive monitoring for Amazon Elastic Kubernetes Service (Amazon EKS) workloads using AWS managed services. This solution demonstrates building an EKS platform that combines flexible compute options with enterprise-grade observability using AWS native services and OpenTelemetry.",
      "link": "https://aws.amazon.com/blogs/architecture/implement-monitoring-for-amazon-eks-with-managed-services/",
      "pubDate": "2025-07-18T15:47:13.000Z",
      "source": "architectureBlog",
      "services": [
        "lex",
        "eks"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "eks"
      ]
    }
  ]
}