{
  "lastUpdated": "2025-10-04T06:12:56.642Z",
  "category": "natural-language",
  "totalItems": 10,
  "items": [
    {
      "id": "aws-news-3efe1558691a",
      "title": "Amazon Connect makes it easier to get customer input on outbound calls",
      "description": "Amazon Connect, the cloud-based contact center service from AWS, now supports Get Customer Input and Store Customer Input flow blocks for outbound voice whisper flows. The Get Customer Input flow block allows a prompt to be played to a customer on an outbound call after they answer the call but before they are connected with an agent, and the customer’s response can be collected through either DTMF input or via an Amazon Lex Bot.\n  This capability will allow you to capture interactive and dynamic customer input on outbound calls before these are connected to an agent. For example, you can use the Get Customer Input flow block to obtain customer consent for call recording as part of outbound calls placed by agents, and use it to trigger Amazon Connect Contact Lens recording and analytics.\n  The capability is available in all AWS commercial and AWS GovCloud (US-West) regions where Amazon Connect is offered.\n  To learn more about Amazon Connect, please visit the Amazon Connect website or consult the Amazon Connect Administrator Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-connect-customer-input-outbound-calls",
      "pubDate": "2025-10-02T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "support"
      ]
    },
    {
      "id": "aws-news-4c03617c455e",
      "title": "Amazon GameLift Streams adds IPv6 support for streaming Windows applications",
      "description": "Amazon GameLift Streams now supports streaming over IPv6 for applications running on Windows-based stream groups, enabling dual-stack (IPv4 and IPv6) streaming capabilities. This enhancement gives our customers flexibility in how they connect to their streamed Windows applications while maintaining compatibility with existing IPv4 implementations.\n  When streaming applications running on Windows-based stream groups through Amazon GameLift Streams, customers can now use either IPv4 or IPv6 protocols. This dual-stack support helps customers meet IPv6 compliance requirements and provides additional addressing options for the streaming clients. Please note that Linux runtime applications will continue to require IPv4 connectivity for streaming.\n \nAmazon GameLift Streams IPv6 support for applications running on Windows-based stream groups is available in all AWS Regions where Amazon GameLift Streams is offered. To learn more about networking options for your streaming applications, visit the Amazon GameLift Streams documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-gamelift-streams-ipv6-support",
      "pubDate": "2025-10-01T18:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "ga",
        "enhancement",
        "support"
      ]
    },
    {
      "id": "aws-news-20d8370b60f2",
      "title": "Announcing Apache Airflow 3.0 support in Amazon Managed Workflows for Apache Airflow",
      "description": "Amazon Managed Workflows for Apache Airflow (MWAA) now supports Apache Airflow version 3.0, the latest major release of the workflow orchestration platform. This release enhances your ability to author, schedule, and monitor complex workflows with greater efficiency and control.\n  Amazon MWAA is a managed service for Apache Airflow that enables seamless workflow orchestration using the familiar Apache Airflow platform. The availability of Apache Airflow v3.0 on MWAA introduces substantial improvements to workflow orchestration, including a completely redesigned interface for enhanced usability and advanced event-driven scheduling capabilities. This new scheduling system triggers workflows based on external events directly, eliminating the need for separate asset update pipelines. The newly introduced Task SDK in Apache Airflow v3.0 on MWAA help you simplify DAGs by reducing boilerplate code, making workflows more concise, readable, and consistent. Security and isolation are strengthened through the Task Execution API, which restricts direct access to the metadatabase and manages all runtime interactions. This release also features scheduler-managed backfill functionality, providing you better control over historical data processing. Additionally, MWAA now supports Python 3.12, while incorporating critical security improvements and bug fixes that enhance the overall reliability and security of your workflows in Amazon MWAA environments.\n  You can launch a new Apache Airflow 3.0 environment on Amazon MWAA with just a few clicks in the AWS Management Console in all currently supported Amazon MWAA regions. To learn more about Apache Airflow 3.0 visit the Amazon MWAA documentation, and the Apache Airflow 3.0 change log in the Apache Airflow documentation.\n  Apache, Apache Airflow, and Airflow are either registered trademarks or trademarks of the Apache Software Foundation in the United States and/or other countries.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/apache-airflow-3-amazon-mwaa/",
      "pubDate": "2025-10-01T17:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "launch",
        "update",
        "improvement",
        "support"
      ]
    },
    {
      "id": "aws-news-c35a93766092",
      "title": "Amazon FSx for NetApp ONTAP now supports Internet Protocol Version 6 (IPv6)",
      "description": "Amazon FSx now offers customers the option to use Internet Protocol version 6 (IPv6) for access to Amazon FSx for NetApp ONTAP file systems.\n  More and more customers are adopting IPv6 to mitigate IPv4 address exhaustion in their private networks or to satisfy government mandates such as the US Office of Management and Budget (OMB) M-21-07 memorandum. With this launch, customers can now access their file systems using IPv4, IPv6, or dual-stack clients without the need for complex infrastructure to handle IPv6 to IPv4 address translation.\n  IPv6 support for new FSx for NetApp ONTAP file systems is now available in all AWS Commercial and AWS GovCloud (US) regions where Amazon FSx is available, with IPv6 support for existing FSx for NetApp ONTAP file systems coming in an upcoming weekly maintenance window. To learn more, visit the Amazon FSx user guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-fsx-for-netapp-ontap-ipv6/",
      "pubDate": "2025-09-30T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "launch",
        "ga",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-071d96ca22e1",
      "title": "Amazon FSx for Windows File Server now supports Internet Protocol Version 6 (IPv6)",
      "description": "Amazon FSx now offers customers the option to use Internet Protocol version 6 (IPv6) for access to Amazon FSx for Windows File Server file systems.\n  More and more customers are adopting IPv6 to mitigate IPv4 address exhaustion in their private networks or to satisfy government mandates such as the US Office of Management and Budget (OMB) M-21-07 memorandum. With this launch, customers can now access their file systems using IPv4, IPv6, or dual-stack clients without the need for complex infrastructure to handle IPv6 to IPv4 address translation.\n  IPv6 support for new FSx for Windows File Server file systems is now available in all AWS Commercial and AWS GovCloud (US) regions where Amazon FSx is available, with IPv6 support for existing FSx for Windows File Server file systems coming in an upcoming weekly maintenance window. To learn more, visit the Amazon FSx user guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-fsx-for-windows-file-server-ipv6/",
      "pubDate": "2025-09-30T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "launch",
        "ga",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-47da908bba5a",
      "title": "Amazon RDS for Db2 now offers Reserved Instances",
      "description": "Amazon Relational Database Service (RDS) for Db2 now offers Reserved Instances with up to 47% cost savings compared to On-Demand prices. The option to use Reserved Instances is available for all supported instance types.\n  Amazon RDS for Db2 Reserved Instances provide size flexibility for both Bring Your Own License (BYOL) and Db2 license purchased through AWS Marketplace. With Reserved Instances size flexibility, the discounted rate for Reserved Instances automatically applies to usage of any size in the same instance family. For example, if you purchase a db.r7i.2xlarge Reserved Instance in US East (N. Virginia), the discounted rate of this Reserved Instance can automatically apply to 2 db.r7i.xlarge instances. For information on RDS Reserved Instances, refer to Reserved DB instances for Amazon RDS.\n  You can purchase Reserved Instances through the AWS Management Console, AWS CLI, or AWS SDK. For detailed pricing information and purchase options, refer to Amazon RDS for Db2 Pricing.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-rds-db2-offers-reserved-instances",
      "pubDate": "2025-09-26T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "rds"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "rds",
        "support"
      ]
    },
    {
      "id": "aws-news-6ff42c19e362",
      "title": "AWS Network Firewall enhances application layer traffic controls",
      "description": "AWS Network Firewall, a managed service that makes it easy to deploy essential network protections for your Amazon VPCs, now provides enhanced default rules to handle TLS client hellos, and HTTP requests split across multiple packets. This update introduces new application layer drop and alert established default stateful actions, enabling customers to maintain security controls while supporting modern TLS implementations and large HTTP requests.\n  These enhancements help customers implement robust security policies without writing complex custom rules. Security teams can now effectively inspect and filter traffic where key information is segmented across multiple packets, while maintaining visibility through detailed logging options, making it easier to secure applications using modern protocols and encryption standards.\n  This capability is available in all AWS Regions where AWS Network Firewall is supported.\n  To learn more, refer to AWS Network Firewall service documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-network-firewall-enhances-application-layer-traffic-controls",
      "pubDate": "2025-09-25T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "rds"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "rds",
        "update",
        "enhancement",
        "support"
      ]
    },
    {
      "id": "aws-news-9a877ca57412",
      "title": "Research and Engineering Studio on AWS 2025.09 is now available",
      "description": "Today we’re announcing Research and Engineering Studio (RES) on AWS 2025.09, which brings support for fractional GPUs, simplified AMI management, and enhanced deployment flexibility. This release also expands regional availability to include four additional AWS commercial Regions.\n  Research and Engineering Studio on AWS is an open source solution that provides a web-based portal for administrators to create and manage secure cloud-based research and engineering environments. RES enables scientists and engineers to access powerful Windows and Linux virtual desktops with pre-installed applications and shared resources, without requiring cloud expertise.\n  Version 2025.09 adds support for Amazon EC2 g6f instances, enabling GPU fractionalization for more efficient resource utilization in graphics-intensive workloads. The release also introduces Systems Manager Parameter Alias support for AMI IDs, simplifying the management of project-specific images, and enables integration with existing Amazon Cognito user pools for streamlined authentication setup during deployment. Administrators can now also customize CIDR ranges in the AWS CloudFormation external resources template for better network planning and integration with existing resources.\n  This release expands regional availability to include Asia Pacific (Osaka), Asia Pacific (Jakarta), Middle East (UAE), and South America (São Paulo). To learn more about RES 2025.09, including detailed release notes and deployment instructions, visit the Research and Engineering Studio documentation or check out the RES GitHub repository.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/research-engineering-studio-aws-2025-09-now-available",
      "pubDate": "2025-09-25T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "ec2",
        "cloudformation"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "ec2",
        "cloudformation",
        "now-available",
        "integration",
        "support"
      ]
    },
    {
      "id": "aws-news-cb8062515dfa",
      "title": "Accelerating local serverless development with console to IDE and remote debugging for AWS Lambda",
      "description": "Delightful developer experience is an important part of building serverless applications efficiently, whether you’re creating an automation script or developing a complex enterprise application. While AWS Lambda has transformed modern application development in the cloud with its serverless computing model, developers spend significant time working in their local environments. They rely on familiar IDEs, debugging […]",
      "link": "https://aws.amazon.com/blogs/compute/accelerating-local-serverless-development-with-console-to-ide-and-remote-debugging-for-aws-lambda/",
      "pubDate": "2025-09-09T18:00:39.000Z",
      "source": "computeBlog",
      "services": [
        "lex",
        "lambda"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "lambda"
      ]
    },
    {
      "id": "aws-news-11d98a88cbe1",
      "title": "Implement monitoring for Amazon EKS with managed services",
      "description": "In this post, we show you how to implement comprehensive monitoring for Amazon Elastic Kubernetes Service (Amazon EKS) workloads using AWS managed services. This solution demonstrates building an EKS platform that combines flexible compute options with enterprise-grade observability using AWS native services and OpenTelemetry.",
      "link": "https://aws.amazon.com/blogs/architecture/implement-monitoring-for-amazon-eks-with-managed-services/",
      "pubDate": "2025-07-18T15:47:13.000Z",
      "source": "architectureBlog",
      "services": [
        "lex",
        "eks"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "eks"
      ]
    }
  ]
}