{
  "lastUpdated": "2025-10-14T06:15:53.906Z",
  "category": "natural-language",
  "totalItems": 11,
  "items": [
    {
      "id": "aws-news-c23393eb3ad8",
      "title": "AWS Marketplace now supports new currencies for usage-based private offers",
      "description": "AWS Marketplace now supports usage-based private offers in four new currencies: EUR, GBP, AUD, and JPY. AWS Marketplace Sellers and Channel Partners can now reach buyers globally without currency conversion complexity or foreign exchange risk by pricing their offers in these new currencies. For sellers, this means faster deal cycles, simplified cash flow management in local currency, and the ability to close larger deals with confidence. For AWS Marketplace buyers, software and services can now be procured in their preferred currency, eliminating foreign exchange risk in invoice amounts, and streamlining the procurement process for private offers.\n  Sellers can now create private offers in EUR, GBP, AUD, and JPY, and receive their disbursements in the offer currency, regardless of pricing types, including contract with consumption-based pricing and usage-based (pay-as-you-go) pricing, in addition to contract-only pricing. For Channel Partner Private Offers (CPPO), the seller, channel partner, and buyer must all transact in the same currency. Sellers need to issue a resale authorization in the negotiated currency, and the channel partner then creates the CPPO in that currency.\n  This functionality is available worldwide for all AWS Marketplace Sellers for all private offers. Public offers remain in USD only.\n  AWS Marketplace Sellers can choose to get disbursed to a bank account in one of the eligible jurisdictions by updating your banking information and set your currency preferences in the AWS Marketplace Management Portal Settings page. To learn more, visit the documentation on local currency offers and disbursements.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-marketplace-currencies-usage-based-private-offers",
      "pubDate": "2025-10-07T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-47058ae2934f",
      "title": "AWS Marketplace announces enhanced pricing dimension capabilities for sellers",
      "description": "Today, AWS Marketplace announces enhanced pricing dimension capabilities, increasing limits and improving flexibility for sellers managing their product pricing. These enhancements increase the maximum pricing dimensions from 24 to 200, enable immediate use of new SaaS dimensions, and remove the 90-day price update restriction for dimensions without active subscriptions.\n  These enhancements address key product pricing needs for sellers offering complex enterprise software. With 200 dimensions each for contract and usage-based pricing, sellers can now fully represent pricing across multiple features, user types, and consumption metrics in a single listing; matching the same pricing structures they offer outside of AWS Marketplace. When sellers add new usage dimensions to their public offers, these become available immediately for use. For instance, when a seller launches a new feature, subscribers can now instantly access it. Similarly, for dimensions without active subscriptions, sellers can adjust prices to align with their external pricing strategies without waiting through multiple 90-day periods.\n  These enhancements to pricing dimensions are now available in all AWS Regions where AWS Marketplace is supported.\n  To learn more, visit the AWS Marketplace Seller Guide, or access the AWS Marketplace Management Portal to try the new capabilities.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/aws-marketplace-pricing-dimension-sellers/",
      "pubDate": "2025-10-07T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "launch",
        "now-available",
        "new-feature",
        "update",
        "enhancement",
        "support"
      ]
    },
    {
      "id": "aws-news-ce8c6e457f79",
      "title": "Amazon Redshift Serverless with lower base capacity available in the AWS Asia Pacific (Seoul) and Canada (Central) Regions",
      "description": "Amazon Redshift now allows you to get started with Amazon Redshift Serverless with a lower data warehouse base capacity configuration of 8 Redshift Processing Units (RPUs) in the AWS Asia Pacific (Seoul) and Canada (Central) regions. Each RPU provides 16 GB of memory. Amazon Redshift Serverless measures data warehouse capacity in RPUs, and you pay only for the duration of workloads you run in RPU-hours on a per-second basis. Previously, the minimum base capacity required to run Amazon Redshift Serverless was 32 RPUs. With the new lower base capacity minimum of 8 RPUs, you now have even more flexibility to support a diverse set of workloads of small to large complexity based on your price performance requirements. You can increment or decrement the RPU in units of 8 RPUs.\n  Amazon Redshift Serverless allows you to run and scale analytics without having to provision and manage data warehouse clusters. With Amazon Redshift Serverless, all users, including data analysts, developers, and data scientists, can use Amazon Redshift to get insights from data in seconds. With the new lower capacity configuration, you can use Amazon Redshift Serverless for production environments, test and development environments at an optimal price point when a workload needs a small amount of compute.\n  To get started, see the Amazon Redshift Serverless feature page, user documentation, and API Reference.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-redshift-serverless-asia-pacific-seoul-europe-paris/",
      "pubDate": "2025-10-07T03:17:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "redshift"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "redshift",
        "support"
      ]
    },
    {
      "id": "aws-news-6a1aea7d8d52",
      "title": "New Compute Optimized Amazon EC2 C8i and C8i-flex instances",
      "description": "AWS is announcing the general availability of new compute optimized Amazon EC2 C8i and C8i-flex instances. These instances are powered by custom Intel Xeon 6 processors, available only on AWS, delivering the highest performance and fastest memory bandwidth among comparable Intel processors in the cloud. These C8i and C8i-flex instances offer up to 15% better price-performance, and 2.5x more memory bandwidth compared to previous generation Intel-based instances. They deliver up to 20% better performance than C7i and C7i-flex instances, with even higher gains for some workloads. The C8i and C8i-flex instances are up to 60% faster for NGINX web applications, up to 40% faster for AI deep learning recommendation models, and 35% faster for Memcached stores compared to C7i and C7i-flex instances.\n  C8i-flex are the easiest way to get price performance benefits for a majority of compute intensive workloads like web and application servers, databases, caches, Apache Kafka, Elasticsearch, and enterprise applications. They offer the most common sizes, from large to 16xlarge, and are a great first choice for applications that don't fully utilize all compute resources.\n  C8i instances are a great choice for all compute intensive workloads, especially for workloads that need the largest instance sizes or continuous high CPU usage. C8i instances offer 13 sizes including 2 bare metal sizes and the new 96xlarge size for the largest applications.\n  C8i and C8i-flex instances are available in the following AWS Regions: US East (N. Virginia), US East (Ohio), US West (Oregon), and Europe (Spain).\n  To get started, sign in to the AWS Management Console. Customers can purchase these instances via Savings Plans, On-Demand instances, and Spot instances. For more information about the new C8i and C8i-flex instances visit the AWS News blog.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-ec2-c8i-and-c8i-flex-instances-generally-available",
      "pubDate": "2025-10-06T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex",
        "ec2",
        "kafka"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "ec2",
        "kafka",
        "ga"
      ]
    },
    {
      "id": "aws-news-3efe1558691a",
      "title": "Amazon Connect makes it easier to get customer input on outbound calls",
      "description": "Amazon Connect, the cloud-based contact center service from AWS, now supports Get Customer Input and Store Customer Input flow blocks for outbound voice whisper flows. The Get Customer Input flow block allows a prompt to be played to a customer on an outbound call after they answer the call but before they are connected with an agent, and the customer’s response can be collected through either DTMF input or via an Amazon Lex Bot.\n  This capability will allow you to capture interactive and dynamic customer input on outbound calls before these are connected to an agent. For example, you can use the Get Customer Input flow block to obtain customer consent for call recording as part of outbound calls placed by agents, and use it to trigger Amazon Connect Contact Lens recording and analytics.\n  The capability is available in all AWS commercial and AWS GovCloud (US-West) regions where Amazon Connect is offered.\n  To learn more about Amazon Connect, please visit the Amazon Connect website or consult the Amazon Connect Administrator Guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-connect-customer-input-outbound-calls",
      "pubDate": "2025-10-02T14:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "support"
      ]
    },
    {
      "id": "aws-news-4c03617c455e",
      "title": "Amazon GameLift Streams adds IPv6 support for streaming Windows applications",
      "description": "Amazon GameLift Streams now supports streaming over IPv6 for applications running on Windows-based stream groups, enabling dual-stack (IPv4 and IPv6) streaming capabilities. This enhancement gives our customers flexibility in how they connect to their streamed Windows applications while maintaining compatibility with existing IPv4 implementations.\n  When streaming applications running on Windows-based stream groups through Amazon GameLift Streams, customers can now use either IPv4 or IPv6 protocols. This dual-stack support helps customers meet IPv6 compliance requirements and provides additional addressing options for the streaming clients. Please note that Linux runtime applications will continue to require IPv4 connectivity for streaming.\n \nAmazon GameLift Streams IPv6 support for applications running on Windows-based stream groups is available in all AWS Regions where Amazon GameLift Streams is offered. To learn more about networking options for your streaming applications, visit the Amazon GameLift Streams documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/amazon-gamelift-streams-ipv6-support",
      "pubDate": "2025-10-01T18:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "ga",
        "enhancement",
        "support"
      ]
    },
    {
      "id": "aws-news-20d8370b60f2",
      "title": "Announcing Apache Airflow 3.0 support in Amazon Managed Workflows for Apache Airflow",
      "description": "Amazon Managed Workflows for Apache Airflow (MWAA) now supports Apache Airflow version 3.0, the latest major release of the workflow orchestration platform. This release enhances your ability to author, schedule, and monitor complex workflows with greater efficiency and control.\n  Amazon MWAA is a managed service for Apache Airflow that enables seamless workflow orchestration using the familiar Apache Airflow platform. The availability of Apache Airflow v3.0 on MWAA introduces substantial improvements to workflow orchestration, including a completely redesigned interface for enhanced usability and advanced event-driven scheduling capabilities. This new scheduling system triggers workflows based on external events directly, eliminating the need for separate asset update pipelines. The newly introduced Task SDK in Apache Airflow v3.0 on MWAA help you simplify DAGs by reducing boilerplate code, making workflows more concise, readable, and consistent. Security and isolation are strengthened through the Task Execution API, which restricts direct access to the metadatabase and manages all runtime interactions. This release also features scheduler-managed backfill functionality, providing you better control over historical data processing. Additionally, MWAA now supports Python 3.12, while incorporating critical security improvements and bug fixes that enhance the overall reliability and security of your workflows in Amazon MWAA environments.\n  You can launch a new Apache Airflow 3.0 environment on Amazon MWAA with just a few clicks in the AWS Management Console in all currently supported Amazon MWAA regions. To learn more about Apache Airflow 3.0 visit the Amazon MWAA documentation, and the Apache Airflow 3.0 change log in the Apache Airflow documentation.\n  Apache, Apache Airflow, and Airflow are either registered trademarks or trademarks of the Apache Software Foundation in the United States and/or other countries.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/10/apache-airflow-3-amazon-mwaa/",
      "pubDate": "2025-10-01T17:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "launch",
        "update",
        "improvement",
        "support"
      ]
    },
    {
      "id": "aws-news-c35a93766092",
      "title": "Amazon FSx for NetApp ONTAP now supports Internet Protocol Version 6 (IPv6)",
      "description": "Amazon FSx now offers customers the option to use Internet Protocol version 6 (IPv6) for access to Amazon FSx for NetApp ONTAP file systems.\n  More and more customers are adopting IPv6 to mitigate IPv4 address exhaustion in their private networks or to satisfy government mandates such as the US Office of Management and Budget (OMB) M-21-07 memorandum. With this launch, customers can now access their file systems using IPv4, IPv6, or dual-stack clients without the need for complex infrastructure to handle IPv6 to IPv4 address translation.\n  IPv6 support for new FSx for NetApp ONTAP file systems is now available in all AWS Commercial and AWS GovCloud (US) regions where Amazon FSx is available, with IPv6 support for existing FSx for NetApp ONTAP file systems coming in an upcoming weekly maintenance window. To learn more, visit the Amazon FSx user guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-fsx-for-netapp-ontap-ipv6/",
      "pubDate": "2025-09-30T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "launch",
        "ga",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-071d96ca22e1",
      "title": "Amazon FSx for Windows File Server now supports Internet Protocol Version 6 (IPv6)",
      "description": "Amazon FSx now offers customers the option to use Internet Protocol version 6 (IPv6) for access to Amazon FSx for Windows File Server file systems.\n  More and more customers are adopting IPv6 to mitigate IPv4 address exhaustion in their private networks or to satisfy government mandates such as the US Office of Management and Budget (OMB) M-21-07 memorandum. With this launch, customers can now access their file systems using IPv4, IPv6, or dual-stack clients without the need for complex infrastructure to handle IPv6 to IPv4 address translation.\n  IPv6 support for new FSx for Windows File Server file systems is now available in all AWS Commercial and AWS GovCloud (US) regions where Amazon FSx is available, with IPv6 support for existing FSx for Windows File Server file systems coming in an upcoming weekly maintenance window. To learn more, visit the Amazon FSx user guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-fsx-for-windows-file-server-ipv6/",
      "pubDate": "2025-09-30T07:00:00.000Z",
      "source": "whatsNew",
      "services": [
        "lex"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "launch",
        "ga",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-cb8062515dfa",
      "title": "Accelerating local serverless development with console to IDE and remote debugging for AWS Lambda",
      "description": "Delightful developer experience is an important part of building serverless applications efficiently, whether you’re creating an automation script or developing a complex enterprise application. While AWS Lambda has transformed modern application development in the cloud with its serverless computing model, developers spend significant time working in their local environments. They rely on familiar IDEs, debugging […]",
      "link": "https://aws.amazon.com/blogs/compute/accelerating-local-serverless-development-with-console-to-ide-and-remote-debugging-for-aws-lambda/",
      "pubDate": "2025-09-09T18:00:39.000Z",
      "source": "computeBlog",
      "services": [
        "lex",
        "lambda"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "lambda"
      ]
    },
    {
      "id": "aws-news-11d98a88cbe1",
      "title": "Implement monitoring for Amazon EKS with managed services",
      "description": "In this post, we show you how to implement comprehensive monitoring for Amazon Elastic Kubernetes Service (Amazon EKS) workloads using AWS managed services. This solution demonstrates building an EKS platform that combines flexible compute options with enterprise-grade observability using AWS native services and OpenTelemetry.",
      "link": "https://aws.amazon.com/blogs/architecture/implement-monitoring-for-amazon-eks-with-managed-services/",
      "pubDate": "2025-07-18T15:47:13.000Z",
      "source": "architectureBlog",
      "services": [
        "lex",
        "eks"
      ],
      "categories": [
        "natural-language"
      ],
      "tags": [
        "lex",
        "eks"
      ]
    }
  ]
}