{
  "lastUpdated": "2025-11-02T06:14:11.377Z",
  "category": "news",
  "totalItems": 17,
  "items": [
    {
      "id": "aws-news-68a98b2b7ad5",
      "title": "Build more accurate AI applications with Amazon Nova Web Grounding",
      "description": "AWS announced Amazon Nova Web Grounding, a new built-in tool for Nova models on Amazon Bedrock that automatically retrieves current, cited information to reduce AI hallucinations and improve accuracy in applications requiring up-to-date factual data.",
      "link": "https://aws.amazon.com/blogs/aws/build-more-accurate-ai-applications-with-amazon-nova-web-grounding/",
      "pubDate": "2025-10-28T23:59:17.000Z",
      "source": "newsBlog",
      "services": [
        "bedrock",
        "nova"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "bedrock",
        "nova"
      ]
    },
    {
      "id": "aws-news-5e5024ca5957",
      "title": "Amazon Nova Multimodal Embeddings: State-of-the-art embedding model for agentic RAG and semantic search",
      "description": "Amazon Nova Multimodal Embeddings is a new state-of-the-art embedding model available in Amazon Bedrock. It is the industry’s first embedding model that supports text, documents, images, video, and audio through a single unified model, enabling cross-modal retrieval and semantic search applications with leading accuracy, at industry-leading costs.",
      "link": "https://aws.amazon.com/blogs/aws/amazon-nova-multimodal-embeddings-now-available-in-amazon-bedrock/",
      "pubDate": "2025-10-28T15:12:38.000Z",
      "source": "newsBlog",
      "services": [
        "bedrock",
        "nova"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "bedrock",
        "nova",
        "support"
      ]
    },
    {
      "id": "aws-news-1c1dddaf6ab7",
      "title": "Customer Carbon Footprint Tool Expands: Additional emissions categories including Scope 3 are now available",
      "description": "AWS has expanded its Customer Carbon Footprint Tool (CCFT) to include Scope 3 emissions data alongside updated Scope 1 and 2 emissions, giving customers more insight into their carbon impact. The CCFT now tracks emissions from fuel- and energy-related activities (FERA), IT hardware, buildings, equipment, and transportation. AWS customers can access this information and track changes over time through the AWS Billing console.",
      "link": "https://aws.amazon.com/blogs/aws/aws-customer-carbon-footprint-tool-now-includes-scope-3-emissions/",
      "pubDate": "2025-10-22T17:48:18.000Z",
      "source": "newsBlog",
      "services": [],
      "categories": [
        "news"
      ],
      "tags": [
        "now-available",
        "update"
      ]
    },
    {
      "id": "aws-news-81499b3fe296",
      "title": "Monitor, analyze, and manage capacity usage from a single interface with Amazon EC2 Capacity Manager",
      "description": "Amazon EC2 Capacity Manager is a new centralized solution that consolidates capacity monitoring and management across all AWS accounts and regions, eliminating operational overhead and providing optimization opportunities for EC2 infrastructure at scale.",
      "link": "https://aws.amazon.com/blogs/aws/monitor-analyze-and-manage-capacity-usage-from-a-single-interface-with-amazon-ec2-capacity-manager/",
      "pubDate": "2025-10-16T15:48:12.000Z",
      "source": "newsBlog",
      "services": [
        "ec2"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "ec2"
      ]
    },
    {
      "id": "aws-news-d39997d80f80",
      "title": "Introducing Amazon EBS Volume Clones: Create instant copies of your EBS volumes",
      "description": "AWS launched Amazon EBS Volume Clones, a new capability that allows users to create instant point-in-time copies of EBS volumes within the same Availability Zone with a single API call, eliminating the previous multi-step process of taking snapshots and creating volumes from them.",
      "link": "https://aws.amazon.com/blogs/aws/introducing-amazon-ebs-volume-clones-create-instant-copies-of-your-ebs-volumes/",
      "pubDate": "2025-10-14T21:35:05.000Z",
      "source": "newsBlog",
      "services": [],
      "categories": [
        "news"
      ],
      "tags": [
        "launch",
        "new-capability"
      ]
    },
    {
      "id": "aws-news-81db890df609",
      "title": "AWS Transfer Family SFTP connectors now support VPC-based connectivity",
      "description": "AWS Transfer Family SFTP connectors now support VPC-based connectivity, allowing secure file transfers between Amazon S3 and remote SFTP servers through your existing VPC infrastructure without exposing endpoints to the internet.",
      "link": "https://aws.amazon.com/blogs/aws/aws-transfer-family-sftp-connectors-now-support-vpc-based-connectivity/",
      "pubDate": "2025-10-14T19:27:31.000Z",
      "source": "newsBlog",
      "services": [
        "s3"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "s3",
        "support"
      ]
    },
    {
      "id": "aws-news-5389fe826966",
      "title": "AWS Weekly Roundup: Amazon Quick Suite, Amazon EC2, Amazon EKS, and more (October 13, 2025)",
      "description": "This week I was at the inaugural AWS AI in Practice meetup from the AWS User Group UK. AI-assisted software development and agents were the focus of the evening! Next week I’ll be in Italy for Codemotion (Milan) and an AWS User Group meetup (Rome). My sessions there will be about AI agents and context […]",
      "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-amazon-quick-suite-amazon-ec2-amazon-eks-and-more-october-13-2025/",
      "pubDate": "2025-10-13T16:24:15.000Z",
      "source": "newsBlog",
      "services": [
        "amazon q",
        "ec2",
        "eks"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "amazon q",
        "ec2",
        "eks"
      ]
    },
    {
      "id": "aws-news-7f665ce82bee",
      "title": "Announcing Amazon Quick Suite: your agentic teammate for answering questions and taking action",
      "description": "Amazon has announced Quick Suite, a new AI-powered workspace that combines research, business intelligence, and automation tools to help users analyze data and streamline workflows all in one place.",
      "link": "https://aws.amazon.com/blogs/aws/reimagine-the-way-you-work-with-ai-agents-in-amazon-quick-suite/",
      "pubDate": "2025-10-09T15:42:04.000Z",
      "source": "newsBlog",
      "services": [
        "amazon q"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "amazon q"
      ]
    },
    {
      "id": "aws-news-f82487644618",
      "title": "New general-purpose Amazon EC2 M8a instances are now available",
      "description": "Amazon EC2 has launched new M8a instances powered by 5th Generation AMD EPYC processors, offering up to 30% better performance and 19% better price performance compared to M7a instances, along with improved memory bandwidth, networking, and storage capabilities for various general-purpose workloads.",
      "link": "https://aws.amazon.com/blogs/aws/new-general-purpose-amazon-ec2-m8a-instances-are-now-available/",
      "pubDate": "2025-10-08T19:03:27.000Z",
      "source": "newsBlog",
      "services": [
        "ec2"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "ec2",
        "launch",
        "now-available"
      ]
    },
    {
      "id": "aws-news-ef90ff9c031a",
      "title": "Introducing new compute-optimized Amazon EC2 C8i and C8i-flex instances",
      "description": "AWS launched compute-optimized C8i and C8i-flex EC2 instances powered by custom Intel Xeon 6 processors available only on AWS to offer up to 15% better price performance, 20% higher performance, and 2.5 times more memory throughput compared to previous generations.",
      "link": "https://aws.amazon.com/blogs/aws/introducing-new-compute-optimized-amazon-ec2-c8i-and-c8i-flex-instances/",
      "pubDate": "2025-10-06T20:33:28.000Z",
      "source": "newsBlog",
      "services": [
        "lex",
        "ec2"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "lex",
        "ec2",
        "launch"
      ]
    },
    {
      "id": "aws-news-d16124a12b63",
      "title": "AWS IAM Identity Center now supports customer-managed KMS keys for encryption at rest",
      "description": "Gain control over encryption and comply with regulations using customer-managed keys for AWS IAM Identity Center's user data and passwords.",
      "link": "https://aws.amazon.com/blogs/aws/aws-iam-identity-center-now-supports-customer-managed-kms-keys-for-encryption-at-rest/",
      "pubDate": "2025-10-06T19:52:06.000Z",
      "source": "newsBlog",
      "services": [
        "rds",
        "iam",
        "iam identity center"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "rds",
        "iam",
        "iam identity center",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-4e23bbfb91df",
      "title": "AWS Weekly Roundup:  Amazon Bedrock, AWS Outposts, Amazon ECS Managed Instances, AWS Builder ID, and more (October 6, 2025)",
      "description": "Last week, Anthropic’s Claude Sonnet 4.5—the world’s best coding model according to SWE-Bench – became available in Amazon Q command line interface (CLI) and Kiro. I’m excited about this for two reasons: First, a few weeks ago I spent 4 intensive days with a global customer delivering an AI-assisted development workshop, where I experienced firsthand […]",
      "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-amazon-bedrock-aws-outposts-amazon-ecs-managed-instances-aws-builder-id-and-more-october-6-2025/",
      "pubDate": "2025-10-06T15:42:39.000Z",
      "source": "newsBlog",
      "services": [
        "bedrock",
        "amazon q",
        "ecs",
        "eks",
        "outposts"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "bedrock",
        "amazon q",
        "ecs",
        "eks",
        "outposts"
      ]
    },
    {
      "id": "aws-news-cba0d7e0ebd5",
      "title": "Announcing Amazon ECS Managed Instances for containerized applications",
      "description": "Amazon ECS Managed Instances is a new compute option that eliminates infrastructure management overhead while giving you access to the broad suite of EC2 capabilities including the flexibility to select instance types, access reserved capacity, and advanced security and observability configurations.",
      "link": "https://aws.amazon.com/blogs/aws/announcing-amazon-ecs-managed-instances-for-containerized-applications/",
      "pubDate": "2025-09-30T18:46:47.000Z",
      "source": "newsBlog",
      "services": [
        "lex",
        "ec2",
        "ecs"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "lex",
        "ec2",
        "ecs"
      ]
    },
    {
      "id": "aws-news-9b7993bd80b1",
      "title": "Announcing AWS Outposts third-party storage integration with Dell and HPE",
      "description": "AWS Outposts is now integrated with Dell PowerStore and HPE Alletra MP B10000 systems, enabling customers to seamlessly use their on-premises external storage infrastructure with AWS services while maintaining data residency requirements.",
      "link": "https://aws.amazon.com/blogs/aws/announcing-aws-outposts-third-party-storage-integration-with-dell-and-hpe/",
      "pubDate": "2025-09-30T16:39:54.000Z",
      "source": "newsBlog",
      "services": [
        "outposts"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "outposts",
        "integration"
      ]
    },
    {
      "id": "aws-news-314c736c8703",
      "title": "Introducing Claude Sonnet 4.5 in Amazon Bedrock: Anthropic’s most intelligent model, best for coding and complex agents",
      "description": "Amazon Web Services announces Claude Sonnet 4.5 in Amazon Bedrock, featuring advanced capabilities in coding, tool handling, and long-horizon tasks, with improvements in memory management, context processing, and industry-specific applications across finance, research, and cybersecurity sectors.",
      "link": "https://aws.amazon.com/blogs/aws/introducing-claude-sonnet-4-5-in-amazon-bedrock-anthropics-most-intelligent-model-best-for-coding-and-complex-agents/",
      "pubDate": "2025-09-29T17:56:16.000Z",
      "source": "newsBlog",
      "services": [
        "bedrock",
        "lex"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "bedrock",
        "lex",
        "improvement"
      ]
    },
    {
      "id": "aws-news-893c769634f2",
      "title": "AWS Weekly Roundup: Amazon S3, Amazon Bedrock AgentCore, AWS X-Ray and more (September 29, 2025)",
      "description": "Wow, can you all believe it? We’re nearing the end of the year already. Next thing you know, AWS re:Invent will be here! This is our biggest event that takes place every year in Las Vegas from December 1st to December 5th where we reveal and release many of the things that we’ve been working […]",
      "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-amazon-s3-amazon-bedrock-agentcore-aws-x-ray-and-more-september-29-2025/",
      "pubDate": "2025-09-29T16:42:04.000Z",
      "source": "newsBlog",
      "services": [
        "bedrock",
        "agentcore",
        "s3"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "bedrock",
        "agentcore",
        "s3",
        "ga"
      ]
    },
    {
      "id": "aws-news-b8a7a01ed381",
      "title": "Accelerate AI agent development with the Nova Act IDE extension",
      "description": "The Nova Act extension is a new IDE-integrated tool that enables developers to create browser automation agents using natural language through the Nova Act model, offering features like Builder Mode, chat capabilities, and predefined templates while streamlining the development process without leaving their preferred development environment.",
      "link": "https://aws.amazon.com/blogs/aws/accelerate-ai-agent-development-with-the-nova-act-ide-extension/",
      "pubDate": "2025-09-23T16:01:04.000Z",
      "source": "newsBlog",
      "services": [
        "nova"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "nova"
      ]
    }
  ]
}