{
  "lastUpdated": "2025-09-29T11:37:24.157Z",
  "category": "news",
  "totalItems": 20,
  "items": [
    {
      "id": "aws-news-b8a7a01ed381",
      "title": "Accelerate AI agent development with the Nova Act IDE extension",
      "description": "The Nova Act extension is a new IDE-integrated tool that enables developers to create browser automation agents using natural language through the Nova Act model, offering features like Builder Mode, chat capabilities, and predefined templates while streamlining the development process without leaving their preferred development environment.",
      "link": "https://aws.amazon.com/blogs/aws/accelerate-ai-agent-development-with-the-nova-act-ide-extension/",
      "pubDate": "2025-09-23T16:01:04.000Z",
      "source": "newsBlog",
      "services": [
        "nova"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "nova"
      ]
    },
    {
      "id": "aws-news-f6ea4658ae0e",
      "title": "AWS Weekly Roundup: Amazon Q Developer, AWS Step Functions, AWS Cloud Club Captain deadline, and more (September 22, 2025)",
      "description": "Three weeks ago, I published a post about the new AWS Region in New Zealand (ap-southeast-6). This led to an incredible opportunity to visit New Zealand, where I met passionate builders and presented at several events including Serverless and Platform Engineering meetup, AWS Tools and Programming meetup, AWS Cloud Clubs in Auckland, and AWS Community […]",
      "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-amazon-q-developer-aws-step-functions-aws-cloud-club-captain-deadline-and-more-september-22-2025/",
      "pubDate": "2025-09-22T16:21:44.000Z",
      "source": "newsBlog",
      "services": [
        "amazon q",
        "q developer"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "amazon q",
        "q developer"
      ]
    },
    {
      "id": "aws-news-3105df2f3e57",
      "title": "Qwen models are now available in Amazon Bedrock",
      "description": "Amazon Bedrock has expanded its model offerings with the addition of Qwen 3 foundation models enabling users to access and deploy them in a fully managed, serverless environment. These models feature both mixture-of-experts (MoE) and dense architectures to support diverse use cases including advanced code generation, multi-tool business automation, and cost-optimized AI reasoning.",
      "link": "https://aws.amazon.com/blogs/aws/qwen-models-are-now-available-in-amazon-bedrock/",
      "pubDate": "2025-09-18T22:02:11.000Z",
      "source": "newsBlog",
      "services": [
        "bedrock"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "bedrock",
        "now-available",
        "support"
      ]
    },
    {
      "id": "aws-news-151bf1dc2ea9",
      "title": "DeepSeek-V3.1 model now available in Amazon Bedrock",
      "description": "AWS launches DeepSeek-V3.1 as a fully managed models in Amazon Bedrock. DeepSeek-V3.1 is a hybrid open weight model that switches between thinking mode for detailed step-by-step analysis and non-thinking mode for faster responses.",
      "link": "https://aws.amazon.com/blogs/aws/deepseek-v3-1-now-available-in-amazon-bedrock/",
      "pubDate": "2025-09-18T21:49:48.000Z",
      "source": "newsBlog",
      "services": [
        "bedrock"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "bedrock",
        "launch",
        "now-available"
      ]
    },
    {
      "id": "aws-news-7e592b00a754",
      "title": "AWS named as a Leader in 2025 Gartner Magic Quadrant for Cloud-Native Application Platforms and Container Management",
      "description": "AWS was named as a Leader in the 2025 Gartner Magic Quadrant for Cloud-Native Application Platforms in two consecutive years positioned highest on \"Ability to Execute\", and for Container Management in three years positioned furthest for \"Completeness of Vision\".",
      "link": "https://aws.amazon.com/blogs/aws/aws-named-as-a-leader-in-2025-gartner-magic-quadrant-for-cloud-native-application-platforms-and-container-management/",
      "pubDate": "2025-09-15T17:53:48.000Z",
      "source": "newsBlog",
      "services": [],
      "categories": [
        "news"
      ],
      "tags": [
        "ga"
      ]
    },
    {
      "id": "aws-news-94338f4e0c14",
      "title": "AWS Weekly Roundup: Strands Agents 1M+ downloads, Cloud Club Captain, AI Agent Hackathon, and more (September 15, 2025)",
      "description": "Last week, Strands Agents, AWS open source for agentic AI SDK just hit 1 million downloads and earned 3,000+ GitHub Stars less than 4 months since launching as a preview in May 2025. With Strands Agents, you can build production-ready, multi-agent AI systems in a few lines of code. We’ve continuously improved features including support […]",
      "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-strands-agents-1m-downloads-cloud-club-captain-ai-agent-hackathon-and-more-september-15-2025/",
      "pubDate": "2025-09-15T16:45:14.000Z",
      "source": "newsBlog",
      "services": [],
      "categories": [
        "news"
      ],
      "tags": [
        "launch",
        "preview",
        "support"
      ]
    },
    {
      "id": "aws-news-3aaaf4df1897",
      "title": "Announcing Amazon EC2 M4 and M4 Pro Mac instances",
      "description": "AWS has launched new EC2 M4 and M4 Pro Mac instances based on Apple M4 Mac mini, offering improved performance over previous generations and featuring up to 48GB memory and 2TB storage for iOS/macOS development workloads.",
      "link": "https://aws.amazon.com/blogs/aws/announcing-amazon-ec2-m4-and-m4-pro-mac-instances/",
      "pubDate": "2025-09-12T16:30:25.000Z",
      "source": "newsBlog",
      "services": [],
      "categories": [
        "news"
      ],
      "tags": [
        "launch"
      ]
    },
    {
      "id": "aws-news-b67cea3d5f00",
      "title": "Accelerate serverless testing with LocalStack integration in VS Code IDE",
      "description": "AWS is announcing integrated LocalStack support in the AWS Toolkit for Visual Studio Code that makes it easier than ever for developers to test and debug serverless applications locally. This enhancement builds upon our recent improvements to the Lambda development experience, including the console to IDE integration and remote debugging capabilities we launched in July 2025, continuing our commitment to simplify serverless development on AWS.",
      "link": "https://aws.amazon.com/blogs/aws/accelerate-serverless-testing-with-localstack-integration-in-vs-code-ide/",
      "pubDate": "2025-09-11T18:06:05.000Z",
      "source": "newsBlog",
      "services": [],
      "categories": [
        "news"
      ],
      "tags": [
        "launch",
        "improvement",
        "enhancement",
        "integration",
        "support"
      ]
    },
    {
      "id": "aws-news-afab87cfafa9",
      "title": "AWS Weekly Roundup: AWS Transform, Amazon Neptune, and more (September 8, 2025)",
      "description": "Summer has drawn to a close here in Utrecht, where I live in the Netherlands. In two weeks, I’ll be attending AWS Community Day 2025, hosted at the Kinepolis Jaarbeurs Utrecht on September 24. The single-day event will bring together over 500 cloud practitioners from across the Netherlands, featuring 25 breakout sessions across five technical […]",
      "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-aws-transform-amazon-neptune-and-more-september-8-2025/",
      "pubDate": "2025-09-08T17:20:32.000Z",
      "source": "newsBlog",
      "services": [],
      "categories": [
        "news"
      ],
      "tags": []
    },
    {
      "id": "aws-news-0a4dc4713ecb",
      "title": "Now Open — AWS Asia Pacific (New Zealand) Region",
      "description": "AWS has launched its first New Zealand Region with three Availability Zones, marking its 16th Region in Asia Pacific and enabling local data residency for New Zealand organizations.",
      "link": "https://aws.amazon.com/blogs/aws/now-open-aws-asia-pacific-new-zealand-region/",
      "pubDate": "2025-09-01T22:06:17.000Z",
      "source": "newsBlog",
      "services": [],
      "categories": [
        "news"
      ],
      "tags": [
        "launch",
        "ga"
      ]
    },
    {
      "id": "aws-news-60dbc3b49098",
      "title": "AWS Weekly Roundup: Amazon EC2, Amazon Q Developer, IPv6 updates, and more (September 1, 2025)",
      "description": "My LinkedIn feed was absolutely packed this week with pictures from the AWS Heroes Summit event in Seattle. It was heartwarming to see so many familiar faces and new Heroes coming together. For those not familiar with the AWS Heroes program, it’s a global community recognition initiative that honors individuals who make outstanding contributions to […]",
      "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-amazon-ec2-amazon-q-developer-ipv6-updates-and-more-september-1-2025/",
      "pubDate": "2025-09-01T12:59:02.000Z",
      "source": "newsBlog",
      "services": [
        "amazon q",
        "q developer"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "amazon q",
        "q developer",
        "update"
      ]
    },
    {
      "id": "aws-news-89b810455ece",
      "title": "New general-purpose Amazon EC2 M8i and M8i-flex instances are now available",
      "description": "M8i and M8i-flex instances powered by Intel Xeon processors offer up to 15% better price performance, 20% higher performance, and 2.5 times more memory throughput compared to previous generations.",
      "link": "https://aws.amazon.com/blogs/aws/new-general-purpose-amazon-ec2-m8i-and-m8i-flex-instances-are-now-available/",
      "pubDate": "2025-08-28T19:35:40.000Z",
      "source": "newsBlog",
      "services": [
        "lex"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "lex",
        "now-available"
      ]
    },
    {
      "id": "aws-news-16b449b9bb8c",
      "title": "AWS services scale to new heights for Prime Day 2025: key metrics and milestones",
      "description": "Amazon Prime Day 2025 achieved record-breaking sales with enhanced AI shopping features, while AWS infrastructure handled unprecedented volumes of data—including 1.7 trillion Lambda invocations per day, DynamoDB peaking at 151 million requests per second, and a 77% increase in Fargate container tasks—showcasing the massive scalability required to power the four-day shopping event.",
      "link": "https://aws.amazon.com/blogs/aws/aws-services-scale-to-new-heights-for-prime-day-2025-key-metrics-and-milestones/",
      "pubDate": "2025-08-26T16:06:28.000Z",
      "source": "newsBlog",
      "services": [],
      "categories": [
        "news"
      ],
      "tags": [
        "ga"
      ]
    },
    {
      "id": "aws-news-9388e1a4988e",
      "title": "AWS Weekly Roundup: Amazon Aurora 10th anniversary, Amazon EC2 R8 instances, Amazon Bedrock and more (August 25, 2025)",
      "description": "As I was preparing for this week’s roundup, I couldn’t help but reflect on how database technology has evolved over the past decade. It’s fascinating to see how architectural decisions made years ago continue to shape the way we build modern applications. This week brings a special milestone that perfectly captures this evolution in cloud […]",
      "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-amazon-aurora-10th-anniversary-amazon-ec2-r8-instances-amazon-bedrock-and-more-august-25-2025/",
      "pubDate": "2025-08-25T16:30:43.000Z",
      "source": "newsBlog",
      "services": [
        "bedrock"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "bedrock"
      ]
    },
    {
      "id": "aws-news-ca52f29c313d",
      "title": "Best performance and fastest memory with the new Amazon EC2 R8i and R8i-flex instances",
      "description": "R8i and R8i-flex instances powered by Intel Xeon processors offer up to 15% better price performance, 20% higher performance, and 2.5 times more memory throughput compared to previous generations.",
      "link": "https://aws.amazon.com/blogs/aws/best-performance-and-fastest-memory-with-the-new-amazon-ec2-r8i-and-r8i-flex-instances/",
      "pubDate": "2025-08-19T19:16:24.000Z",
      "source": "newsBlog",
      "services": [
        "lex"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "lex"
      ]
    },
    {
      "id": "aws-news-6e94e435ee43",
      "title": "AWS Weekly Roundup: Single GPU P5 instances, Advanced Go Driver, Amazon SageMaker HyperPod and more (August 18, 2025)",
      "description": "Let me start this week’s update with something I’m especially excited about – the upcoming BeSA (Become a Solutions Architect) cohort. BeSA is a free mentoring program that I host along with a few other AWS employees on a volunteer basis to help people excel in their cloud careers. Last week, the instructors’ lineup was […]",
      "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-single-gpu-p5-instances-advanced-go-driver-amazon-sagemaker-hyperpod-and-more-august-18-2025/",
      "pubDate": "2025-08-18T15:39:10.000Z",
      "source": "newsBlog",
      "services": [
        "sagemaker",
        "hyperpod"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "sagemaker",
        "hyperpod",
        "update"
      ]
    },
    {
      "id": "aws-news-0b47e55e58e4",
      "title": "AWS named as a Leader in 2025 Gartner Magic Quadrant for Strategic Cloud Platform Services for 15 years in a row",
      "description": "AWS is recognized as a Leader in the 2025 Gartner Magic Quadrant for Strategic Cloud Platform Services for the fifteenth consecutive year. In the report, Gartner once again placed AWS highest on the “Ability to Execute” axis. We believe this reflects our ongoing commitment to giving customers the broadest and deepest set of capabilities to accelerate innovation as well as unparalleled security, reliability, and performance they can trust for their most critical applications.",
      "link": "https://aws.amazon.com/blogs/aws/aws-named-as-a-leader-in-2025-gartner-magic-quadrant-for-strategic-cloud-platform-services-for-15-years-in-a-row/",
      "pubDate": "2025-08-15T16:59:11.000Z",
      "source": "newsBlog",
      "services": [
        "nova"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "nova",
        "ga"
      ]
    },
    {
      "id": "aws-news-d2be49d3bcd1",
      "title": "Celebrating 10 years of Amazon Aurora innovation",
      "description": "Amazon Aurora is celebrating its 10th anniversary with a livestream event on August 21, 2025, highlighting a decade of database innovation since its groundbreaking architecture that decoupled storage from compute.",
      "link": "https://aws.amazon.com/blogs/aws/celebrating-10-years-of-amazon-aurora-innovation/",
      "pubDate": "2025-08-15T16:01:02.000Z",
      "source": "newsBlog",
      "services": [
        "nova"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "nova"
      ]
    },
    {
      "id": "aws-news-633d9f5945f1",
      "title": "Meet our newest AWS Heroes — August 2025",
      "description": "We are excited to announce the latest cohort of AWS Heroes, recognized for their exceptional contributions and technical leadership. These passionate individuals represent diverse regions and technical specialties, demonstrating notable expertise and dedication to knowledge sharing within the AWS community. From AI and machine learning to serverless architectures and security, our new Heroes showcase the […]",
      "link": "https://aws.amazon.com/blogs/aws/meet-our-newest-aws-heroes-august-2025/",
      "pubDate": "2025-08-13T16:17:05.000Z",
      "source": "newsBlog",
      "services": [],
      "categories": [
        "news"
      ],
      "tags": []
    },
    {
      "id": "aws-news-81c6c3e233a5",
      "title": "AWS Weekly Roundup: OpenAI models, Automated Reasoning checks, Amazon EVS, and more (August 11, 2025)",
      "description": "AWS Summits in the northern hemisphere have mostly concluded but the fun and learning hasn’t yet stopped for those of us in other parts of the globe. The community, customers, partners, and colleagues enjoyed a day of learning and networking last week at the AWS Summit Mexico City and the AWS Summit Jakarta. Last week’s […]",
      "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-openai-models-automated-reasoning-checks-amazon-evs-and-more-august-11-2025/",
      "pubDate": "2025-08-11T16:05:01.000Z",
      "source": "newsBlog",
      "services": [],
      "categories": [
        "news"
      ],
      "tags": []
    }
  ]
}