{
  "lastUpdated": "2025-11-19T06:15:49.009Z",
  "category": "news",
  "totalItems": 17,
  "items": [
    {
      "id": "aws-news-c38ecc4d691a",
      "title": "New Amazon Bedrock service tiers help you match AI workload performance with cost",
      "description": "Amazon Bedrock introduces three service tiers—Priority, Standard, and Flex—allowing you to optimize AI workload costs by matching performance requirements with pricing for different application needs.",
      "link": "https://aws.amazon.com/blogs/aws/new-amazon-bedrock-service-tiers-help-you-match-ai-workload-performance-with-cost/",
      "pubDate": "2025-11-18T22:29:46.000Z",
      "source": "newsBlog",
      "services": [
        "bedrock",
        "lex"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "bedrock",
        "lex"
      ]
    },
    {
      "id": "aws-news-14979180522f",
      "title": "Accelerate large-scale AI applications with the new Amazon EC2 P6-B300 instances",
      "description": "Amazon announces the general availability of EC2 P6-B300 instances, powered by NVIDIA Blackwell Ultra GPUs, which deliver 2x networking bandwidth and 1.5x GPU memory than previous generations, making them well suited for training and serving large-scale AI models with trillion parameters across distributed GPU clusters",
      "link": "https://aws.amazon.com/blogs/aws/accelerate-large-scale-ai-applications-with-the-new-amazon-ec2-p6-b300-instances/",
      "pubDate": "2025-11-18T22:16:16.000Z",
      "source": "newsBlog",
      "services": [
        "ec2"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "ec2"
      ]
    },
    {
      "id": "aws-news-317bf6461345",
      "title": "AWS Weekly Roundup: AWS Lambda for Rust, NLB for QUIC protocol, Amazon DCV for Mac, and more (November 17, 2025)",
      "description": "The weeks before AWS re:Invent, my team is full steam ahead preparing content for the conference. I can’t wait to meet you at one of my three talks: CMP346 : Supercharge AI/ML on Apple Silicon with EC2 Mac, CMP344: Speed up Apple application builds with CI/CD on EC2 Mac, and DEV416: Develop your AI Agents […]",
      "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-aws-lambda-load-balancers-amazon-dcv-amazon-linux-2023-and-more-november-17-2025/",
      "pubDate": "2025-11-17T17:59:08.000Z",
      "source": "newsBlog",
      "services": [
        "lambda",
        "ec2",
        "eks"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "lambda",
        "ec2",
        "eks"
      ]
    },
    {
      "id": "aws-news-050e6bf7fbc0",
      "title": "AWS Lambda enhances event processing with provisioned mode for SQS event-source mapping",
      "description": "AWS Lambda's new provisioned mode for Amazon SQS event source mapping offers dedicated polling resources that provide 3x faster scaling and 10x higher concurrency, enabling lower latency processing, better handling of traffic spikes, and greater control over event processing resources.",
      "link": "https://aws.amazon.com/blogs/aws/aws-lambda-enhances-sqs-processing-with-new-provisioned-mode-3x-faster-scaling-16x-higher-capacity/",
      "pubDate": "2025-11-14T17:45:04.000Z",
      "source": "newsBlog",
      "services": [
        "lambda",
        "sqs"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "lambda",
        "sqs"
      ]
    },
    {
      "id": "aws-news-550cb96aa581",
      "title": "Introducing Our Final AWS Heroes of 2025",
      "description": "With AWS re:Invent approaching, we’re celebrating three exceptional AWS Heroes whose diverse journeys and commitment to knowledge sharing are empowering builders worldwide. From advancing women in tech and rural communities to bridging academic and industry expertise and pioneering enterprise AI solutions, these leaders exemplify the innovative spirit that drives our community forward. Their stories showcase […]",
      "link": "https://aws.amazon.com/blogs/aws/introducing-our-final-aws-heroes-of-2025/",
      "pubDate": "2025-11-12T20:05:01.000Z",
      "source": "newsBlog",
      "services": [
        "nova"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "nova"
      ]
    },
    {
      "id": "aws-news-ab4858c18742",
      "title": "Secure EKS clusters with the new support for Amazon EKS in AWS Backup",
      "description": "AWS Backup now supports Amazon EKS, providing a fully managed, centralized solution to back up and restore Kubernetes clusters and application data without requiring custom scripts or third-party tools.",
      "link": "https://aws.amazon.com/blogs/aws/secure-eks-clusters-with-the-new-support-for-amazon-eks-in-aws-backup/",
      "pubDate": "2025-11-10T21:30:29.000Z",
      "source": "newsBlog",
      "services": [
        "eks"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "eks",
        "support"
      ]
    },
    {
      "id": "aws-news-5f7e69567c35",
      "title": "AWS Weekly Roundup: OpenAI partnership, Jane Goodall Institute research archive, and more (November 10, 2025)",
      "description": "AWS re:Invent 2025 is only 3 weeks away and I’m already looking forward to the new launches and announcements at the conference. Last year brought 60,000 attendees from across the globe to Las Vegas, Nevada, and the atmosphere was amazing. Registration is still open for AWS re:Invent 2025. We hope you’ll join us in Las Vegas […]",
      "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-amazon-s3-amazon-ec2-and-more-november-10-2025/",
      "pubDate": "2025-11-10T16:38:38.000Z",
      "source": "newsBlog",
      "services": [
        "eks"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "eks",
        "launch",
        "ga",
        "announcement"
      ]
    },
    {
      "id": "aws-news-407d35037c42",
      "title": "Introducing AWS Capabilities by Region for easier Regional planning and faster global deployments",
      "description": "AWS Capabilities by Region is a new planning tool that provides detailed visibility into AWS services, features, APIs, and CloudFormation resources across different AWS Regions, helping customers make informed decisions for global deployments and prevent costly rework through side-by-side regional comparisons and forward-looking roadmap information.",
      "link": "https://aws.amazon.com/blogs/aws/introducing-aws-capabilities-by-region-for-easier-regional-planning-and-faster-global-deployments/",
      "pubDate": "2025-11-06T21:30:58.000Z",
      "source": "newsBlog",
      "services": [
        "cloudformation"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "cloudformation",
        "roadmap"
      ]
    },
    {
      "id": "aws-news-8f208cf9f926",
      "title": "AWS Weekly Roundup: Project Rainier online, Amazon Nova Web Grounding, MCP Proxy for AWS, and more (November 3, 2025)",
      "description": "Last week I met Jeff Barr at the AWS Shenzhen Community Day. Jeff shared stories about how builders around the world are experimenting with generative AI and encouraged local developers to keep pushing ideas into real prototypes. Many attendees stayed after the sessions to discuss model grounding, evaluation, and how to bring generative AI into […]",
      "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-project-rainier-online-amazon-nova-amazon-bedrock-and-more-november-3-2025/",
      "pubDate": "2025-11-03T17:55:23.000Z",
      "source": "newsBlog",
      "services": [
        "nova"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "nova"
      ]
    },
    {
      "id": "aws-news-68a98b2b7ad5",
      "title": "Build more accurate AI applications with Amazon Nova Web Grounding",
      "description": "AWS announced Amazon Nova Web Grounding, a new built-in tool for Nova models on Amazon Bedrock that automatically retrieves current, cited information to reduce AI hallucinations and improve accuracy in applications requiring up-to-date factual data.",
      "link": "https://aws.amazon.com/blogs/aws/build-more-accurate-ai-applications-with-amazon-nova-web-grounding/",
      "pubDate": "2025-10-28T23:59:17.000Z",
      "source": "newsBlog",
      "services": [
        "bedrock",
        "nova"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "bedrock",
        "nova"
      ]
    },
    {
      "id": "aws-news-5e5024ca5957",
      "title": "Amazon Nova Multimodal Embeddings: State-of-the-art embedding model for agentic RAG and semantic search",
      "description": "Amazon Nova Multimodal Embeddings is a new state-of-the-art embedding model available in Amazon Bedrock. It is the industry’s first embedding model that supports text, documents, images, video, and audio through a single unified model, enabling cross-modal retrieval and semantic search applications with leading accuracy, at industry-leading costs.",
      "link": "https://aws.amazon.com/blogs/aws/amazon-nova-multimodal-embeddings-now-available-in-amazon-bedrock/",
      "pubDate": "2025-10-28T15:12:38.000Z",
      "source": "newsBlog",
      "services": [
        "bedrock",
        "nova"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "bedrock",
        "nova",
        "support"
      ]
    },
    {
      "id": "aws-news-16183f5d6511",
      "title": "AWS Weekly Roundup: AWS RTB Fabric, Carbon Footprint Tool for Scope 3, AWS Secret-West Region, and more (October 27, 2025)",
      "description": "This week started with challenges for many using services in the the North Virginia (us-east-1) Region. On Monday, we experienced a service disruption affecting DynamoDB and several other services due to a DNS configuration problem. The issue has been fully resolved, and you can read the full details in our official summary. As someone who […]",
      "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-aws-rtb-fabric-aws-customer-carbon-footprint-tool-aws-secret-west-region-and-more-october-27-2025/",
      "pubDate": "2025-10-27T16:37:17.000Z",
      "source": "newsBlog",
      "services": [
        "dynamodb"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "dynamodb"
      ]
    },
    {
      "id": "aws-news-1c1dddaf6ab7",
      "title": "Customer Carbon Footprint Tool Expands: Additional emissions categories including Scope 3 are now available",
      "description": "AWS has expanded its Customer Carbon Footprint Tool (CCFT) to include Scope 3 emissions data alongside updated Scope 1 and 2 emissions, giving customers more insight into their carbon impact. The CCFT now tracks emissions from fuel- and energy-related activities (FERA), IT hardware, buildings, equipment, and transportation. AWS customers can access this information and track changes over time through the AWS Billing console.",
      "link": "https://aws.amazon.com/blogs/aws/aws-customer-carbon-footprint-tool-now-includes-scope-3-emissions/",
      "pubDate": "2025-10-22T17:48:18.000Z",
      "source": "newsBlog",
      "services": [],
      "categories": [
        "news"
      ],
      "tags": [
        "now-available",
        "update"
      ]
    },
    {
      "id": "aws-news-81499b3fe296",
      "title": "Monitor, analyze, and manage capacity usage from a single interface with Amazon EC2 Capacity Manager",
      "description": "Amazon EC2 Capacity Manager is a new centralized solution that consolidates capacity monitoring and management across all AWS accounts and regions, eliminating operational overhead and providing optimization opportunities for EC2 infrastructure at scale.",
      "link": "https://aws.amazon.com/blogs/aws/monitor-analyze-and-manage-capacity-usage-from-a-single-interface-with-amazon-ec2-capacity-manager/",
      "pubDate": "2025-10-16T15:48:12.000Z",
      "source": "newsBlog",
      "services": [
        "ec2"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "ec2"
      ]
    },
    {
      "id": "aws-news-d39997d80f80",
      "title": "Introducing Amazon EBS Volume Clones: Create instant copies of your EBS volumes",
      "description": "AWS launched Amazon EBS Volume Clones, a new capability that allows users to create instant point-in-time copies of EBS volumes within the same Availability Zone with a single API call, eliminating the previous multi-step process of taking snapshots and creating volumes from them.",
      "link": "https://aws.amazon.com/blogs/aws/introducing-amazon-ebs-volume-clones-create-instant-copies-of-your-ebs-volumes/",
      "pubDate": "2025-10-14T21:35:05.000Z",
      "source": "newsBlog",
      "services": [],
      "categories": [
        "news"
      ],
      "tags": [
        "launch",
        "new-capability"
      ]
    },
    {
      "id": "aws-news-81db890df609",
      "title": "AWS Transfer Family SFTP connectors now support VPC-based connectivity",
      "description": "AWS Transfer Family SFTP connectors now support VPC-based connectivity, allowing secure file transfers between Amazon S3 and remote SFTP servers through your existing VPC infrastructure without exposing endpoints to the internet.",
      "link": "https://aws.amazon.com/blogs/aws/aws-transfer-family-sftp-connectors-now-support-vpc-based-connectivity/",
      "pubDate": "2025-10-14T19:27:31.000Z",
      "source": "newsBlog",
      "services": [
        "s3"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "s3",
        "support"
      ]
    },
    {
      "id": "aws-news-9703587847f1",
      "title": "AWS Weekly Roundup: Amazon Quick Suite, EC2 C8i, C8i-flex, and M8a instances, and more (October 13, 2025)",
      "description": "This week I was at the inaugural AWS AI in Practice meetup from the AWS User Group UK. AI-assisted software development and agents were the focus of the evening! Next week I’ll be in Italy for Codemotion (Milan) and an AWS User Group meetup (Rome). My sessions there will be about AI agents and context […]",
      "link": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-amazon-quick-suite-amazon-ec2-amazon-eks-and-more-october-13-2025/",
      "pubDate": "2025-10-13T16:24:15.000Z",
      "source": "newsBlog",
      "services": [
        "amazon q",
        "lex",
        "ec2"
      ],
      "categories": [
        "news"
      ],
      "tags": [
        "amazon q",
        "lex",
        "ec2"
      ]
    }
  ]
}