{
  "lastUpdated": "2025-09-28T06:13:55.996Z",
  "category": "personalization",
  "totalItems": 2,
  "items": [
    {
      "id": "aws-news-e7d9cf4c2ebe",
      "title": "Billing View now supports cost management data from multiple organizations",
      "description": "Today, AWS announces the general availability of new capabilities within AWS Billing and Cost Management that enable customers to manage their AWS spend across multiple organizations through a single AWS account. Customers can now share custom billing views containing cost management data with other AWS accounts outside their organization. Additionally, customers can combine multiple custom billing views to create new consolidated views. These features enable FinOps teams to create custom billing views containing cost management data for multiple organizations. These views can then be used to access cost management data across multiple organizations through Cost Explorer or set up budgets to monitor AWS costs.\n \nWith the new custom billing view capabilities, you can create consolidated views of cost management data spanning multiple organizations that can be accessed using AWS Cost Explorer and AWS Budgets, allowing you to monitor, analyze, and forecast spending patterns across multiple organizations. This helps customers operating multiple subsidiaries or business units as separate organizations on AWS manage their AWS spend through a single AWS account.\n \nSupport for custom billing views containing cost management data for multiple organizations is available in all AWS Regions, excluding AWS GovCloud Regions and the AWS China Regions. To get started with custom billing views, visit Billing View within the Cost Management Preferences page in the AWS Billing and Cost Management console and create a new custom billing view. To get started visit the Billing View user guide.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/billing-view-cost-management-multiple-organizations",
      "pubDate": "2025-09-25T12:00:00.000Z",
      "source": "whats-new",
      "services": [
        "forecast"
      ],
      "categories": [
        "personalization"
      ],
      "tags": [
        "forecast",
        "ga",
        "support"
      ]
    },
    {
      "id": "aws-news-e7c29bbdeaf8",
      "title": "Amazon OpenSearch Service now supports AI-powered forecasting",
      "description": "You can now generate AI-powered forecasts and visualizations on time-series data that has been indexed into Amazon OpenSearch domains.\n  Forecasts can be used to enhance various analytics use cases to power insights into trending infrastructure utilization and events, application or business metrics, and more. They can help you anticipate upcoming changes in areas such as business metrics, website traffic, system performance, and more. You can easily get started with this feature by setting up forecasts within OpenSearch dashboards or the OpenSearch UI. No data science or AI expertise is required.\n  AI-powered forecasts are available in all Amazon OpenSearch Service regions that support OpenSearch 3.1+ domains. Learn more from the documentation.",
      "link": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-opensearch-service-ai-forecasting",
      "pubDate": "2025-09-15T17:40:00.000Z",
      "source": "whats-new",
      "services": [
        "forecast"
      ],
      "categories": [
        "personalization"
      ],
      "tags": [
        "forecast",
        "support"
      ]
    }
  ]
}